[{"word": "balderdash", "definitionA": "senseless, stupid, or exaggerated talk or writing; nonsense.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Senseless talk or writing; nonsense.<br>&nbsp;&nbsp;&nbsp;2. A worthless mixture, especially of liquors.<br>&nbsp;&nbsp;&nbsp;3. Obscene language or writing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mix or adulterate.<br>", "etymology": "First recorded in 1590–1600; of obscure origin", "example": "But all this is ugly balderdash, which expresses not a single character nor feature.", "synonym": "bosh"}, {"word": "tetched", "definitionA": "touched; slightly crazy.", "definitionB": "No definition found", "etymology": "1925–30; variant of touched; perhaps representing earlier tached ( Middle English techyd ) in the compounds ( well- ) tached, ( evil- ) tached having the (specified) quality or disposition ( Middle English tach ( e ), tech ( e ) trait, spot, stain < Old French tache spot ( tachism ) + -ed 3 )", "example": "Don't you let him give you that thar big bun'le; 'caze that's not a thing but seed corn, and he'll be mad ef it's tetched.", "synonym": null}, {"word": "cohort", "definitionA": "a group or company:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A group of people supporting the same thing or person.<br>&nbsp;&nbsp;&nbsp;2. A demographic grouping of people, especially those in a defined age group, or having a common characteristic.<br>&nbsp;&nbsp;&nbsp;3. Any division of a Roman legion, normally of about 500 men.<br>&nbsp;&nbsp;&nbsp;4. An accomplice; abettor; associate.<br>&nbsp;&nbsp;&nbsp;5. Any band or body of warriors.<br>&nbsp;&nbsp;&nbsp;6. A natural group of orders of organisms, less comprehensive than a class.<br>&nbsp;&nbsp;&nbsp;7. A colleague.<br>&nbsp;&nbsp;&nbsp;8. A set of individuals in a program, especially when compared to previous sets of individuals within the same program.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To associate with such a group<br>", "etymology": "First recorded in 1475–85; from Middle French cohorte, from Latin cohort- (stem of cohors ) “farmyard, armed force (originally, from a particular place or camp), cohort, retinue,” equivalent to co- “with, together” + hort- (akin to hortus “garden”); replacing late Middle English cohors, from Latin; co-, com-", "example": "Forage did not disclose efficacy information, but said that “some” corporate partners hired up to 52% of the cohort from their programs.", "synonym": "accomplice"}, {"word": "jeopardy", "definitionA": "hazard or risk of or exposure to loss, harm, death, or injury:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Danger of loss, harm, or failure.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To jeopardize; to endanger.<br>", "etymology": "1200–50; Middle English j ( e ) uparti, joupardi ( e ), j ( e ) upardi ( e ) < Anglo-French, Old French: literally, divided game or play, hence, uncertain chance, problem (in chess or love), equivalent to j ( e ) u play, game (< Latin jocus joke ) + parti, past participle of partir to divide; party", "example": "Meanwhile, fears persist with Ginsburg gone that LGBTQ victories previously won at the Supreme Court will be in jeopardy.", "synonym": "accident"}, {"word": "shoddy", "definitionA": "of poor quality or inferior workmanship:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low-grade cloth made from by-products of wool processing, or from recycled wool.<br>&nbsp;&nbsp;&nbsp;2. Worthless goods.<br>&nbsp;&nbsp;&nbsp;3. Vulgar pretence or sham.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of poor quality or construction<br>&nbsp;&nbsp;&nbsp;2. Pretentious, sham, counterfeit<br>&nbsp;&nbsp;&nbsp;3. Ambitious by reason of newly-acquired wealth; nouveau riche<br>", "etymology": "First recorded in 1825–35; origin uncertain", "example": "Articles that make confident claims about parenting on the basis of shoddy evidence can fuel the fire—giving mommy-shamers unwarranted confidence to scold parents.", "synonym": "base"}, {"word": "pan", "definitionA": "a broad, shallow container of metal, usually having sides flaring outward toward the top, used in various forms for frying, baking, washing, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A wide, flat receptacle used around the house, especially for cooking.<br>&nbsp;&nbsp;&nbsp;2. The contents of such a receptacle.<br>&nbsp;&nbsp;&nbsp;3. A cylindrical receptacle about as tall as it is wide, with one long handle, usually made of metal, used for cooking in the home.<br>&nbsp;&nbsp;&nbsp;4. A deep plastic receptacle, used for washing or food preparation; a basin.<br>&nbsp;&nbsp;&nbsp;5. A wide receptacle in which gold grains are separated from gravel by washing the contents with water.<br>&nbsp;&nbsp;&nbsp;6. An expanse of level land located in a depression, especially<br>&nbsp;&nbsp;&nbsp;7. Short for hardpan: a hard substrate such as is formed in pans.<br>&nbsp;&nbsp;&nbsp;8. Strong adverse criticism.<br>&nbsp;&nbsp;&nbsp;9. A loaf of bread.<br>&nbsp;&nbsp;&nbsp;10. The chamber pot in a close stool; the base of a toilet, consisting of the bowl and its support.<br>&nbsp;&nbsp;&nbsp;11. A human face, a mug.<br>&nbsp;&nbsp;&nbsp;12. (roofing) The bottom flat part of a roofing panel that is between the ribs of the panel.<br>&nbsp;&nbsp;&nbsp;13. A closed vessel for boiling or evaporating as part of manufacture; a vacuum pan.<br>&nbsp;&nbsp;&nbsp;14. The part of a flintlock that holds the priming.<br>&nbsp;&nbsp;&nbsp;15. The skull, considered as a vessel containing the brain; the brainpan.<br>&nbsp;&nbsp;&nbsp;16. The brain, seen as one's intellect<br>&nbsp;&nbsp;&nbsp;17. A recess, or bed, for the leaf of a hinge.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wash in a pan (of earth, sand etc. when searching for gold).<br>&nbsp;&nbsp;&nbsp;2. To disparage; to belittle; to put down; to criticise severely.<br>&nbsp;&nbsp;&nbsp;3. With \"out\" (to pan out), to turn out well; to be successful.<br>&nbsp;&nbsp;&nbsp;4. (of a contest) To beat one's opposition convincingly.<br>&nbsp;&nbsp;&nbsp;5. To criticize harshly a work (like a book, movie, etc.)<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Meanings relating to a wind instrument.<br>&nbsp;&nbsp;&nbsp;2. Meanings relating to a hollow conduit.<br>&nbsp;&nbsp;&nbsp;3. Meanings relating to a container.<br>&nbsp;&nbsp;&nbsp;4. Meanings relating to something resembling a tube.<br>&nbsp;&nbsp;&nbsp;5. Meanings relating to computing.<br>&nbsp;&nbsp;&nbsp;6. Meanings relating to a smoking implement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a camera, etc.: to turn horizontally.<br>&nbsp;&nbsp;&nbsp;2. To move the camera lens angle while continuing to expose the film, enabling a contiguous view and enrichment of context. In still-photography large-group portraits the film usually remains on a horizontal fixed plane as the lens and/or the film holder moves to expose the film laterally. The resulting image may extend a short distance laterally or as great as 360 degrees from the point where the film first began to be exposed.<br>&nbsp;&nbsp;&nbsp;3. (audio) To spread a sound signal into a new stereo or multichannel sound field, typically giving the impression that it is moving across the sound stage.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A psychoactive preparation of betel leaf combined with areca nut and/or cured tobacco, chewed recreationally in Asia; such a preparation served wrapped in the leaf.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To join or fit together; to unite.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A part; a portion.<br>&nbsp;&nbsp;&nbsp;2. (fortifications) The distance comprised between the angle of the epaule and the flanked angle.<br>&nbsp;&nbsp;&nbsp;3. A leaf of gold or silver.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pansexual.<br>", "etymology": "First recorded before 900; Middle English, Old English panne; cognate with Dutch pan, German Pfanne, Old Norse panna; further origin uncertain, perhaps from assumed Vulgar Latin patna, panna “pan,” from Latin patena, patina “shallow dish, shallow pan, stewpan,” from Greek patánē “dish, flat dish.” Pan, in the sense “face,” is an Americanism first recorded in 1920–25; paten ( def )", "example": "These towels can quickly dry pots and pans after washing, and they are resistant to mildew and smelly odors.", "synonym": "casserole"}, {"word": "ambivalent", "definitionA": "having mixed feelings about someone or something; being unable to choose between two (usually opposing) courses of action:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Simultaneously experiencing or expressing opposing or contradictory feelings, beliefs, or motivations.<br>&nbsp;&nbsp;&nbsp;2. Alternately having one opinion or feeling, and then the opposite.<br>", "etymology": "Back formation from ambivalence", "example": "That’s when the anxious attachment style or ambivalent attachment style is created.", "synonym": null}, {"word": "banish", "definitionA": "to expel from or relegate to a country or place by authoritative decree; condemn to exile:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (heading) To send someone away and forbid that person from returning.<br>&nbsp;&nbsp;&nbsp;2. To expel, especially from the mind.<br>", "etymology": "First recorded in 1275–1325; Middle English banisshen, from Anglo-French, Old French baniss-, long stem of banir, from unrecorded Frankish bannjan “to proclaim,” akin to ban 1", "example": "He banishes her from the kingdom, penniless—stripped of everything, not even a beaten down energy ETF.", "synonym": "ban"}, {"word": "risible", "definitionA": "causing or capable of causing laughter; laughable; ludicrous.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to laughter<br>&nbsp;&nbsp;&nbsp;2. Provoking laughter; ludicrous; ridiculous; humorously insignificant<br>&nbsp;&nbsp;&nbsp;3. (of a person) Easily laughing; prone to laughter<br>", "etymology": "1550–60; < Late Latin rīsibilis that can laugh, equivalent to Latin rīs ( us ) laughed (past participle of rīdēre to laugh) + -ibilis -ible", "example": "The latter stages of the film, in which a conspiracy is broadly sketched out, would be wobbly enough without Oliver Stone making JFK out to be some sort of saint—but his soft-soaping of JFK’s management of the Bay of Pigs crisis is risible.", "synonym": null}, {"word": "casserole", "definitionA": "a baking dish of glass, pottery, etc., usually with a cover.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dish of glass or earthenware, with a lid, in which food is baked and sometimes served.<br>&nbsp;&nbsp;&nbsp;2. Food, such as a stew, cooked in such a dish.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cook like, or as, a casserole; to stew.<br>", "etymology": "First recorded in 1700–10; from French: “ladlelike pan,” equivalent to casse “small saucepan” (from Old Provençal cassa “large spoon,” akin to Medieval Latin cattia “crucible”; of disputed origin) + -role diminutive suffix", "example": "There’s a new casserole dish in town from Instagram-favorite Great Jones, and it’s as cute as the rest of the line.", "synonym": "goulash"}, {"word": "bosh", "definitionA": "absurd or foolish talk; nonsense.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of disbelief or annoyance.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The lower part of a blast furnace, between the hearth and the stack.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A figure.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of speedy and satisfactory completion of a simple or straightforward task.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To consume (illicit drugs).<br>", "etymology": "1830–35; < Turkish boş empty; popularized from its use in the novel Ayesha (1834) by British author James J. Morier (1780–1849)", "example": "“Somebody had to break the ice,” Bosh, whose own sexuality has been questioned in recent years, says.", "synonym": "bull"}]