[{"word": "arraign", "definitionA": "Law. to call or bring before a court to answer to an indictment, a formal charge for which it has been ascertained that there is enough evidence to warrant trial:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Arraignment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To officially charge someone in a court of law.<br>&nbsp;&nbsp;&nbsp;2. To call to account, or accuse, before the bar of reason, taste, or any other tribunal.<br>", "etymology": "First recorded in 1275–1325; Middle English arainen, from Anglo-French arainer, Old French araisnier, equivalent to a- a- 5 + raisnier, from unrecorded Vulgar Latin ratiōnāre “to talk, reason”; ratio", "example": "Hodges was arraigned in 2001 and eventually pleaded guilty to felony commercial burglary.", "synonym": "charge"}, {"word": "opsimath", "definitionA": "a person who learns late in life", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who learns late in life.<br>", "etymology": "C19: from Greek opsimathēs, from opse late + math- learn", "example": null, "synonym": null}, {"word": "chrestomathy", "definitionA": "a collection of selected literary passages, often by one author and especially from a foreign language.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection of written passages, used to learn an unfamiliar language.<br>&nbsp;&nbsp;&nbsp;2. A collection of choice passages from an author or authors.<br>", "etymology": "1825–35; < New Latin chrestomathia < Greek chrēstomátheia, equivalent to chrēstó ( s ) useful ( chrēs-, stem of chrêsthai to use + -tos verbal adjective suffix) + math- (variant stem of manthánein to learn) + -eia -y 3", "example": "The Persian text of these fables appeared in 1805 in the chrestomathy appended to Fr.", "synonym": "ana"}, {"word": "polymathy", "definitionA": "learning in many fields; encyclopedic knowledge.", "definitionB": "No definition found", "etymology": "1635–45; < Greek polymathía; polymath, -y 3", "example": null, "synonym": null}, {"word": "opisthograph", "definitionA": "a manuscript, parchment, or book having writing on both sides of the leaves.", "definitionB": "No definition found", "etymology": "1615–25; < Latin opisthographus < Greek opisthógraphos; opistho-, -graph", "example": "Such inscriptions are called opisthograph, that is, written behind.", "synonym": null}, {"word": "catachresis", "definitionA": "misuse or strained use of words, as in a mixed metaphor, occurring either in error or for rhetorical effect.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A misuse of a word; an application of a term to something which it does not properly denote.<br>&nbsp;&nbsp;&nbsp;2. A misapplication or overextension of figurative or analogical description; a wrongly-applied metaphor or trope.<br>", "etymology": "First recorded in 1580–90; from Latin catachrēsis, from Greek katáchrēsis “a misuse or misapplication of a word or phrase” (derivative of katachrêsthai “to misuse”), equivalent to kata- verb prefix implying waste or consumption + chrêsis “use” (noun derivative of chrê(sthai) “to use, need”) + -sis verbal abstract noun suffix. See cata-, -sis", "example": "No expression so terse and yet so striking could dispense with the classicism and the catachresis of \"stoically.\"", "synonym": "coarseness"}, {"word": "sterile", "definitionA": "free from living germs or microorganisms; aseptic:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unable to reproduce (or procreate).<br>&nbsp;&nbsp;&nbsp;2. Terse; lacking sentiment or emotional stimulation, as in a manner of speaking.<br>&nbsp;&nbsp;&nbsp;3. Fruitless, uninspiring, or unproductive.<br>&nbsp;&nbsp;&nbsp;4. Germless; free from all living or viable microorganisms.<br>&nbsp;&nbsp;&nbsp;5. Free from dangerous objects, as a zone in an airport that can be only be entered via a security checkpoint.<br>&nbsp;&nbsp;&nbsp;6. Of weapons: foreign-made and untraceable to the United States.<br>", "etymology": "First recorded in 1545–55; from Latin sterilis “barren, unfruitful”", "example": "Complete with 348 items, organized neatly into 20 inner compartments, you’ll get a comprehensive kit including 28 sting relief pads, 10 large sterile gauze pads, and one emergency glow stick.", "synonym": null}, {"word": "cautery", "definitionA": "an escharotic substance, electric current, or hot iron used to destroy tissue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The process of using either extreme heat or extreme cold to either cut or seal body tissue.<br>&nbsp;&nbsp;&nbsp;2. A device used for cutting or sealing body tissue.<br>", "etymology": "1350–1400; Middle English < Latin cautērium < Greek kautḗrion, equivalent to kautḗr branding iron ( cauterize ) + -ion diminutive suffix", "example": "Monell, Bigelow, Massey, and Bartholow know electricity about the nose only as a cautery.", "synonym": null}, {"word": "encaustic", "definitionA": "painted with wax colors fixed with heat, or with any process in which colors are burned in.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A wax-based paint that is fixed in place by heating<br>&nbsp;&nbsp;&nbsp;2. A painting produced using this paint<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Prepared by means of heat; burned in.<br>", "etymology": "1650–60; < Latin encausticus < Greek enkaustikós for burning in. See en- 2, caustic", "example": "He works in encaustic, a mix of pigment and hot wax that requires a quick hand and whose immediacy has “a sonic quality,” he told a recent visitor to Hemphill Artworks.", "synonym": null}, {"word": "caustic", "definitionA": "capable of burning, corroding, or destroying living tissue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any substance or means which, applied to animal or other organic tissue, burns, corrodes, or destroys it by chemical action; an escharotic.<br>&nbsp;&nbsp;&nbsp;2. The envelope of reflected or refracted rays of light for a given surface or object.<br>&nbsp;&nbsp;&nbsp;3. The envelope of reflected or refracted rays for a given curve.<br>&nbsp;&nbsp;&nbsp;4. Caustic soda.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Capable of burning, corroding or destroying organic tissue.<br>&nbsp;&nbsp;&nbsp;2. (of language, etc.) Sharp, bitter, cutting, biting, and sarcastic in a scathing way.<br>", "etymology": "1350–1400; Middle English < Latin causticus < Greek kaustikós burning, caustic, equivalent to kaust ( ós ) burnt (verbal adjective of kaíein to burn) + -ikos -ic", "example": "These are endeavors one would be unlikely to attempt without a space to screw things up or spill caustic liquids or explode an engine or two without ruining your carpet.", "synonym": "astringent"}, {"word": "holism", "definitionA": "Philosophy.  the theory that whole entities, as fundamental components of reality, have an existence other than as the mere sum of their parts. Compare organicism ( def 1 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A theory or belief that the whole is greater than the sum of the parts.<br>&nbsp;&nbsp;&nbsp;2. A practice based on such a theory or belief.<br>", "etymology": "hol- + -ism; term introduced by J.C. Smuts in Holism and Evolution (1926)", "example": "Although holism sees human beings as integral organisms, holistic approaches are inclined to have this physical focus.", "synonym": null}, {"word": "hologram", "definitionA": "a negative produced by exposing a high-resolution photographic plate, without camera or lens, near a subject illuminated by monochromatic, coherent radiation, as from a laser: when it is placed in a beam of coherent light a true three-dimensional image of the subject is formed.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A three-dimensional image of an object created by holography.<br>", "etymology": "First recorded in 1945–50; holo- + -gram 1", "example": "The other people’s avatars have clear indicators of their digital nature, whether it’s a generally cartoony appearance or a vaguely translucent nature consistent with what pop culture often presents as a hologram.", "synonym": null}, {"word": "insouciant", "definitionA": "free from concern, worry, or anxiety; carefree; nonchalant.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Casually unconcerned; carefree, indifferent, nonchalant.<br>", "etymology": "First recorded in 1820–30; from French, equivalent to in- in- 3 + souciant “worrying,” present participle of soucier “to worry,” from Vulgar Latin sollicītāre (unrecorded), from Latin sollicitāre “to disturb”; solicitous", "example": "Her poems are marked by an insouciant sense of hope, something she sees as a necessity in these times.", "synonym": null}, {"word": "nonchalant", "definitionA": "coolly unconcerned, indifferent, or unexcited; casual:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Casually calm and relaxed.<br>&nbsp;&nbsp;&nbsp;2. Indifferent; unconcerned; behaving as if detached.<br>", "etymology": "First recorded in 1725–35; from French nonchalant, present participle of obsolete nonchaloir “to lack warmth (of heart), be indifferent,” equivalent to non- prefix meaning “not” + chaloir, from Latin calēre “to be warm”; non-, -ant", "example": "My son’s nonchalant response to my coming out was one of the greatest gifts I’ve ever received.", "synonym": null}]