[{"word": "lethargic", "definitionA": "of, relating to, or affected with lethargy; drowsy; sluggish; apathetic.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sluggish, slow<br>&nbsp;&nbsp;&nbsp;2. Indifferent, apathetic<br>", "etymology": "First recorded in 1350–1400; from Latin lēthargicus, from Greek lēthargikós; replacing Middle English litargik, from Medieval Latin litargicus ( lethargy, -ic )", "example": "Many millennials are saddled with substantial debt and lethargic incomes, causing them to become financially disadvantaged.", "synonym": null}, {"word": "acquiesce", "definitionA": "to assent tacitly; submit or comply silently or without protest; agree; consent:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (with in (or sometimes with, to)) To rest satisfied, or apparently satisfied, or to rest without opposition and discontent (usually implying previous opposition or discontent); to accept or consent by silence or by omitting to object.<br>&nbsp;&nbsp;&nbsp;2. To concur upon conviction; as, to acquiesce in an opinion; to assent to; usually, to concur, not heartily but so far as to forbear opposition.<br>", "etymology": "First recorded in 1610–20; from Latin acquiēscere “to find rest in, ” equivalent to ac- ac- + quiē- + -sc- inchoative suffix + -ere infinitive suffix", "example": "Although Red Bull had already decided to ditch Perez, he was reluctant to leave and his management sought the best possible compensation agreement before acquiescing.", "synonym": "accept"}, {"word": "qualm", "definitionA": "an uneasy feeling or pang of conscience as to conduct; compunction:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feeling of apprehension, doubt, fear etc.<br>&nbsp;&nbsp;&nbsp;2. A sudden sickly feeling; queasiness.<br>&nbsp;&nbsp;&nbsp;3. A prick of the conscience; a moral scruple, a pang of guilt. (Now often in negative constructions.)<br>&nbsp;&nbsp;&nbsp;4. Mortality; plague; pestilence.<br>&nbsp;&nbsp;&nbsp;5. A calamity or disaster.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a sickly feeling.<br>", "etymology": "First recorded in 1520–30; origin uncertain", "example": "When I sat in on focus groups of undecided voters last fall, a pattern became clear: Plenty had qualms about Trump, but they had confidence in his ability to improve the economy.", "synonym": "agitation"}, {"word": "mizzen", "definitionA": "a fore-and-aft sail set on a mizzenmast. Compare crossjack, spanker ( def 1a ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mizzenmast.<br>&nbsp;&nbsp;&nbsp;2. A fore-and-aft sail set on a mizzenmast.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Hindmost; nearest the stern.<br>", "etymology": "1375–1425; late Middle English meson, mesan, probably < Italian mezzana", "example": "I now have to keep fencing with Accrux while I have managed to throw your sword flying and getting stuck into the mizzen mast.", "synonym": "behind"}, {"word": "mizzle", "definitionA": "to rain in fine drops; drizzle; mist.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Misty rain or drizzle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rain in very fine drops.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To abscond, scram, flee.<br>&nbsp;&nbsp;&nbsp;2. To yield.<br>&nbsp;&nbsp;&nbsp;3. To muddle or confuse. (Probably from a misreading of past tense/participle misled.)<br>", "etymology": "First recorded in 1475–85; late Middle English missellen, missill; cognate with Dutch (dialect) mizzelen, Low German miseln “to drizzle”; akin to Middle Dutch misel “mist, dew”; -le", "example": "The murk and mizzle kept the players off for almost three hours, though the break did little to stall England's momentum.", "synonym": "drip"}, {"word": "esoteric", "definitionA": "understood by or meant for only the select few who have special knowledge or interest; recondite:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An esoteric doctrine or treatise; esoteric philosophy.<br>&nbsp;&nbsp;&nbsp;2. One who believes, or is an initiate, in esoteric doctrines or rites.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Intended for or likely to be understood by only a small number of people with a specialized knowledge or interest, or an enlightened inner circle.<br>&nbsp;&nbsp;&nbsp;2. Having to do with concepts that are highly theoretical and without obvious practical application; often with mystical or religious connotations.<br>&nbsp;&nbsp;&nbsp;3. Confidential; private.<br>", "etymology": "First recorded in 1645–55; from Greek esōterikós “inner,” equivalent to esṓter(os) “inner” + -ikos -ic", "example": "“Gurrelieder” is the first sign of the real Schoenberg, whose music, no matter how thorny or how esoteric, always embraced the big picture relating the past to the future.", "synonym": null}, {"word": "ecumenical", "definitionA": "general; universal.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to the universal Church, representing the entire Christian world; interdenominational; sometimes by extension, interreligious.<br>&nbsp;&nbsp;&nbsp;2. General, universal, worldwide.<br>", "etymology": "1835–45; < Late Latin oecumenicus belonging to the whole inhabited world (< Greek oikoumenikós, equivalent to oikoumen- (stem of passive present participle of oikeîn to inhabit) + -ikos -ic ) + -al 1", "example": "In 1431, the ecumenical Council of Basel ordered the deans and rectors of churches to expel \"frivolities\" and \"profane abuses\" from holy buildings, but implicitly allowed them to take place in the squares outside.", "synonym": null}, {"word": "ecumenics", "definitionA": "the study of the Christian church in its aspect as a worldwide Christian community.", "definitionB": "No definition found", "etymology": "First recorded in 1935–40; ecumenical, -ics", "example": "But the “high point of my career,” Reese said, were two articles he published by Cardinal Walter Kasper, the Vatican official in charge of ecumenics.", "synonym": null}, {"word": "eremite", "definitionA": "a hermit or recluse, especially one under a religious vow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hermit; a religious recluse, someone who lives alone.<br>", "etymology": "1150–1200; Middle English < Late Latin erēmīta hermit", "example": "The film opens with a quote defining the word hermit, or eremite, as \"a person who lives in seclusion from society.\"", "synonym": "anchorite"}, {"word": "feisty", "definitionA": "full of animation, energy, or courage; spirited; spunky; plucky:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tenacious, energetic, spunky.<br>&nbsp;&nbsp;&nbsp;2. Belligerent; prepared to stand and fight, especially in spite of relatively small stature or some other disadvantage.<br>&nbsp;&nbsp;&nbsp;3. Easily offended and ready to bicker.<br>", "etymology": "An Americanism dating back to 1895–1900; feist + -y 1", "example": "Madison has been sweeping through the critics group prizes for her portrayal of Ani, the feisty sex worker in “Anora,” and understandably so.", "synonym": null}, {"word": "condone", "definitionA": "to disregard or overlook (something illegal, objectionable, or the like):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To forgive, excuse or overlook (something that is considered morally wrong, offensive, or generally disliked).<br>&nbsp;&nbsp;&nbsp;2. To allow, accept or permit (something that is considered morally wrong, offensive, or generally disliked).<br>&nbsp;&nbsp;&nbsp;3. To forgive (marital infidelity or other marital offense).<br>", "etymology": "First recorded in 1615–25, but in general currency from its use in the British Divorce Act of 1857 (see  condone def 5 ); from Latin condōnāre “to absolve, grant pardon,” equivalent to con- “with, together” + dōnāre “to give”; con-, donate", "example": "Bosses who encouraged and condoned such attempts to evade the feds typically faced no repercussions.", "synonym": "buy"}, {"word": "linchpin", "definitionA": "a pin inserted through the end of an axletree to keep the wheel on.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pin inserted through holes at the end of an axle or shaft, so as to secure a wheel or shaft-mounted device.<br>&nbsp;&nbsp;&nbsp;2. A central cohesive source of stability and security; a person or thing that is critical to a system or organisation.<br>", "etymology": "First recorded in 1350–1400; unexplained alteration of Middle English linpin, lynspin, equivalent to lyns, linch, lens, Old English lynis “axle-pin, axletree” (cognate with German Lünse ) + pin pin", "example": "In the Senate, he has been a linchpin for bipartisan legislation on issues as eclectic as electoral reform, pandemic-era economic relief, marriage rights and infrastructure development.", "synonym": "anchor"}, {"word": "urbane", "definitionA": "having the polish and suavity regarded as characteristic of sophisticated social life in major cities:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a man) Courteous, polite, refined, and suave.<br>", "etymology": "1525–35; (< Middle French urbain ) < Latin urbānus ( urban; for difference in stress and second syllable human, humane )", "example": "Being seen at a café here is considered hip and urbane, and that has helped drive young customers through the doors.", "synonym": null}, {"word": "riant", "definitionA": "laughing; smiling; cheerful:", "definitionB": "No definition found", "etymology": "First recorded in 1560–70; from French, “smiling, laughing,” adjective use of present participle of rire “to laugh,” from Latin rīdēre; rident ( def ), -ant", "example": "I have just mentioned Niels Andersen, and this good figure, at once so droll and so lovable, emerges all riant in my memory.", "synonym": null}, {"word": "rident", "definitionA": "laughing; smiling; cheerful.", "definitionB": "No definition found", "etymology": "1600–10; < Latin rīdent- (stem of rīdēns, present participle of rīdēre to laugh); -ent", "example": "Utopia 56 member Perine Rident says the Olympic Games can also draw attention to the broader problem.", "synonym": null}, {"word": "risible", "definitionA": "causing or capable of causing laughter; laughable; ludicrous.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to laughter<br>&nbsp;&nbsp;&nbsp;2. Provoking laughter; ludicrous; ridiculous; humorously insignificant<br>&nbsp;&nbsp;&nbsp;3. (of a person) Easily laughing; prone to laughter<br>", "etymology": "1550–60; < Late Latin rīsibilis that can laugh, equivalent to Latin rīs ( us ) laughed (past participle of rīdēre to laugh) + -ibilis -ible", "example": "I hadn’t been to an Angels game in a few years, and the stadium was as risible as I remembered it, if not more so.", "synonym": null}, {"word": "deride", "definitionA": "to laugh at in scorn or contempt; scoff or jeer at; mock.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To harshly mock; ridicule.<br>", "etymology": "First recorded in 1520–30; from Latin dērīdēre “to mock,” equivalent to dē- de- + rīdēre “to laugh”", "example": "Today many on the right still deride the Carter years but as the decades passed, his humanitarian efforts and simple lifestyle began to shape a new legacy for many Americans.", "synonym": "banter"}]