[{"word": "thug", "definitionA": "a violent, lawless, or vicious person, especially one who commits a crime such as assault, robbery, or murder:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire.<br>&nbsp;&nbsp;&nbsp;2. One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her.<br>&nbsp;&nbsp;&nbsp;3. In gardening, an over-vigorous plant that spreads and dominates the flowerbed.<br>&nbsp;&nbsp;&nbsp;4. A punk; a hoodlum; a hooligan.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To commit acts of thuggery, to live the life of a thug, or to dress and act in a manner reminiscent of someone who does.<br>", "etymology": "First recorded in 1800–10; from Hindi, Marathi ṭhag “swindler, cheat, rogue,” perhaps from Sanskrit sthaga- “a cheat,” from sthagati “he conceals”", "example": "Mike has busted broncos, been tossed by bulls, alienated his former wife with his stoicism and, most recently, taken on various thugs.", "synonym": "delinquent"}, {"word": "encumber", "definitionA": "to impede or hinder; hamper:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To load down something with a burden<br>&nbsp;&nbsp;&nbsp;2. To restrict or block something with a hindrance or impediment<br>&nbsp;&nbsp;&nbsp;3. To burden with a legal claim or other obligation<br>", "etymology": "First recorded in 1300–50; Middle English encombren, encombre, encomber, from Anglo-French, Middle French encombrer, equivalent to en- prefix + -combrer, verbal derivative of combre “dam, weir,” from early Medieval Latin combrus, from Gaulish comberos (unrecorded) “confluence, bringing together” (compare Quimper, in Brittany, from Breton Kemper ); en- 1, com-, bear 1", "example": "Yes, you have complete control, but you are more encumbered through travel.", "synonym": "block"}, {"word": "tenebrous", "definitionA": "dark; gloomy; obscure.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Dark and gloomy<br>", "etymology": "First recorded in 1375–1425; late Middle English word from Latin word tenebrōsus. See Tenebrae, -ous", "example": "The Republicans, however, sat with tenebrous expressions that matched the black curtain hiding their legs.", "synonym": null}, {"word": "cumulus", "definitionA": "a heap; pile.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large white puffy cloud that develops through convection. On a hot, humid day, they can form towers and even become cumulonimbus clouds.<br>&nbsp;&nbsp;&nbsp;2. A mound or heap.<br>", "etymology": "1650–60; < New Latin ( Latin: mass, pile)", "example": "Suddenly, I found myself hiking through clouds, wisps of cumulus drifting across the trail and through the dwarf pine trees and between barren, limbless trunks of the high-alpine forest.", "synonym": null}, {"word": "cumulate", "definitionA": "to heap up; amass; accumulate.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An igneous rock formed by the accumulation of crystals from a magma either by settling or floating.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To accumulate; to amass.<br>&nbsp;&nbsp;&nbsp;2. To be accumulated.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Accumulated, agglomerated, amassed<br>", "etymology": "1525–35; < Latin cumulātus (past participle of cumulāre to heap up, pile up, accumulate), equivalent to cumul ( us ) a heap, pile, mass, cumulus + -ātus -ate 1", "example": "Quod ipsum in ducendis lineis Directorii fecimus et peritis cumulate satisfactum confidimus.", "synonym": "accrue"}, {"word": "coeliac", "definitionA": "of or relating to the abdomen", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who has coeliac disease.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to the abdomen, or to the cavity of the abdomen.<br>&nbsp;&nbsp;&nbsp;2. Abbreviation of coeliac disease; used attributively.<br>", "etymology": "C17: from Latin coeliacus, from Greek koiliakos, from koilia belly", "example": "The coeliac axis is a thick, short artery, which almost immediately divides into the gastric, hepatic and splenic branches.", "synonym": null}, {"word": "halcyon", "definitionA": "calm; peaceful; tranquil:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A kingfisher said in classical mythology to nest on the sea, thereby calming the waters.<br>&nbsp;&nbsp;&nbsp;2. A tropical kingfisher of the genus Halcyon, such as the sacred kingfisher (Halcyon sancta) of Australia.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to the halcyon or kingfisher.<br>&nbsp;&nbsp;&nbsp;2. Calm, undisturbed, peaceful, serene.<br>", "etymology": "First recorded in 1350–1400; from Latin, from Greek halkyṓn, pseudo-etymological variant of alkyṓn “kingfisher”; replacing Middle English alceon, alicion, from Latin alcyōn, from Greek", "example": "Voters, many too young remember, were partly seduced by the 64-year-old’s misleading presentation of his late father’s dictatorial rule as a halcyon economic age to be revived.", "synonym": "bucolic"}, {"word": "accumulate", "definitionA": "to gather or collect, often in gradual degrees; heap up:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To heap up in a mass; to pile up; to collect or bring together (either literally or figuratively)<br>&nbsp;&nbsp;&nbsp;2. To grow or increase in quantity or number; to increase greatly.<br>&nbsp;&nbsp;&nbsp;3. To take a higher degree at the same time with a lower degree, or at a shorter interval than usual.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Collected; accumulated.<br>", "etymology": "First recorded in 1520–30; from Latin accumulātus “heaped up,” past participle of accumulāre “to heap up,” from ac- ac- + cumul(us) “heap” ( cumulus ( def ) ) + -āre, infinitive verb suffix", "example": "A lot of restaurants are accumulating debt via loans or depleting whatever funds they have left, the hole is going to be too big to get out of which will result in many more restaurant doors closing.", "synonym": "agglomerate"}, {"word": "agglomerate", "definitionA": "to collect or gather into a cluster or mass.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection or mass.<br>&nbsp;&nbsp;&nbsp;2. A mass of angular volcanic fragments united by heat; distinguished from conglomerate.<br>&nbsp;&nbsp;&nbsp;3. An ice cover of floe formed by the freezing together of various forms of ice.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wind or collect into a ball; hence, to gather into a mass or anything like a mass.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Collected into a ball, heap, or mass<br>", "etymology": "1675–85; < Latin agglomerātus (past participle of agglomerāre ), equivalent to ag- ag- + glomer- (stem of glomus ball of yarn) + -ātus -ate 1", "example": "It contained countless stars agglomerated in huge clusters, now called galaxies.", "synonym": "aggregate"}, {"word": "aggregate", "definitionA": "formed by the conjunction or collection of particulars into a whole mass or sum; total; combined:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mass, assemblage, or sum of particulars; something consisting of elements but considered as a whole.<br>&nbsp;&nbsp;&nbsp;2. A mass formed by the union of homogeneous particles; – in distinction from a compound, formed by the union of heterogeneous particles.<br>&nbsp;&nbsp;&nbsp;3. A set (collection of objects).<br>&nbsp;&nbsp;&nbsp;4. The full chromatic scale of twelve equal tempered pitches.<br>&nbsp;&nbsp;&nbsp;5. The total score in a set of games between teams or competitors, usually the combination of the home and away scores<br>&nbsp;&nbsp;&nbsp;6. (roofing) Crushed stone, crushed slag or water-worn gravel used for surfacing a built-up roof system.<br>&nbsp;&nbsp;&nbsp;7. Solid particles of low aspect ratio added to a composite material, as distinguished from the matrix and any fibers or reinforcements, especially the gravel and sand added to concrete.<br>&nbsp;&nbsp;&nbsp;8. Any of the five attributes that constitute the sentient being.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bring together; to collect into a mass or sum.<br>&nbsp;&nbsp;&nbsp;2. To add or unite (e.g. a person), to an association.<br>&nbsp;&nbsp;&nbsp;3. To amount in the aggregate to.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Formed by a collection of particulars into a whole mass or sum; collective; combined; added up.<br>&nbsp;&nbsp;&nbsp;2. Consisting or formed of smaller objects or parts.<br>&nbsp;&nbsp;&nbsp;3. Formed into clusters or groups of lobules.<br>&nbsp;&nbsp;&nbsp;4. Composed of several florets within a common involucre, as in the daisy; or of several carpels formed from one flower, as in the raspberry.<br>&nbsp;&nbsp;&nbsp;5. Having the several component parts adherent to each other only to such a degree as to be separable by mechanical means.<br>&nbsp;&nbsp;&nbsp;6. United into a common organized mass; said of certain compound animals.<br>", "etymology": "First recorded in 1375–1425; late Middle English, from Latin aggregātus (past participle of aggregāre ), equivalent to ag- ag- + greg- (stem of grex “flock”) + -ātus -ate 1", "example": "For aggregate outcomes, we run millions of simulations using the individual race predictions to derive the range of possible overall outcomes for the electoral college and both chambers of Congress.", "synonym": "added"}, {"word": "amalgamate", "definitionA": "to mix or merge so as to make a combination; blend; unite; combine:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To merge, to combine, to blend, to join.<br>&nbsp;&nbsp;&nbsp;2. To make an alloy of a metal and mercury.<br>&nbsp;&nbsp;&nbsp;3. To combine (free groups) by identifying respective isomorphic subgroups.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Coalesced; united; combined.<br>", "etymology": "1635–45 amalgam + -ate 1( def )", "example": "Producers are amalgamating two productions with harrowingly topical stories for a run on alternating nights at the Lyceum Theatre.", "synonym": "admix"}]