[{"word": "widower", "definitionA": "a man who has lost his spouse by death and has not remarried.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A man whose spouse has died (and who has not remarried); masculine of widow.<br>", "etymology": "1325–75; late Middle English ( widow, -er 1 ); replacing widow (now dial.), Old English wydewa", "example": "Sadly, I now visit Muse and other locations as a widower, having lost my partner and husband of 29 years in 2020.", "synonym": null}, {"word": "chthonic ", "definitionA": "Dwelling within or under the earth.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Dwelling within or under the earth.<br>", "etymology": null, "example": null, "synonym": "lower"}, {"word": "aspherical ", "definitionA": "(of a reflecting surface or lens) deviating slightly from a perfectly spherical 1 shape and relatively free from aberrations.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not (quite) spherical<br>", "etymology": "irst recorded in 1920–25; a- 6 + spherical", "example": null, "synonym": null}, {"word": "taunt", "definitionA": "to reproach in a sarcastic, insulting, or jeering manner; mock.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A scornful or mocking remark; a jeer or mockery<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make fun of (someone); to goad (a person) into responding, often in an aggressive manner.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Very high or tall.<br>", "etymology": "First recorded in 1505–15; origin uncertain", "example": "He repeated his taunt when the plane was fourth in line for takeoff.", "synonym": "brickbat"}, {"word": "betwixt", "definitionA": "Chiefly South Midland and Southern U.S. between.", "definitionB": "&#60;preposition&#62;<br>&nbsp;&nbsp;&nbsp;1. Between.<br>", "etymology": "before 950; Middle English betwix, Old English betwix, betweox, equivalent to be- be- + tweox, cognate with Old High German zwiski two each; akin to German zwischen between (preposition)", "example": "When we speak against one capital vice, we ought to speak against its opposite; the middle betwixt both is the point for virtue.", "synonym": null}, {"word": "parley", "definitionA": "a discussion or conference.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A conference, especially one between enemies.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a discussion, especially one between enemies.<br>", "etymology": "1400–50; late Middle English parlai < Middle French parlee, noun use of feminine of parle, past participle of parler to parle", "example": "I’m a tried-and-true Chaco advocate, but on this trip I liked the Parley, because it added a layer of protection from the sun for my feet.", "synonym": "confab"}, {"word": "palaver", "definitionA": "a conference or discussion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A village council meeting.<br>&nbsp;&nbsp;&nbsp;2. Talk, especially unnecessary talk; chatter.<br>&nbsp;&nbsp;&nbsp;3. Talk intended to deceive.<br>&nbsp;&nbsp;&nbsp;4. Fuss.<br>&nbsp;&nbsp;&nbsp;5. A meeting at which there is much talk; a debate; a moot.<br>&nbsp;&nbsp;&nbsp;6. Disagreement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To discuss with much talk.<br>&nbsp;&nbsp;&nbsp;2. To flatter.<br>", "etymology": "First recorded in 1710–20; noun from Portuguese palavra “word, speech, talk,” from Late Latin parabola parable; verb derivative of the noun", "example": "That the palaver was enough to promptly warrant Congressional hearings is testament to just how removed the investing public is from today’s market mechanics.", "synonym": "babble"}, {"word": "citrus", "definitionA": "any small tree or spiny shrub of the genus Citrus, of the rue family, including the lemon, lime, orange, tangerine, grapefruit, citron, kumquat, and shaddock, widely cultivated for fruit or grown as an ornamental.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of several shrubs or trees of the genus Citrus in the family Rutaceae.<br>&nbsp;&nbsp;&nbsp;2. The fruit of such plants, generally spherical, oblate, or prolate, consisting of an outer glandular skin (called zest), an inner white skin (called pith or albedo), and generally between 8 and 16 sectors filled with pulp consisting of cells with one end attached to the inner skin. Citrus fruits include orange, grapefruit, lemon, lime, and citron.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to citrus plants or fruit.<br>", "etymology": "1815–25; < New Latin, Latin: citron tree", "example": "It takes a significant amount of water to keep avocados and citrus happy, a resource that does not flow so naturally through Southern California.", "synonym": null}, {"word": "requisition", "definitionA": "the act of requiring or demanding.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A formal request for something.<br>&nbsp;&nbsp;&nbsp;2. That which is required by authority; especially, a quota of supplies or necessaries.<br>&nbsp;&nbsp;&nbsp;3. A call; an invitation; a summons.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To demand something, especially for a military need of staff, supplies or transport.<br>", "etymology": "1375–1425; late Middle English < Latin requīsītiōn- (stem of requīsītiō ) a searching, equivalent to Latin requīsīt ( us ) requisite + -iōn- -ion", "example": "We’ve delayed requisitions for event professionals, for example.", "synonym": "appropriation"}, {"word": "budge", "definitionA": "to move slightly; begin to move:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move.<br>&nbsp;&nbsp;&nbsp;2. To move.<br>&nbsp;&nbsp;&nbsp;3. To yield in one’s opinions or beliefs.<br>&nbsp;&nbsp;&nbsp;4. (Minnesota, Wisconsin, Iowa) To cut or butt (in line); to join the front or middle rather than the back of a queue.<br>&nbsp;&nbsp;&nbsp;5. To try to improve the spot of a decision on a sports field.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Brisk; stirring; jocund.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A kind of fur prepared from lambskin dressed with the wool on, formerly used as an edging and ornament, especially on scholastic habits.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Austere or stiff, like scholastics<br>", "etymology": "1580–90; < Anglo-French, Middle French bouger to stir < Vulgar Latin *bullicāre to bubble, frequentative of Latin bullīre; boil 1", "example": "The cost per transistor—which once fell at the same exponential rate that transistor density increased—hasn’t budged for more than three generations of chipmaking.", "synonym": "change"}, {"word": "garnish", "definitionA": "to provide or supply with something ornamental; adorn; decorate:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A set of dishes, often pewter, containing a dozen pieces of several types.<br>&nbsp;&nbsp;&nbsp;2. Pewter vessels in general.<br>&nbsp;&nbsp;&nbsp;3. Something added for embellishment.<br>&nbsp;&nbsp;&nbsp;4. Clothes; garments, especially when showy or decorative.<br>&nbsp;&nbsp;&nbsp;5. Something set round or upon a dish as an embellishment.<br>&nbsp;&nbsp;&nbsp;6. Fetters.<br>&nbsp;&nbsp;&nbsp;7. A fee; specifically, in English jails, formerly an unauthorized fee demanded from a newcomer by the older prisoners.<br>&nbsp;&nbsp;&nbsp;8. Cash.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To decorate with ornaments; to adorn; to embellish.<br>&nbsp;&nbsp;&nbsp;2. To ornament with something placed around it.<br>&nbsp;&nbsp;&nbsp;3. To furnish; to supply.<br>&nbsp;&nbsp;&nbsp;4. To fit with fetters; to fetter.<br>&nbsp;&nbsp;&nbsp;5. To warn by garnishment; to give notice to.<br>&nbsp;&nbsp;&nbsp;6. To have (money) set aside by court order (particularly for the payment of alleged debts); to garnishee.<br>", "etymology": "First recorded in 1300–50; Middle English garnishen, from Old French garniss- (extended stem of garnir, guarnir “to furnish,” from Germanic ); warn", "example": "That didn’t stop me from popping the mustardy orbs in my mouth, then swabbing the fiery seafood garnish from the box.", "synonym": "adornment"}, {"word": "protege", "definitionA": "a person under the patronage, protection, or care of someone interested in their career or welfare.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person guided and protected by a more prominent person.<br>", "etymology": "First recorded in 1780–90; from French, noun use of past participle of protéger “to protect” from Latin prōtegere; protect", "example": "The billionaire has fundraised for his protégé and put $10 million into a Super PAC supporting him.", "synonym": null}, {"word": "exigent", "definitionA": "requiring immediate action or aid; urgent; pressing.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Extremity; end; limit; pressing urgency.<br>&nbsp;&nbsp;&nbsp;2. The amount that is required.<br>&nbsp;&nbsp;&nbsp;3. A writ in proceedings before outlawry.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Urgent; needing immediate action.<br>&nbsp;&nbsp;&nbsp;2. Demanding; requiring great effort.<br>", "etymology": "1400–50; late Middle English < Latin exigent- (stem of exigēns ) (present participle of exigere to drive out, demand), equivalent to ex- ex- 1 + -ig- (combining form of agere to drive) + -ent- -ent", "example": "The researchers expected single people to lower their standards given the exigent circumstances.", "synonym": null}, {"word": "exiguous", "definitionA": "scanty; meager; small; slender:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Scanty; meager<br>", "etymology": "First recorded in 1645–55; from Latin exiguus “scanty in measure or number, small,” equivalent to exig(ere) “to drive out, measure, exact” + -uus adjective suffix; exigent, -ous ( def )", "example": "HFM: Yeah, it would be impossible because I had no background, or I had a very exiguous background in finance.", "synonym": null}, {"word": "deprecate", "definitionA": "to express earnest disapproval of:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To belittle or express disapproval of.<br>&nbsp;&nbsp;&nbsp;2. To declare something obsolescent; to recommend against a function, technique, command, etc. that still works but has been replaced.<br>&nbsp;&nbsp;&nbsp;3. To pray against.<br>&nbsp;&nbsp;&nbsp;4. To regret deeply.<br>", "etymology": "First recorded in 1615–25; from Latin dēprecātus “prayed against, warded off” (past participle of dēprecārī ), equivalent to dē- “away from, out of“ + precārī “to pray” + -ātus past participle suffix; de-, pray, -ate 1", "example": "In July 2020 Google moved the rich results testing tool out of beta and with that announcement, the company said it would deprecate its structured data testing tool.", "synonym": "depreciate"}, {"word": "intercessor", "definitionA": "a person who intercedes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who intercedes; a mediator; one who reconciles enemies, or pleads for another.<br>&nbsp;&nbsp;&nbsp;2. A bishop who acts during a vacancy in a see.<br>", "etymology": "1475–85; < Latin, equivalent to interced- ( intercession ) + -tor -tor, with dt > ss", "example": "At a throne of grace we present the name of our intercessor.", "synonym": "arbitrator"}, {"word": "zap", "definitionA": "to bombard with electrical current, radiation, laser beams, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sound made by a sudden release of electricity or some similar energy.<br>&nbsp;&nbsp;&nbsp;2. An electric shock.<br>&nbsp;&nbsp;&nbsp;3. A raucous public demonstration designed to embarrass a public figure or celebrity as a form of political activism.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a zap sound.<br>&nbsp;&nbsp;&nbsp;2. To use a remote control to repeatedly change channels on a television.<br>&nbsp;&nbsp;&nbsp;3. To strike (something or someone) with electricity or energy, as by shooting.<br>&nbsp;&nbsp;&nbsp;4. To kill; to eliminate.<br>&nbsp;&nbsp;&nbsp;5. To damage (especially electronics) with electrostatic discharge.<br>&nbsp;&nbsp;&nbsp;6. To heat (something) in a microwave oven.<br>&nbsp;&nbsp;&nbsp;7. To delete or discard (electronic media).<br>&nbsp;&nbsp;&nbsp;8. To further energize or charge (magnetic material).<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Representing the sound or action of a zap.<br>", "etymology": "An Americanism dating back to 1940–45; imitative", "example": "With a small electric zap used as an activation stimulus, the cells were able to divide as normal.", "synonym": "exterminate"}, {"word": "efface", "definitionA": "to wipe out; do away with; expunge:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To erase (as anything impressed or inscribed upon a surface); to render illegible or indiscernible.<br>&nbsp;&nbsp;&nbsp;2. To cause to disappear as if by rubbing out or striking out.<br>&nbsp;&nbsp;&nbsp;3. To make oneself inobtrusive as if due to modesty or diffidence.<br>&nbsp;&nbsp;&nbsp;4. Of the cervix during pregnancy, to thin and stretch in preparation for labor.<br>", "etymology": "From the Middle French word effacer, dating back to 1480–90; ef-, face", "example": "The laid-back, self-effacing Iowa State graduate grew up on AOL and traces his career arc with references to Myspace and TikTok.", "synonym": "blue pencil"}, {"word": "agnostic", "definitionA": "a person who holds that the answers to the basic questions of existence, such as the nature of the ultimate cause and whether or not there is a supreme being, are unknown or unknowable.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who holds to a form of agnosticism, especially uncertainty of the existence of a deity.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to agnosticism or its adherents.<br>&nbsp;&nbsp;&nbsp;2. Doubtful or uncertain about the existence or demonstrability of God or other deity.<br>&nbsp;&nbsp;&nbsp;3. Of a software component etc.: unaware or noncommittal regarding the specific nature of the components or input with which it interacts.<br>&nbsp;&nbsp;&nbsp;4. (usually with a prepositional phrase) Having no firmly held opinions on an issue or matter of uncertainty.<br>", "etymology": "Coined in 1869 by English biologist Thomas Henry Huxley (1825–95); from Greek ágnōst(os), variant of ágnōtos “not known, incapable of being known” ( a- “not, without” + gnōtós “known,” adjective derivative of gignṓskein “to know”) + -ic none, after gnostic none; a- 6none", "example": "Early on, the company was “fairly agnostic,” Jain says, waiting to see whether machines or people could better fact-check the world.", "synonym": "doubter"}, {"word": "aphorism ", "definitionA": "a terse saying embodying a general truth, or astute observation, as “Power tends to corrupt, and absolute power corrupts absolutely” (Lord Acton).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An original, laconic phrase conveying some principle or concept of thought.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak or write aphorisms.<br>", "etymology": "520–30; French aphorisme < Late Latin aphorismus < Greek aphorismós definition, equivalent to aphor ( ízein ) to define ( aphorize ) + -ismos -ism", "example": "We must disabuse ourselves of this perhaps half-ironic but still telling aphorism.", "synonym": "apothegm"}, {"word": "flabbergast", "definitionA": "to overcome with surprise and bewilderment; astound.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An awkward person.<br>&nbsp;&nbsp;&nbsp;2. Overwhelming confusion, shock, or surprise.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To overwhelm with bewilderment; to amaze, confound, or stun, especially in a ludicrous manner.<br>", "etymology": "1765–75; variant of flabagast (perhaps flabb(y) + aghast )", "example": "I would be flabbergasted if someone said they are not conscious.", "synonym": "abash"}]