[{"word": "travelogue", "definitionA": "a lecture, slide show, or motion picture describing travels.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A description of someone's travels, given in the form of narrative, public lecture, slide show or motion picture.<br>", "etymology": "1900–05, Americanism; blend of travel and monologue", "example": null, "synonym": null}, {"word": "blot", "definitionA": "a spot or stain, especially of ink on paper.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A blemish, spot or stain made by a coloured substance.<br>&nbsp;&nbsp;&nbsp;2. (by extension) A stain on someone's reputation or character; a disgrace.<br>&nbsp;&nbsp;&nbsp;3. A method of transferring proteins, DNA or RNA, onto a carrier.<br>&nbsp;&nbsp;&nbsp;4. An exposed piece in backgammon.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cause a blot (on something) by spilling a coloured substance.<br>&nbsp;&nbsp;&nbsp;2. To soak up or absorb liquid.<br>&nbsp;&nbsp;&nbsp;3. To dry (writing, etc.) with blotting paper.<br>&nbsp;&nbsp;&nbsp;4. To spot, stain, or bespatter, as with ink.<br>&nbsp;&nbsp;&nbsp;5. To impair; to damage; to mar; to soil.<br>&nbsp;&nbsp;&nbsp;6. To stain with infamy; to disgrace.<br>&nbsp;&nbsp;&nbsp;7. To obliterate, as writing with ink; to cancel; to efface; generally with out.<br>&nbsp;&nbsp;&nbsp;8. To obscure; to eclipse; to shadow.<br>", "etymology": "First recorded in 1350–1400; Middle English noun blot(te); orign uncertain; perhaps akin to Old Norse blettr “blot, spot, stain”; the verb is derivative of the noun", "example": null, "synonym": "blur"}, {"word": "plethora", "definitionA": "overabundance; excess:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually followed by of) An excessive amount or number; an abundance.<br>&nbsp;&nbsp;&nbsp;2. An excess of red blood cells or bodily humours.<br>", "etymology": "First recorded in 1535–45; from New Latin, from Greek plēthṓra “fullness,” from plḗthein “to fill, be full”; complete ( def ), full 1", "example": null, "synonym": "flood"}, {"word": "transept", "definitionA": "any major transverse part of the body of a church, usually crossing the nave, at right angles, at the entrance to the choir.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The transversal part of a church, which crosses at right angles to the greatest length, and between the nave and choir. In the basilicas, this had often no projection at its two ends. In Gothic churches these project greatly, and should be called the arms of the transept. It is common, however, to speak of the arms themselves as the transepts.<br>", "etymology": "From the Anglo-Latin word trānseptum, dating back to 1530–40. See trans-, septum", "example": null, "synonym": null}, {"word": "apse", "definitionA": "Architecture. a semicircular or polygonal termination or recess in a building, usually vaulted and used especially at the end of a choir in a church.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A semicircular projection from a building, especially the rounded east end of a church that contains the altar.<br>&nbsp;&nbsp;&nbsp;2. The bishop's seat or throne in ancient churches.<br>&nbsp;&nbsp;&nbsp;3. A reliquary, or case in which the relics of saints were kept.<br>&nbsp;&nbsp;&nbsp;4. The nearest and furthest points to the centre of gravitational attraction for a body in orbit. More usually called an apsis.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An aspen tree.<br>", "etymology": "First recorded in 1815–25; variant of apsis", "example": "There is still scaffolding around much of the eastern end, and in coming years the outside walls of the apse and sacristy will need treatment.", "synonym": "alcove"}, {"word": "cherish", "definitionA": "to hold or treat as dear; feel love for:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To treat with affection, care, and tenderness; to nurture or protect with care.<br>&nbsp;&nbsp;&nbsp;2. To have a deep appreciation of; to hold dear.<br>&nbsp;&nbsp;&nbsp;3. To cheer, to gladden.<br>", "etymology": "First recorded in 1275–1325; Middle English cherisshen, from Middle French cheriss- (long stem of cherir ); equivalent to cher “dear” (from Latin cārus “beloved, dear, expensive”) + -ish 2; charity", "example": null, "synonym": "clasp"}, {"word": "fathom", "definitionA": "a unit of length equal to six feet (1.8 meters): used chiefly in nautical measurements. : fath", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Grasp, envelopment, control.<br>&nbsp;&nbsp;&nbsp;2. (now usually nautical) An English unit of length for water depth notionally based upon the width of grown man's outstretched arms but standardized as 6 feet (about 1.8 m).<br>&nbsp;&nbsp;&nbsp;3. Various similar units in other systems.<br>&nbsp;&nbsp;&nbsp;4. Depth of insight, mental reach or scope.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To encircle with outstretched arms, especially to take a measurement; to embrace.<br>&nbsp;&nbsp;&nbsp;2. To measure the depth of, take a sounding of.<br>&nbsp;&nbsp;&nbsp;3. To get to the bottom of; to manage to comprehend; understand (a problem etc.).<br>", "etymology": "First recorded before 900; Middle English fathme, Old English fæthm “span of outstretched arms”; cognate with German Faden “six-foot measure,” Old Norse fathmr; akin to Latin patēre “to stand open” ( patent )", "example": null, "synonym": "apprehend"}, {"word": "acquiesce ", "definitionA": "to assent tacitly; submit or comply silently or without protest; agree; consent:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (with in (or sometimes with, to)) To rest satisfied, or apparently satisfied, or to rest without opposition and discontent (usually implying previous opposition or discontent); to accept or consent by silence or by omitting to object.<br>&nbsp;&nbsp;&nbsp;2. To concur upon conviction; as, to acquiesce in an opinion; to assent to; usually, to concur, not heartily but so far as to forbear opposition.<br>", "etymology": "irst recorded in 1610–20; from Latin acquiēscere “to find rest in, ” equivalent to ac- ac- + quiē- + -sc- inchoative suffix + -ere infinitive suffix", "example": null, "synonym": "accept"}, {"word": "squabble", "definitionA": "to engage in a petty quarrel.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A minor fight or argument.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To participate in a minor fight or argument.<br>&nbsp;&nbsp;&nbsp;2. To disarrange, so that the letters or lines stand awry and require readjustment.<br>", "etymology": "1595–1605; probably < Scandinavian; compare Swedish dialect skvabbel a quarrel, gossip, Norwegian dialect skvabba to prattle", "example": "Neither side appeared eager to let their squabble disrupt viewing for YouTube’s subscribers.", "synonym": "fight"}, {"word": "disconcert", "definitionA": "to disturb the self-possession of; perturb; ruffle:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A state of disunion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To upset the composure of.<br>&nbsp;&nbsp;&nbsp;2. To bring into confusion.<br>&nbsp;&nbsp;&nbsp;3. To frustrate, discomfit.<br>", "etymology": "From the obsolete French word disconcerter, dating back to 1680–90. See dis- 1, concert", "example": null, "synonym": "abash"}, {"word": "adieu", "definitionA": "goodbye; farewell.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A farewell, a goodbye; especially a fond farewell, or a lasting or permanent farewell.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Said to wish a final farewell; goodbye.<br>", "etymology": "First recorded in 1325–75; Middle English, from Middle French, equivalent to a (from Latin ad “to”) + dieu (from Latin deus “god”)", "example": null, "synonym": "adios"}, {"word": "molt", "definitionA": "(of birds, insects, reptiles, etc.) to cast or shed the feathers, skin, or the like, that will be replaced by a new growth.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The process of shedding or losing a covering of fur, feathers or skin etc.<br>&nbsp;&nbsp;&nbsp;2. The skin or feathers cast off during the process of moulting.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shed or lose a covering of hair or fur, feathers, skin, horns, etc, and replace it with a fresh one.<br>&nbsp;&nbsp;&nbsp;2. To shed in such a manner.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To change (or to be changed) from a solid state to a liquid state, usually by a gradual heat.<br>&nbsp;&nbsp;&nbsp;2. To dissolve, disperse, vanish.<br>&nbsp;&nbsp;&nbsp;3. To soften, as by a warming or kindly influence; to relax; to render gentle or susceptible to mild influences; sometimes, in a bad sense, to take away the firmness of; to weaken.<br>&nbsp;&nbsp;&nbsp;4. To be discouraged.<br>&nbsp;&nbsp;&nbsp;5. To be emotionally softened or touched.<br>&nbsp;&nbsp;&nbsp;6. To be very hot and sweat profusely.<br>", "etymology": "1300–50; earlier mout (with intrusive -l-; fault, assault ), Middle English mouten, Old English -mūtian to change (in bi-mūtian to exchange for) < Latin mūtāre to change; mutate", "example": "Yes, a man captured the way independent women prize their freedom more than having to deal with a man that’s always there “molting,” as Lois puts it.", "synonym": "decorticate"}]