[{"word": "weft", "definitionA": "Textiles. filling ( def 5 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The horizontal threads that are interlaced through the warp in a woven fabric.<br>&nbsp;&nbsp;&nbsp;2. The yarn used for the weft; the fill.<br>&nbsp;&nbsp;&nbsp;3. (hairdressing) A hair extension that is glued directly to a person′s natural hair.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something cast away; a waif.<br>", "etymology": "before 900; Middle English, Old English; akin to weave", "example": "Variations in the number and color of weft threads on Turfan Man’s pants created pairs of brown stripes.", "synonym": "character"}, {"word": "squelch", "definitionA": "to strike or press with crushing force; crush down; squash.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A squelching sound.<br>&nbsp;&nbsp;&nbsp;2. (radio technology) The suppression of the unwanted hiss or static between received transmissions by adjusting the gain of the receiver.<br>&nbsp;&nbsp;&nbsp;3. A heavy blow or fall.<br>&nbsp;&nbsp;&nbsp;4. A kind of electronic beat used in acid house and related music genres.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To halt, stop, eliminate, stamp out, or put down, often suddenly or by force<br>&nbsp;&nbsp;&nbsp;2. (radio technology) to suppress the unwanted hiss or static between received transmissions by adjusting a threshold level for signal strength, below which the signal is suppressed by applying a gain of zero, and above which a positive (and linear from zero) gain is applied.<br>&nbsp;&nbsp;&nbsp;3. To make a sucking, splashing noise as when walking on muddy ground<br>&nbsp;&nbsp;&nbsp;4. To walk or step through a substance such as mud<br>", "etymology": "1610–20; variant of quelch in same sense (perhaps blend of quell and quash ); initial s perhaps from squash 1", "example": "Even so, AEI is mostly a bystander as Republicans fight among themselves to squelch the Tea Party grassroots.", "synonym": "censure"}, {"word": "deprecate", "definitionA": "to express earnest disapproval of:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To belittle or express disapproval of.<br>&nbsp;&nbsp;&nbsp;2. To declare something obsolescent; to recommend against a function, technique, command, etc. that still works but has been replaced.<br>&nbsp;&nbsp;&nbsp;3. To pray against.<br>&nbsp;&nbsp;&nbsp;4. To regret deeply.<br>", "etymology": "First recorded in 1615–25; from Latin dēprecātus “prayed against, warded off” (past participle of dēprecārī ), equivalent to dē- “away from, out of“ + precārī “to pray” + -ātus past participle suffix; de-, pray, -ate 1", "example": "In July 2020 Google moved the rich results testing tool out of beta and with that announcement, the company said it would deprecate its structured data testing tool.", "synonym": "depreciate"}, {"word": "cursory", "definitionA": "going rapidly over something, without noticing details; hasty; superficial:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Hasty; superficial; careless<br>&nbsp;&nbsp;&nbsp;2. Running about; not stationary.<br>", "etymology": "1595–1605; < Late Latin cursōrius running, equivalent to Latin cur ( rere ) to run + -sōrius, for -tōrius -tory 1; course", "example": "Public health experts said the health department could have taken several measures to begin to address the concerns raised in the air-quality studies, including conducting a cursory examination of health trends.", "synonym": null}, {"word": "spancel", "definitionA": "a noosed rope with which to hobble an animal, especially a horse or cow.", "definitionB": "No definition found", "etymology": "1600–10; < Low German spansel, derivative of spannen to stretch; span 2", "example": "My wrist-cords were loosed, my ankles were fastened only with a spancel, and strong hands jerked me to my feet.", "synonym": null}, {"word": "debacle", "definitionA": "a general breakup or dispersion; sudden downfall or rout:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An event or enterprise that ends suddenly and disastrously, often with humiliating consequences.<br>&nbsp;&nbsp;&nbsp;2. A breaking up of a natural dam, usually made of ice, by a river and the ensuing rush of water.<br>", "etymology": "1795–1805; < French débâcle, derivative of débâcler to unbar, clear, equivalent to dé- dis- 1 + bâcler to bar ≪ Latin baculum stick, rod", "example": "There were derelictions and debacles, dreams deferred and hopes dashed.", "synonym": "crack-up"}, {"word": "hobble", "definitionA": "to walk lamely; limp.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly in the plural) One of the short straps tied between the legs of unfenced horses, allowing them to wander short distances but preventing them from running off.<br>&nbsp;&nbsp;&nbsp;2. An unsteady, off-balance step.<br>&nbsp;&nbsp;&nbsp;3. A difficult situation; a scrape.<br>&nbsp;&nbsp;&nbsp;4. An odd job; a piece of casual work.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fetter by tying the legs; to restrict (a horse) with hobbles.<br>&nbsp;&nbsp;&nbsp;2. To walk lame, or unevenly.<br>&nbsp;&nbsp;&nbsp;3. To move roughly or irregularly.<br>&nbsp;&nbsp;&nbsp;4. To perplex; to embarrass.<br>", "etymology": "1300–50; Middle English hobelen, apparently akin to hob protuberance, uneven ground, and to Dutch hobbelen, German hoppeln to jolt", "example": "Reduced global availability could send prices for these nutrients higher and financially hobble farm belts across a slew of countries.", "synonym": "clump"}, {"word": "limp", "definitionA": "to walk with a labored, jerky movement, as when lame.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An irregular, jerky or awkward gait.<br>&nbsp;&nbsp;&nbsp;2. A scraper for removing poor ore or refuse from the sieve.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To walk lamely, as if favouring one leg.<br>&nbsp;&nbsp;&nbsp;2. (of a vehicle) To travel with a malfunctioning system of propulsion.<br>&nbsp;&nbsp;&nbsp;3. To move or proceed irregularly.<br>&nbsp;&nbsp;&nbsp;4. To call, particularly in an unraised pot pre-flop.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A scraper of board or sheet-iron shaped like half the head of a small cask, used for scraping the ore off the sieve in the operation of hand-jigging.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be inadequate or unsatisfactory.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Flaccid; flabby, like flesh.<br>&nbsp;&nbsp;&nbsp;2. Lacking stiffness; flimsy<br>&nbsp;&nbsp;&nbsp;3. (of a penis) not erect<br>&nbsp;&nbsp;&nbsp;4. (of a man) not having an erect penis<br>&nbsp;&nbsp;&nbsp;5. Physically weak<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To happen; befall; chance.<br>&nbsp;&nbsp;&nbsp;2. To come upon; meet.<br>", "etymology": "1560–70; back formation from obsolete limphault lame; Old English lemphealt limping ( halt 2 ); akin to Middle High German limpfen to limp", "example": "Sometimes you just need a contraption that will quickly turn limp pieces of bread into crunchy, warm slices of perfection.", "synonym": "bending"}, {"word": "paleobotany", "definitionA": "the branch of paleontology dealing with fossil plants.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The branch of paleontology that deals with the study of plant fossils.<br>", "etymology": "First recorded in 1870–75; paleo- + botany", "example": "The fourth and last year of the series was spent on paleobotany.", "synonym": null}, {"word": "delirious", "definitionA": "Pathology. affected with or characteristic of delirium.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Being in the state of delirium.<br>&nbsp;&nbsp;&nbsp;2. Having uncontrolled excitement; ecstatic.<br>", "etymology": "First recorded in 1590–1600; deliri(um) + -ous", "example": "Now that her career has been suddenly mooted, her own mother has sunk into a depression and she’s all but delirious with grief, Kimberly is agitating for influence in the Brown administration.", "synonym": "bewildered"}, {"word": "deliration", "definitionA": "mental derangement; raving; delirium.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Aberration of the mind; delirium<br>", "etymology": "1590–1600; < Latin dēlīrātiōn- (stem of dēlīrātiō ) folly, equivalent to dēlīr ( āre ) to be silly, literally, go out of the furrow ( dē- de- + līr ( a ) furrow + -āre infinitive ending) + -ātiōn- -ation", "example": null, "synonym": null}, {"word": "delirium", "definitionA": "Pathology. a more or less temporary disorder of the mental faculties, as in fevers, disturbances of consciousness, or intoxication, characterized by restlessness, excitement, delusions, hallucinations, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A temporary mental state with a sudden onset, usually reversible, including symptoms of confusion, inability to concentrate, disorientation, anxiety, and sometimes hallucinations. Causes can include dehydration, drug intoxication, and severe infection.<br>", "etymology": "1590–1600; < Latin dēlīrium frenzy, equivalent to dēlīr ( āre ) ( deliration ) + -ium -ium", "example": "We were able to mitigate that person’s delirium, but these are the things that happen when you run out of space.", "synonym": "ardor"}, {"word": "maim", "definitionA": "to deprive of the use of some part of the body by wounding or the like; cripple:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A serious wound<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wound seriously; to cause permanent loss of function of a limb or part of the body.<br>", "etymology": "First recorded in 1250–1300; Middle English mayme, variant of mahayme mayhem", "example": "When Iron Dome misses -- and it does sometimes miss -- the Gaza rockets kill and maim only within a very limited radius.", "synonym": "batter"}]