[{"word": "cavalier", "definitionA": "a horseman, especially a mounted soldier; knight.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A military man serving on horse, early modern cavalry officers who had abandoned the heavy armor of medieval knights.<br>&nbsp;&nbsp;&nbsp;2. A gallant: a sprightly young dashing military man.<br>&nbsp;&nbsp;&nbsp;3. A gentleman of the class of such officers, particularly:<br>&nbsp;&nbsp;&nbsp;4. Someone with an uncircumcised penis.<br>&nbsp;&nbsp;&nbsp;5. A defensive work rising from a bastion, etc., and overlooking the surrounding area.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a man: to act in a gallant and dashing manner toward (women).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not caring enough about something important.<br>&nbsp;&nbsp;&nbsp;2. High-spirited.<br>&nbsp;&nbsp;&nbsp;3. Supercilious.<br>&nbsp;&nbsp;&nbsp;4. Of or pertaining to the party of King Charles I of England (1600–1649).<br>", "etymology": "First recorded in 1590–1600; from Middle French: “horseman, knight,” from Old Italian cavaliere, from Old Provençal, from Late Latin caballārius “man on horseback,” equivalent to Latin caball(us) “horse” ( capercaillie ) + -ārius -ary", "example": "It is one of Head's strongest qualities, though, that such moments do not faze him, and he continued in a cavalier vein for the remainder of his time at the crease.", "synonym": "superior"}, {"word": "rime", "definitionA": "Also called  rime ice.  an opaque coating of tiny, white, granular ice particles, caused by the rapid freezing of supercooled water droplets on impact with an object. Compare frost ( def 3 ), glaze ( def 17 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Ice formed by the rapid freezing of cold water droplets of fog on to a cold surface.<br>&nbsp;&nbsp;&nbsp;2. A coating or sheet of ice so formed.<br>&nbsp;&nbsp;&nbsp;3. A film or slimy coating.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To freeze or congeal into hoarfrost.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To compose or treat in verse; versify.<br>&nbsp;&nbsp;&nbsp;2. (followed by with) Of a word, to be pronounced identically with another from the vowel in its stressed syllable to the end.<br>&nbsp;&nbsp;&nbsp;3. Of two or more words, to be pronounced identically from the vowel in the stressed syllable of each to the end of each.<br>&nbsp;&nbsp;&nbsp;4. To number; count; reckon.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Number.<br>&nbsp;&nbsp;&nbsp;2. Rhyme.<br>&nbsp;&nbsp;&nbsp;3. The second part of a syllable, from the vowel on, as opposed to the onset.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A step of a ladder; a rung.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A rent or long aperture; a chink; a fissure; a crack.<br>", "etymology": "before 900; Middle English rim, Old English hrīm; cognate with Dutch rijm, Old Norse hrīm", "example": "Late in September, when he woke up mornings, he would see rime on the ground.", "synonym": "freeze"}, {"word": "froward", "definitionA": "willfully contrary; not easily managed:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Disobedient, contrary, unmanageable; difficult to deal with; with an evil disposition.<br>&#60;preposition&#62;<br>&nbsp;&nbsp;&nbsp;1. Away from.<br>", "etymology": "First recorded in 1150–1200, froward is from the Middle English word froward, fraward. See fro, -ward", "example": "List not, when the froward chide, Sons of pedantry and pride; Snarlers, to whose feeble sense April sun-shine is offence; Age and envy will advise, Ev’n against the joys they prize.", "synonym": null}, {"word": "plaint", "definitionA": "a complaint.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lament or woeful cry.<br>&nbsp;&nbsp;&nbsp;2. A complaint.<br>&nbsp;&nbsp;&nbsp;3. A sad song.<br>&nbsp;&nbsp;&nbsp;4. An accusation.<br>", "etymology": "1175–1225; Middle English < Middle French < Latin planctus a striking or beating (the breast) in grief, equivalent to plang ( ere ) to beat, strike, mourn for + -tus, suffix of v. action", "example": "Produced by Pheelz, a Nigerian songwriter who adds a rap verse, “Ruin” deploys the shakers, deep log drums, soothing keyboard chords and open spaces of amapiano as Usher mixes accusation, plaint and humblebrag.", "synonym": "bellowing"}, {"word": "fro", "definitionA": "Obsolete. from; back.", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. From; away; back or backward.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hairstyle characterized by a tightly curled locks and a rounded shape.<br>", "etymology": "1150–1200; Middle English frō, frā < Old Norse frā from; akin to Old English fram from", "example": "She’s a hairstylist, so my whole life I had braids or a fro.", "synonym": null}, {"word": "rimy", "definitionA": "covered with rime.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Coated in rime.<br>", "etymology": "before 1000; Old English hrīmig (not recorded in ME). See rime 1, -y 1", "example": "Pallid pedestrians shuffle along rimy pavements hoping that the next chunk of snow to shear off a tenement roof doesn’t have their name on it.", "synonym": "arctic"}, {"word": "swarthy", "definitionA": "(of skin color, complexion, etc.) dark.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A swarthy person.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tawny, dusky, dark.<br>&nbsp;&nbsp;&nbsp;2. Dark-skinned.<br>&nbsp;&nbsp;&nbsp;3. Darker-skinned than white, but lighter-skinned than tawny.<br>&nbsp;&nbsp;&nbsp;4. Evil, malicious.<br>&nbsp;&nbsp;&nbsp;5. Weathered, rough.<br>", "etymology": "First recorded in 1570–80; unexplained variant of obsolete swarty ( swart + -y 1 )", "example": "The best reason to watch it is Jude Law’s swarthily entertaining performance as Henry at his vilest, with state-of-the-art support from a horrifically pus-leaking, maggot-ridden leg wound.", "synonym": null}, {"word": "litigate", "definitionA": "to make the subject of a lawsuit; contest at law.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (construed with on) To go to law; to carry on a lawsuit.<br>&nbsp;&nbsp;&nbsp;2. To contest in law.<br>&nbsp;&nbsp;&nbsp;3. (transferred sense) To dispute; to fight over.<br>", "etymology": "First recorded in 1605–15, litigate is from the Latin word lītigātus (past participle of lītigāre to go to law). See litigant, -ate 1", "example": "The fact that they are already in bed with certain governments in one way or another will have to be litigated which takes a lot of time, particularly since Trump excels at deploying delaying tactics.", "synonym": "appeal"}, {"word": "funicular", "definitionA": "of or relating to a rope or cord, or its tension.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A particular type of rail transit system which ascends a steep urban or mountain incline, having usually two cars sharing a single track, with the cars linked by a cable and an arrangement of pulleys such that the descending car assists in the hoisting of the ascending car, i.e. the two cars serve as counterweights for each other.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, pertaining to, resembling, or powered by a rope or cable<br>&nbsp;&nbsp;&nbsp;2. Of or pertaining to the umbilical cord.<br>&nbsp;&nbsp;&nbsp;3. Having a fleshy covering of the seed formed from the funiculus, the attachment point of the seed.<br>", "etymology": "1655–65; < Latin fūnicul ( us ) ( funiculus ) + -ar 1", "example": "Right, the Angels Flight funicular begins a descent in downtown L.A.", "synonym": null}, {"word": "dregs", "definitionA": "solid particles that tend to settle at the bottom of some liquids, such as wine or coffee", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (collectively) The sediment settled at the bottom of a liquid; the lees in a container of unfiltered wine.<br>&nbsp;&nbsp;&nbsp;2. (the dregs) The worst and lowest part of something.<br>", "etymology": "C14 dreg, from Old Norse dregg; compare Icelandic dreggjar dregs, Latin fracēs oil dregs", "example": null, "synonym": "deposits"}, {"word": "allusion", "definitionA": "a passing or casual reference; an incidental mention of something, either directly or by implication:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An indirect reference; a hint; a reference to something supposed to be known, but not explicitly mentioned<br>", "etymology": "First recorded in 1540–50; Late Latin allūsiōn- (stem of allūsiō ), equivalent to allūs(us), past participle of allūdere ( allude; al- + lūd- “play” + -tus past participle suffix) + -iōn- -ion", "example": "We hear allusions to a blood-red sun, a poisoned sea and buzzards.", "synonym": "charge"}, {"word": "plaint", "definitionA": "a complaint.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lament or woeful cry.<br>&nbsp;&nbsp;&nbsp;2. A complaint.<br>&nbsp;&nbsp;&nbsp;3. A sad song.<br>&nbsp;&nbsp;&nbsp;4. An accusation.<br>", "etymology": "1175–1225; Middle English < Middle French < Latin planctus a striking or beating (the breast) in grief, equivalent to plang ( ere ) to beat, strike, mourn for + -tus, suffix of v. action", "example": "Produced by Pheelz, a Nigerian songwriter who adds a rap verse, “Ruin” deploys the shakers, deep log drums, soothing keyboard chords and open spaces of amapiano as Usher mixes accusation, plaint and humblebrag.", "synonym": "bellowing"}, {"word": "tonsorial", "definitionA": "of or relating to a barber or barbering:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to barbers or to shaving.<br>", "etymology": "1805–15; < Latin tōnsōri ( us ) of shaving ( tond ( ēre ) to shave + -tōrius -tory 1, with dt > s ) + -al 1", "example": "There were no hard feelings between the two, and normal tonsorial service resumed when the man got out of the pen.", "synonym": null}, {"word": "sundry", "definitionA": "various or diverse:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually in the plural) A minor miscellaneous item.<br>&nbsp;&nbsp;&nbsp;2. (in the plural) A category for irregular or miscellaneous items not otherwise classified.<br>&nbsp;&nbsp;&nbsp;3. (usually in the plural) An extra.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Separate; distinct; diverse.<br>&nbsp;&nbsp;&nbsp;2. Individual; one for each.<br>&nbsp;&nbsp;&nbsp;3. Several; diverse; more than one or two; various.<br>&nbsp;&nbsp;&nbsp;4. Consisting of a haphazard assortment of different kinds; miscellaneous.<br>", "etymology": "before 900; Middle English; Old English syndrig private, separate, equivalent to syndr- (mutated form of sundor asunder ) + -ig -y 1; akin to sunder", "example": "Once upon a time, the accomplished filmmaker Robert Eggers was a serious 9-year-old in small-town Lee, N.H., methodically making his way through his school library’s series on various and sundry monsters.", "synonym": null}, {"word": "buffet", "definitionA": "a variety of dishes presented in a line, from which diners in a restaurant serve themselves, usually at a fixed price regardless of how much one eats", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A counter or sideboard from which food and drinks are served or may be bought.<br>&nbsp;&nbsp;&nbsp;2. Food laid out in this way, to which diners serve themselves.<br>&nbsp;&nbsp;&nbsp;3. A small stool; a stool for a buffet or counter.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A blow or cuff with or as if with the hand, or by any other solid object or the wind.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To strike with a buffet; to cuff; to slap.<br>&nbsp;&nbsp;&nbsp;2. To aggressively challenge, denounce, or criticise.<br>&nbsp;&nbsp;&nbsp;3. To affect as with blows; to strike repeatedly; to strive with or contend against.<br>&nbsp;&nbsp;&nbsp;4. To deaden the sound of (bells) by muffling the clapper.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low stool; a hassock.<br>", "etymology": "First recorded in 1710–20; from French, Old French; of obscure origin", "example": "What it’s like inside: As with other Amex Centurion Lounges, the LAX location has a buffet of chef-prepared dishes and made-to-order cocktails.", "synonym": "counter"}, {"word": "acreage", "definitionA": "extent or area in acres; acres collectively.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Size, as measured in acres.<br>&nbsp;&nbsp;&nbsp;2. An area of land measured in acres.<br>", "etymology": "First recorded in 1855–60; acre + -age", "example": "The Trust for Public Land has ranked Los Angeles’ parks 88th out of 100 cities, based on access, investment, acreage and equity.", "synonym": "expanse"}, {"word": "agronomy", "definitionA": "the science of soil management and the production of field crops.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The science of utilizing plants, animals and soils for food, fuel, feed, and fiber and more. To do this effectively and sustainably, agronomy encompasses work in the areas of plant genetics, plant physiology, meteorology, animal sciences and soil science.<br>", "etymology": "First recorded in 1805–15; agro- + -nomy", "example": "In 2010, Jianxin Ma, a professor of agronomy, and his collaborators built the first reference genome for soybeans on the widely studied Williams 82 variety.", "synonym": "tillage"}]