[{"word": "telemetry", "definitionA": "the use of radio waves, telephone lines, etc, to transmit the readings of measuring instruments to a device on which the readings can be indicated or recorded See also radiotelemetry", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (applied sciences) the science, and associated technology, of the automatic recording and transmission of data from a remote source to a receiving station for analysis<br>", "etymology": null, "example": "While Neil and Buzz made ready to blast off, Houston read the telemetry looking for signs of trouble.", "synonym": null}, {"word": "flagrant", "definitionA": "shockingly noticeable or evident; obvious; glaring:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Obvious and offensive; blatant; scandalous.<br>&nbsp;&nbsp;&nbsp;2. On fire; flaming.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Latin flagrant- (stem of flagrāns ), present participle of flagrāre “to burn”; -ant", "example": "During that 1992-93 season, he finished with an NBA-high nine flagrant fouls — more than twice as many as the next-closest player, and more than fifteen teams finished with that year.", "synonym": null}, {"word": "retribution ", "definitionA": "requital according to merits or deserts, especially for evil.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Punishment inflicted in the spirit of moral outrage or personal vengeance.<br>", "etymology": "irst recorded in 1350–1400; Middle English retribucioun, from Middle French, from Late Latin retribūtiōn- (stem of retribūtiō ) “punishment, reward as result of judgment,” equivalent to Latin retribūt(us) (past participle of retribuere “to restore, give back”; re-, tribute ) + -iōn- -ion", "example": "Like many other Pakistani Taliban, Jamal has his own horror stories to tell, which he believes can justify any bloody retribution.", "synonym": "counterblow"}, {"word": "bivalve", "definitionA": "Also called  lamellibranch. Zoology. any mollusk, as the oyster, clam, scallop, or mussel, of the class Bivalvia, having two shells hinged together, a soft body, and lamellate gills.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any mollusc belonging to the taxonomic class Bivalvia, characterized by a shell consisting of two hinged sections, such as a scallop, clam, mussel or oyster.<br>&nbsp;&nbsp;&nbsp;2. A pericarp in which the seed case opens or splits into two parts or valves.<br>", "etymology": "First recorded in 1670–80; bi- 1 + valve", "example": "In New York City, they’re repopulating the harbor with farmed oysters to build reefs with the bivalves that stop the kind of erosion that made Hurricane Sandy so destructive while filtering toxins out of the water.", "synonym": "mollusk"}, {"word": "blatant", "definitionA": "brazenly obvious; flagrant:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Bellowing; disagreeably clamorous; sounding loudly and harshly.<br>&nbsp;&nbsp;&nbsp;2. Obvious, on show; unashamed; loudly obtrusive or offensive.<br>", "etymology": "Coined by Edmund Spenser in 1596; compare Latin blatīre “to babble, prate,” blaterāre “to talk foolishly, babble”", "example": "Perhaps the most blatant, she said, was its sole use of voter registration lists as a source of finding potential jurors.", "synonym": null}, {"word": "cognac", "definitionA": "(often initial capital letter) the brandy distilled in and shipped from the legally delimited area surrounding the town of Cognac, in W central France.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A brandy distilled from white wine in the region around Cognac in France.<br>", "etymology": "Borrowed into English from French around 1585–95", "example": "While brandy can be made all over the world, Cognac is only made in France, in limited quantities.", "synonym": "marc"}, {"word": "crisp", "definitionA": "(especially of food) hard but easily breakable; brittle:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin slice of fried potato eaten as a snack.<br>&nbsp;&nbsp;&nbsp;2. A baked dessert made with fruit and crumb topping<br>&nbsp;&nbsp;&nbsp;3. Anything baked or fried and eaten as a snack<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make crisp.<br>&nbsp;&nbsp;&nbsp;2. To become crisp.<br>&nbsp;&nbsp;&nbsp;3. To cause to curl or wrinkle (of the leaves or petals of plants, for example); to form into ringlets or tight curls (of hair).<br>&nbsp;&nbsp;&nbsp;4. To become curled.<br>&nbsp;&nbsp;&nbsp;5. To cause to undulate irregularly (of water); to cause to ripple.<br>&nbsp;&nbsp;&nbsp;6. To undulate or ripple.<br>&nbsp;&nbsp;&nbsp;7. To wrinkle, contort or tense (a part of one's body).<br>&nbsp;&nbsp;&nbsp;8. To become contorted or tensed (of a part of the body).<br>&nbsp;&nbsp;&nbsp;9. To interweave (of the branches of trees).<br>&nbsp;&nbsp;&nbsp;10. To make a sharp or harsh sound.<br>&nbsp;&nbsp;&nbsp;11. To colour (something with highlights); to add small amounts of colour to (something).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of something seen or heard) Sharp, clearly defined.<br>&nbsp;&nbsp;&nbsp;2. Brittle; friable; in a condition to break with a short, sharp fracture.<br>&nbsp;&nbsp;&nbsp;3. Possessing a certain degree of firmness and freshness.<br>&nbsp;&nbsp;&nbsp;4. (of weather, air etc.) Dry and cold.<br>&nbsp;&nbsp;&nbsp;5. (of movement, action etc.) Quick and accurate.<br>&nbsp;&nbsp;&nbsp;6. (of talk, text, etc.) Brief and to the point.<br>&nbsp;&nbsp;&nbsp;7. (of wine) having a refreshing amount of acidity; having less acidity than green wine, but more than a flabby one.<br>&nbsp;&nbsp;&nbsp;8. Lively; sparking; effervescing.<br>&nbsp;&nbsp;&nbsp;9. Curling in stiff curls or ringlets.<br>&nbsp;&nbsp;&nbsp;10. Curled by the ripple of water.<br>&nbsp;&nbsp;&nbsp;11. Not using fuzzy logic; based on a binary distinction between true and false.<br>", "etymology": "First recorded before 900; Middle English, Old English, from Latin crispus “curled”", "example": "In a gas oven, this may be the difference between small flames slowly crisping a piece of meat and much larger ones licking right up against your food.", "synonym": "firm"}, {"word": "indict", "definitionA": "Law. (of a grand jury) to bring a formal accusation against (someone) as a means of bringing a case to trial after ascertaining that there is enough evidence:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To accuse of wrongdoing; charge.<br>&nbsp;&nbsp;&nbsp;2. To make a formal accusation or indictment for a crime against (a party) by the findings of a jury, especially a grand jury.<br>", "etymology": "First recorded in 1620–30; variant spelling (from Medieval Latin ) of indite", "example": "He emphasized that the company has a robust compliance program and that neither it nor any of its executives have been indicted for any crime.", "synonym": "arraign"}, {"word": "acquiesce ", "definitionA": "to assent tacitly; submit or comply silently or without protest; agree; consent:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (with in (or sometimes with, to)) To rest satisfied, or apparently satisfied, or to rest without opposition and discontent (usually implying previous opposition or discontent); to accept or consent by silence or by omitting to object.<br>&nbsp;&nbsp;&nbsp;2. To concur upon conviction; as, to acquiesce in an opinion; to assent to; usually, to concur, not heartily but so far as to forbear opposition.<br>", "etymology": "irst recorded in 1610–20; from Latin acquiēscere “to find rest in, ” equivalent to ac- ac- + quiē- + -sc- inchoative suffix + -ere infinitive suffix", "example": "He was force of nature and a force for good that eventually, they had to acquiesce.", "synonym": "accept"}, {"word": "hoe", "definitionA": "a long-handled implement having a thin, flat blade usually set transversely, used to break up the surface of the ground, destroy weeds, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An agricultural tool consisting of a long handle with a flat blade fixed perpendicular to it at the end, used for digging rows.<br>&nbsp;&nbsp;&nbsp;2. The horned or piked dogfish.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut, dig, scrape, turn, arrange, or clean, with this tool.<br>&nbsp;&nbsp;&nbsp;2. To clear from weeds, or to loosen or arrange the earth about, with a hoe.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A whore; a sexually promiscuous woman; in general use as a highly offensive name-calling word for a woman with connotations of loose sexuality.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Care, anxiety, trouble, sorrow.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To care, be anxious, long.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A piece of land that juts out towards the sea; a promontory.<br>", "etymology": "First recorded in 1325–75; Middle English howe, from Old French houe, from Germanic; compare Middle Dutch houwe, Old High German houwa “mattock”; akin to hew", "example": "Pollard got behind the wheel of a machine called a reverse hoe.", "synonym": "channel"}, {"word": "mattock", "definitionA": "an instrument for loosening the soil in digging, shaped like a pickax, but having one end broad instead of pointed.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An agricultural tool whose blades are at right angles to the body, similar to a pickaxe.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut or dig with a mattock.<br>", "etymology": "before 900; Middle English mattok, Old English mattuc", "example": "They still used to say in the country districts: \"The spindles must follow the mattock,\" but it was only by force of habit.", "synonym": null}, {"word": "unary", "definitionA": "pertaining to a function whose domain is a given set and whose range is contained in that set.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The unary numeral system; the bijective base-1 numeral system.<br>&nbsp;&nbsp;&nbsp;2. Unary coding, an entropy encoding for natural numbers.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Consisting of or involving a single element or component.<br>&nbsp;&nbsp;&nbsp;2. (computer engineering) Of an operation, function, procedure or logic gate, taking exactly one operand, argument, parameter or input; having domain of dimension 1.<br>", "etymology": "1570–80; < Latin ūn ( us ) one + -ary, on the model of binary", "example": null, "synonym": null}, {"word": "impudent", "definitionA": "of, relating to, or characterized by impertinence or effrontery:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not showing due respect; impertinent; bold-faced.<br>", "etymology": "First recorded in 1350–1400; Middle English from Latin impudent- (stem of impudēns ) “shameless,” equivalent to im- im- 2 + pud- (base of pudēre “to feel shame”; pudendum ) + -ent- -ent", "example": "Casual use of user slang also changes the tone of this book, from investigative to impudent.", "synonym": null}, {"word": "cenotaph", "definitionA": "a sepulchral monument erected in memory of a deceased person whose body is buried elsewhere.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A monument, especially in the form of an empty tomb, erected to honour the dead whose bodies lie elsewhere; especially members of the armed forces who died in battle.<br>", "etymology": "1595–1605; < Latin cenotaphium < Greek kenotáphion, equivalent to kenó ( s ) empty + -taphion ( táph ( os ) tomb + -ion diminutive suffix)", "example": "Others think it may be a cenotaph, built to house Alexander himself but then left empty after Ptolemy made off with his body.", "synonym": "cairn"}]