[{"word": "benediction", "definitionA": "an utterance of good wishes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short invocation for help, blessing and guidance from God, said on behalf of another person or persons (sometimes at the end of a church worship service).<br>&nbsp;&nbsp;&nbsp;2. In the Anglican church, the ceremony used to institute an abbot, analogous to the consecration of a bishop.<br>&nbsp;&nbsp;&nbsp;3. A Roman Catholic rite by which bells, banners, candles, etc., are blessed with holy water and formally dedicated to God.<br>&nbsp;&nbsp;&nbsp;4. Help, good fortune or reward from God or another supernatural source.<br>", "etymology": "1400–50; late Middle English (< Middle French ) < Latin benedictiōn- (stem of benedictiō ). See Benedictus, -ion", "example": "Even the interior scenes are brushed with a golden light, and sometimes that light feels like a benediction.", "synonym": "amen"}, {"word": "redeem", "definitionA": "to make up for; make amends for; offset (some fault, shortcoming, etc.):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To recover ownership of something by buying it back.<br>&nbsp;&nbsp;&nbsp;2. To liberate by payment of a ransom.<br>&nbsp;&nbsp;&nbsp;3. To set free by force.<br>&nbsp;&nbsp;&nbsp;4. To save, rescue<br>&nbsp;&nbsp;&nbsp;5. To clear, release from debt or blame<br>&nbsp;&nbsp;&nbsp;6. To expiate, atone (for)<br>&nbsp;&nbsp;&nbsp;7. To convert (some bond or security) into cash<br>&nbsp;&nbsp;&nbsp;8. To save from a state of sin (and from its consequences).<br>&nbsp;&nbsp;&nbsp;9. To repair, restore<br>&nbsp;&nbsp;&nbsp;10. To reform, change (for the better)<br>&nbsp;&nbsp;&nbsp;11. To restore the honour, worth, or reputation of oneself or something.<br>&nbsp;&nbsp;&nbsp;12. To reclaim<br>", "etymology": "First recorded in 1375–1425; late Middle English redemen, from Middle French redimer, from Latin redimere, equivalent to red- red- + -imere, combining form of emere “to purchase” ( emptor, ransom )", "example": "If the company grows without raising additional equity funding, founders redeem most of the equity right, based on a pre-agreed return amount.", "synonym": "cash"}, {"word": "visage", "definitionA": "the face, usually with reference to shape, features, expression, etc.; countenance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Countenance; appearance; one's face.<br>", "etymology": "First recorded in 1300–50; Middle English, from Anglo-French, Old French, equivalent to vis “face” (from Latin vīsus “sight, appearance” ( Vulgar Latin: “face”), noun use of masculine past participle of vidēre “to see”) + -age -age. See wit 2( def )", "example": "An app called Reface, for example, lets them switch visages with another person—a popular TikTok hobby.", "synonym": "aspect"}, {"word": "churlish", "definitionA": "like a churl; boorish; rude:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to a serf, peasant, or rustic.<br>&nbsp;&nbsp;&nbsp;2. Rude, surly, ungracious.<br>&nbsp;&nbsp;&nbsp;3. Stingy or grudging.<br>&nbsp;&nbsp;&nbsp;4. (of soil) Difficult to till, lacking pliancy; unmanageable.<br>", "etymology": "Before 1000; Middle English cherlish, Old English ceorlisc. See churl, -ish 1", "example": "Honestly, aside from a rather churlish crow named Mango, you’d be surprised at just how crafty birds can be!", "synonym": null}, {"word": "malleable", "definitionA": "capable of being extended or shaped by hammering or by pressure from rollers.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able to be hammered into thin sheets; capable of being extended or shaped by beating with a hammer, or by the pressure of rollers.<br>&nbsp;&nbsp;&nbsp;2. Flexible, liable to change.<br>&nbsp;&nbsp;&nbsp;3. (of an algorithm) in which an adversary can alter a ciphertext such that it decrypts to a related plaintext<br>", "etymology": "1350–1400; Middle English malliable < Medieval Latin malleābilis, equivalent to malle ( āre ) to hammer (derivative of Latin malleus hammer) + -ābilis -able", "example": "Of course, as is always the case for ambitious infrastructure projects, timelines are malleable, and a lot can change over the course of a decade.", "synonym": null}, {"word": "countenance", "definitionA": "appearance, especially the look or expression of the face:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Appearance, especially the features and expression of the face.<br>&nbsp;&nbsp;&nbsp;2. Favour; support; encouragement.<br>&nbsp;&nbsp;&nbsp;3. Superficial appearance; show; pretense.<br>&nbsp;&nbsp;&nbsp;4. Calm facial expression, composure, self-control.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tolerate, support, sanction, patronise or approve of something.<br>", "etymology": "First recorded in 1250–1300; Middle English cuntenaunce “behavior, bearing, self-control,” from Anglo-French cuntena(u)nce, Old French contenance, from Medieval Latin “way of living, demeanor,” from Latin continentia “self-control, restraint”; continence", "example": "Standing centerstage is Douglass with a serious but handsome countenance, that distinctive side part, dark coat and vest.", "synonym": "aspect"}, {"word": "capitulate", "definitionA": "to surrender unconditionally or on stipulated terms:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To surrender; to end all resistance, to give up; to go along with or comply.<br>&nbsp;&nbsp;&nbsp;2. To draw up in chapters; to enumerate.<br>&nbsp;&nbsp;&nbsp;3. To draw up the articles of treaty with; to treat, bargain, parley.<br>", "etymology": "First recorded in 1570–80; from Medieval Latin capitulātus (past participle of capitulāre “to draw up in sections”), equivalent to capitul(um) “section,” literally, “small head” + -ātus ; capitulum, chapter ( def ), -ate 1", "example": "To get the gavels and move things along, Democrats may have to give up much of their power and capitulate to McConnell’s request on the filibuster.", "synonym": "fold"}, {"word": "curmudgeon", "definitionA": "a bad-tempered, difficult, cantankerous person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A miser.<br>&nbsp;&nbsp;&nbsp;2. An ill-tempered person full of stubborn ideas or opinions.<br>", "etymology": "First recorded in 1570–80; unexplained; perhaps cur-, representing cur", "example": "Even skimming them makes me feel like a horrible curmudgeon.", "synonym": "bellyacher"}, {"word": "benison", "definitionA": "benediction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A blessing; benediction.<br>", "etymology": "1250–1300; Middle English < Anglo-French beneiçon, Middle French beneison < Latin benedictiōn- benediction", "example": "I wouldn't have missed Dot, doing the honours in her wedding-gown, my benison on her bright face!", "synonym": "amen"}, {"word": "kerfuffle", "definitionA": "Informal. a fuss; commotion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A disorderly outburst, disturbance, commotion, or tumult.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a disorderly outburst or commotion.<br>", "etymology": "First recorded in 1945–50; from Scots curfuffle, from cur- (from Scottish Gaelic car “a turn,” from Old Irish cor ) + fuffle “to disorder, confuse” (of imitative origin)", "example": "This comment kicked up a kerfuffle online that even had Auriemma’s daughter weighing in on Twitter, urging her father to walk his remark back.", "synonym": "brouhaha"}]
