[{"word": "cubicle", "definitionA": "a small space or compartment partitioned off.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small separate part or one of the compartments of a room, especially in a work environment.<br>&nbsp;&nbsp;&nbsp;2. A small enclosure at a swimming pool etc. used to provide personal privacy when changing.<br>&nbsp;&nbsp;&nbsp;3. A small enclosure in a public toilet for individual use.<br>", "etymology": "1400–50; late Middle English < Latin cubiculum bedroom, equivalent to cub ( āre ) to lie down + -i- -i- + -culum -cle 2", "example": "Amazon officials said the structure is intended to be an alternative workspace, not a traditional office building, where employees would be able to air out ideas and find downtime beyond their cubicles.", "synonym": "cubbyhole"}, {"word": "cuticle", "definitionA": "the nonliving epidermis that surrounds the edges of the fingernail or toenail.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The outermost layer of the skin of vertebrates; the epidermis.<br>&nbsp;&nbsp;&nbsp;2. The strip of hardened skin at the base and sides of a fingernail or toenail.<br>&nbsp;&nbsp;&nbsp;3. Dead or cornified epidermis.<br>&nbsp;&nbsp;&nbsp;4. A noncellular protective covering outside the epidermis of many invertebrates and plants.<br>&nbsp;&nbsp;&nbsp;5. A thin skin formed on the surface of a liquid.<br>", "etymology": "1605–15; < Latin cutīcula the skin, equivalent to cuti ( s ) skin, cutis + -cula -cle 1", "example": "A study now finds that tiny hairs on that cuticle act as a lubricant.", "synonym": null}, {"word": "probationary", "definitionA": "being or relating to an act, process, or period of testing, as of a person’s character, performance, qualifications, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An employee who is still in their probationary period.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, pertaining to, or subject to probation<br>", "etymology": "probation ( def ) + -ary ( def )", "example": "Facebook’s latest attempt to slow disinformation means probation for groupsFacebook offers ways to export your own profile data so you have a copy, and even a tool for moving your photos to competing services.", "synonym": "balloon"}, {"word": "gymnastics", "definitionA": "(used with a plural verb) gymnastic exercises.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sport involving the performance of sequences of movements requiring physical strength, flexibility, and kinesthetic awareness.<br>&nbsp;&nbsp;&nbsp;2. Complex intellectual or artistic exercises or feats of physical agility.<br>", "etymology": "First recorded in 1645–55; gymnastic, -ics", "example": "Habits die hard, and at the pool and gymnastics venues, journalists clumped together as they always had to ask questions and snag quotes when athletes stopped by.", "synonym": "aerobatics"}, {"word": "muppet", "definitionA": "slang. a stupid person", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (Eastern US) An incompetent or foolish person.<br>", "etymology": "C20: from the name for the puppets used in the television programme The Muppet Show", "example": "Pelosi is one of many politicians who have given in to the temptation of being pictured alongside a cartoon character or Muppet.", "synonym": null}, {"word": "deciduous", "definitionA": "shedding the leaves annually, as certain trees and shrubs.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Describing a part that falls off, or is shed, at a particular time or stage of development.<br>&nbsp;&nbsp;&nbsp;2. Of or pertaining to trees which lose their leaves in winter or the dry season.<br>&nbsp;&nbsp;&nbsp;3. Transitory, ephemeral, not lasting.<br>", "etymology": "First recorded in 1650–60; from Latin dēciduus “tending to fall, falling,” equivalent to dēcid(ere) “to fall off, down” ( dē- verb prefix of removal) + -cidere (combining form of cadere “to fall”) + -uus adjective suffix. See de-, -ous", "example": "This sweet spot happens in September, just before the deciduous trees start flaming all-out crimson.", "synonym": "brief"}, {"word": "thug", "definitionA": "a violent, lawless, or vicious person, especially one who commits a crime such as assault, robbery, or murder:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire.<br>&nbsp;&nbsp;&nbsp;2. One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her.<br>&nbsp;&nbsp;&nbsp;3. In gardening, an over-vigorous plant that spreads and dominates the flowerbed.<br>&nbsp;&nbsp;&nbsp;4. A punk; a hoodlum; a hooligan.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To commit acts of thuggery, to live the life of a thug, or to dress and act in a manner reminiscent of someone who does.<br>", "etymology": "First recorded in 1800–10; from Hindi, Marathi ṭhag “swindler, cheat, rogue,” perhaps from Sanskrit sthaga- “a cheat,” from sthagati “he conceals”", "example": "Mike has busted broncos, been tossed by bulls, alienated his former wife with his stoicism and, most recently, taken on various thugs.", "synonym": "delinquent"}, {"word": "heckle", "definitionA": "to harass (a public speaker, performer, etc.) with impertinent questions, gibes, or the like; badger.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An instrument with steel pins used to comb out flax or hemp.<br>&nbsp;&nbsp;&nbsp;2. (usually now in the plural) One of the long, narrow feathers on the neck of birds, most noticeable on the rooster.<br>&nbsp;&nbsp;&nbsp;3. A feather used to make a fishing lure or a fishing lure incorporating a feather.<br>&nbsp;&nbsp;&nbsp;4. (usually now in the plural) By extension (because the hackles of a rooster are lifted when it is angry), the hair on the nape of the neck in dogs and other animals; also used figuratively for humans.<br>&nbsp;&nbsp;&nbsp;5. A plate with rows of pointed needles used to blend or straighten hair.<br>&nbsp;&nbsp;&nbsp;6. A feather plume on some soldier's uniforms, especially the hat or helmet.<br>&nbsp;&nbsp;&nbsp;7. Any flimsy substance unspun, such as raw silk.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The long shining feathers on a cock's neck.<br>&nbsp;&nbsp;&nbsp;2. A feather ornament in the full-dress bonnets of Highland regiments.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To question harshly in an attempt to find or reveal weaknesses.<br>&nbsp;&nbsp;&nbsp;2. To insult, tease, make fun of or badger.<br>&nbsp;&nbsp;&nbsp;3. To prepare flax for spinning using special combs called hackles<br>", "etymology": "First recorded in 1275–1325; Middle English hekelen, variant of hechelen “to comb flax”; akin to hackle 1, hatchel", "example": "Known on stage for his confrontational style, Gelman heckles the audience as much as they heckle him.", "synonym": "bait"}, {"word": "palpable", "definitionA": "readily or plainly seen, heard, perceived, etc.; obvious; evident:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Capable of being touched, felt or handled; touchable, tangible.<br>&nbsp;&nbsp;&nbsp;2. Obvious or easily perceived; noticeable.<br>&nbsp;&nbsp;&nbsp;3. That can be detected by palpation.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Late Latin palpābilis “touchable,” from palpā(re) “to stroke, touch” ( palpate 1 ) + -bilis -ble", "example": "The joy of togetherness was the thing that was most missed by our students over the past months, and when the signal arrived that the vaccine was working, the yearning to gather once again was palpable.", "synonym": "tangible"}, {"word": "brume", "definitionA": "mist; fog.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mist, fog, vapour.<br>", "etymology": "1800–10; < French: fog < Provençal bruma < Latin brūma winter, originally winter solstice, contraction of *brevima ( diēs ) shortest (day); breve", "example": "Le laid est beau et le beau laid Allons flotter dans la brume, Allons faire le tour du monde, Dans la brume et l'air immonde.", "synonym": null}, {"word": "insolent", "definitionA": "boldly rude or disrespectful; contemptuously impertinent; insulting:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who is insolent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Insulting in manner or words.<br>&nbsp;&nbsp;&nbsp;2. Rude.<br>", "etymology": "First recorded in 1350–1400; Middle English from Latin insolent- (stem of insolēns ) “departing from custom,” equivalent to in- in- 3 + sol- (stem of solēre “to be accustomed”) + -ent- -ent", "example": "Their very posture—the way they loitered and leaned and lolled about—was insolent.", "synonym": "bold"}]