[{"word": "ado", "definitionA": "busy activity or bustle; fuss; bother:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Trouble; troublesome business; fuss, commotion<br>", "etymology": "First recorded in 1250–1300; Middle English (north) at do, a phrase equivalent to at “to” (from Old Norse, which used at with the infinitive) + do do 1", "example": "So without further ado, here’s a smattering of dogs — and birds, and squirrels — filling up while the filling’s good.", "synonym": "bother"}, {"word": "besmirch", "definitionA": "to soil; tarnish; discolor.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make dirty.<br>&nbsp;&nbsp;&nbsp;2. To tarnish something, especially someone's reputation.<br>", "etymology": "First recorded in 1590–1600; be- + smirch", "example": "While Couric included some of Ginsburg’s criticism in the finished product, she decided to leave out that particular barb, concerned that it would besmirch the reputation of someone she was a “fan” of.", "synonym": "blot"}, {"word": "smirch", "definitionA": "to discolor or soil; spot or smudge with or as with soot, dust, dirt, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Dirt, or a stain.<br>&nbsp;&nbsp;&nbsp;2. A stain on somebody's reputation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dirty; to make dirty.<br>&nbsp;&nbsp;&nbsp;2. To harm the reputation of; to smear or slander.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A chirp of radiation power from an astronomical body that has a smeared appearance on its plot in the time-frequency plane (usually associated with massive bodies orbiting supermassive black holes)<br>", "etymology": "First recorded in 1485–95; origin uncertain", "example": "After the trial I saw Holker and asked him if he had been helping to smirch any more poor artists.", "synonym": "besmear"}, {"word": "accomplice", "definitionA": "a person who knowingly helps another in a crime or wrongdoing, often as a subordinate.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An associate in the commission of a crime; a participator in an offense, whether a principal or an accessory.<br>&nbsp;&nbsp;&nbsp;2. A cooperator.<br>", "etymology": "First recorded in 1475–85; a(c) of uncertain origin + late Middle English complice, from Middle French, from Medieval Latin complici- (stem of complex ) “partner”; complex", "example": "The information will be stored in a confidential database accessible to federal law enforcement and shared with banks who are often unwitting accomplices to international corruption.", "synonym": "abettor"}, {"word": "soliloquy", "definitionA": "an utterance or discourse spoken to oneself, without regard for whether any other hearers are present (often used as a device in drama to disclose a character's innermost thoughts):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of a character speaking to themselves so as to reveal their thoughts to the audience.<br>&nbsp;&nbsp;&nbsp;2. (authorship) A speech or written discourse in this form.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (very rare) To issue a soliloquy.<br>", "etymology": "First recorded in 1595–1605; from Late Latin sōliloquium “a talking to oneself, soliloquy,” equivalent to sōli- soli- 1 + loqu(ī) “to speak” + -ium -ium; -y 3", "example": null, "synonym": "aside"}, {"word": "dysphoria", "definitionA": "a state of dissatisfaction, anxiety, or restlessness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A state of feeling unwell or unhappy; a feeling of emotional and mental discomfort and suffering from restlessness, malaise, depression or anxiety.<br>", "etymology": "First recorded in 1835–45; from New Latin, from Greek dysphoría “malaise, discomfort,” equivalent to dys- dys- + phor(ós) “bearing” + -ia -ia", "example": "Gender dysphoria is a serious medical condition, and for incarcerated people it means the Constitution requires they be provided with adequate health care.", "synonym": "anxiety"}, {"word": "assent", "definitionA": "to agree or concur; subscribe to (often followed by to ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Agreement; act of agreeing<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To agree; to give approval.<br>&nbsp;&nbsp;&nbsp;2. To admit a thing as true.<br>", "etymology": "1250–1300; Middle English asenten < Old French asenter < Latin assentārī, equivalent to as- as- + sen ( t )- ( scent ) + -t- frequentative suffix + -ā- thematic vowel + -rī infinitive suffix", "example": "She gave royal assent to the Sexual Offenses Act of 1967, which decriminalized consensual same-sex sexual relations among men in England and Wales who are at least 21, as the Blade reported.", "synonym": "acceptance"}, {"word": "smattering", "definitionA": "a slight, superficial, or introductory knowledge of something:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A superficial or shallow knowledge of a subject.<br>&nbsp;&nbsp;&nbsp;2. A small number or amount of something.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To talk superficially; to babble, chatter.<br>&nbsp;&nbsp;&nbsp;2. To speak (a language) with spotty or superficial knowledge.<br>&nbsp;&nbsp;&nbsp;3. To study or approach superficially; to dabble in.<br>&nbsp;&nbsp;&nbsp;4. To have a slight taste, or a slight, superficial knowledge, of anything; to smack.<br>", "etymology": "First recorded in 1530–40; smatter + -ing 1( def ).", "example": "At first, just a smattering of travelers tested positive, triggering work-from-home orders and panicked searches for masks.", "synonym": "basics"}, {"word": "bleak", "definitionA": "bare, desolate, and often windswept:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Without color; pale; pallid.<br>&nbsp;&nbsp;&nbsp;2. Desolate and exposed; swept by cold winds.<br>&nbsp;&nbsp;&nbsp;3. Unhappy; cheerless; miserable; emotionally desolate.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small European river fish (Alburnus alburnus), of the family Cyprinidae.<br>", "etymology": "First recorded in 1300–50; Middle English bleke “pale,” blend of variants bleche ( Old English blǣc ) and blake ( Old English blāc ); both cognate with Old Norse bleikr, German bleich; akin to bleach", "example": "It was a bleak image of the future, with an urgent call to action — one that was more or less ignored by the federal government.", "synonym": "comfortless"}, {"word": "trough", "definitionA": "a long, narrow, open receptacle, usually boxlike in shape, used chiefly to hold water or food for animals.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long, narrow container, open on top, for feeding or watering animals.<br>&nbsp;&nbsp;&nbsp;2. Any similarly shaped container.<br>&nbsp;&nbsp;&nbsp;3. A short, narrow canal designed to hold water until it drains or evaporates.<br>&nbsp;&nbsp;&nbsp;4. A gutter under the eaves of a building; an eaves trough.<br>&nbsp;&nbsp;&nbsp;5. A channel for conveying water or other farm liquids (such as milk) from place to place by gravity; any ‘U’ or ‘V’ cross-sectioned irrigation channel.<br>&nbsp;&nbsp;&nbsp;6. A long, narrow depression between waves or ridges; the low portion of a wave cycle.<br>&nbsp;&nbsp;&nbsp;7. A linear atmospheric depression associated with a weather front.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To eat in a vulgar style, as if from a trough.<br>", "etymology": "First recorded before 900; Middle English; Old English trōh; cognate with Dutch, German, Old Norse trog", "example": "Cooler air in the core of the trough aloft will help destabilize the atmosphere, and increase the winds in middle levels of the atmosphere.", "synonym": "canal"}, {"word": "disparate", "definitionA": "distinct in kind; essentially different; dissimilar:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly in the plural) Any of a group of unequal or dissimilar things.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Composed of inherently different or distinct elements; incongruous.<br>&nbsp;&nbsp;&nbsp;2. Essentially different; of different species, unlike but not opposed in pairs; also, less properly, utterly unlike; incapable of being compared; having no common genus.<br>", "etymology": "First recorded in 1580–90; from Latin disparātus “separated,” past participle of disparāre “to separate,” from dis- dis- 1 + parāre “to make ready” ( pare )", "example": null, "synonym": null}]