[{"word": "requite", "definitionA": "to make repayment or return for (service, benefits, etc.).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Requital<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To return (usually something figurative) that has been given; to repay; to recompense<br>&nbsp;&nbsp;&nbsp;2. To retaliate.<br>", "etymology": "1520–30; re- + obsolete quite, variant of quit 1", "example": "Luckily for him, in Colwin’s world, the brief torture of falling in love is just prelude to the lifelong joy of finding your love requited.", "synonym": "indemnify"}, {"word": "quit", "definitionA": "to stop, cease, or discontinue:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pay (a debt, fine etc.).<br>&nbsp;&nbsp;&nbsp;2. To repay (someone) for (something).<br>&nbsp;&nbsp;&nbsp;3. To repay, pay back (a good deed, injury etc.).<br>&nbsp;&nbsp;&nbsp;4. To conduct or acquit (oneself); to behave (in a specified way).<br>&nbsp;&nbsp;&nbsp;5. To carry through; to go through to the end.<br>&nbsp;&nbsp;&nbsp;6. To set at rest; to free, as from anything harmful or oppressive; to relieve; to clear; to liberate.<br>&nbsp;&nbsp;&nbsp;7. To release from obligation, accusation, penalty, etc.; to absolve; to acquit.<br>&nbsp;&nbsp;&nbsp;8. To abandon, renounce (a thing).<br>&nbsp;&nbsp;&nbsp;9. To leave (a place).<br>&nbsp;&nbsp;&nbsp;10. To resign from (a job, office, position, etc.).<br>&nbsp;&nbsp;&nbsp;11. To stop, give up (an activity) (usually + gerund or verbal noun).<br>&nbsp;&nbsp;&nbsp;12. To close (an application).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually followed by of) Released from obligation, penalty, etc; free, clear, or rid.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of numerous species of small passerine birds native to tropical America.<br>", "etymology": "First recorded in 1200–50; Middle English verb qui(t)ten “to pay, acquit oneself,” from Old French quit(t)er, from Medieval Latin quittāre, quiētāre “to release, discharge,” Late Latin quiētare “to put to rest, quiet; ” quite ( def )", "example": "According to Long, who has driven the push to remove Trudeau, as many as 50 of the 153 Liberal MPs want him to quit immediately.", "synonym": "abdicate"}, {"word": "whilom", "definitionA": "former; erstwhile:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Former, sometime.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. While.<br>&nbsp;&nbsp;&nbsp;2. Once upon a time, formerly.<br>&#60;conjunction&#62;<br>&nbsp;&nbsp;&nbsp;1. While.<br>", "etymology": "before 900; Middle English; Old English hwīlum at times, dative plural of hwīl while (noun)", "example": "Schine imagines the stories that words hold for the twins, words like “whilom,” which “was light and airy and lost, like a lady in a white nightgown wandering through a field of flowers filmed over with dewdrops.”", "synonym": "above"}, {"word": "beatific", "definitionA": "bestowing bliss, blessings, happiness, or the like:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Blessed, blissful, heavenly<br>&nbsp;&nbsp;&nbsp;2. Having a benign appearance<br>", "etymology": "First recorded in 1630–40; from French, from Late Latin beātificus “making happy,” equivalent to beāt(us) (past participle of beāre “to bless”) + -i- + -ficus; -ate 1, -i-, -fic", "example": "When the crowd started chanting \"lock him up\" when Clinton mentioned Trump's felony convictions and she smiled beatifically the crowd roared —- she had earned that.", "synonym": null}, {"word": "confabulate", "definitionA": "to converse informally; chat.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak casually with; to chat.<br>&nbsp;&nbsp;&nbsp;2. To confer.<br>&nbsp;&nbsp;&nbsp;3. To fabricate memories in order to fill gaps in one's memory.<br>", "etymology": "First recorded in 1600–10; from Latin confābulātus (past participle of confābulārī “to talk together, discuss”); con- ( def ), fable ( def ), -ate 1( def )", "example": "“If he is confabulating, he is wholly confident in his recollection and will stick to his guns. You can’t present anyone confabulating with evidence to the contrary because they believe their own reality.”", "synonym": "chaffer"}, {"word": "cusp", "definitionA": "a point that marks the beginning of a change:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sharp point or pointed end.<br>&nbsp;&nbsp;&nbsp;2. An important moment when a decision is made that will determine future events.<br>&nbsp;&nbsp;&nbsp;3. A point of a curve where the curve is continuous but has no derivative, but such that it has a derivative at every nearby point.<br>&nbsp;&nbsp;&nbsp;4. A point made by the intersection of two curved lines or curved structures, a common motif in Gothic architecture.<br>&nbsp;&nbsp;&nbsp;5. A boundary between zodiacal signs and houses.<br>&nbsp;&nbsp;&nbsp;6. Any of the pointed parts of a canine tooth or molar.<br>&nbsp;&nbsp;&nbsp;7. A flap of a valve of a heart or blood vessel.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To behave in a reckless or dangerous manner.<br>", "etymology": "First recorded in 1575–85, from Latin cuspis “a point”", "example": "It is understood that Supreme, which stocks and distributes Duracell and Energiser batteries as well as Elf Bar vapes, is on the cusp of buying the firm.", "synonym": "angle"}, {"word": "careen", "definitionA": "(of a vehicle) to lean, sway, or tip to one side while in motion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The position of a ship laid on one side.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To heave a ship down on one side so as to expose the other, in order to clean it of barnacles and weed, or to repair it below the water line.<br>&nbsp;&nbsp;&nbsp;2. To tilt on one side.<br>&nbsp;&nbsp;&nbsp;3. To lurch or sway violently from side to side.<br>&nbsp;&nbsp;&nbsp;4. To tilt or lean while in motion.<br>&nbsp;&nbsp;&nbsp;5. (chiefly US) To career, to move rapidly straight ahead, to rush carelessly.<br>&nbsp;&nbsp;&nbsp;6. (chiefly US) To move swiftly and in an uncontrolled way.<br>", "etymology": "1585–95  careen fordef 9; < Middle French carine < Latin carīna keel, nutshell; akin to Greek káryon nut", "example": "A witness told The Times that the officer had lost control of the motorcycle while popping a wheelie and had careened into the crowd, injuring attendees.", "synonym": "bend"}, {"word": "wacky", "definitionA": "odd or irrational; crazy:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Zany; eccentric<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A soft, earthy, dark-coloured rock or clay derived from the alteration of basalt.<br>", "etymology": "First recorded in 1935–40; apparently whack (noun, as in out of whack ) + -y 1", "example": "One of Aardman’s trademarks is how its films effectively adapt easily recognizable tropes to their wacky characters.", "synonym": null}, {"word": "brabble", "definitionA": "to argue stubbornly about trifles; wrangle.", "definitionB": "No definition found", "etymology": "First recorded in 1490–1500, from Dutch brabbelen “to quarrel, jabber”", "example": "Women, for the most part, received this punishment for not controlling their “brabbling” tongues.", "synonym": null}, {"word": "imprimis", "definitionA": "in the first place.", "definitionB": "No definition found", "etymology": "1425–75; late Middle English < Latin, contraction of phrase in prīmīs in the first place, above all", "example": "In 2017, Christopher Caldwell declared in Hillsdale College’s Imprimis magazine that Putin was “the preeminent statesman of our time.”", "synonym": null}, {"word": "argent", "definitionA": "Heraldry. the tincture or metal silver.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The metal silver.<br>&nbsp;&nbsp;&nbsp;2. The white or silver tincture on a coat of arms.<br>&nbsp;&nbsp;&nbsp;3. Whiteness; anything that is white.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of silver or silver-coloured.<br>&nbsp;&nbsp;&nbsp;2. : of white or silver tincture on a coat of arms.<br>", "etymology": "1400–50; late Middle English argentum < Latin: silver, money", "example": "There is cheese by the pound, from Wisconsin or France; meat cured in house; fish like the best of Russ & Daughters: herring, salmon belly salad, anchovies slippery and argent.", "synonym": "silver"}, {"word": "campanulate", "definitionA": "bellshaped, as a corolla.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Shaped like a bell.<br>", "etymology": "From the New Latin word campānulātus, dating back to 1660–70. See campanula, -ate 1", "example": "Among the extravagant oddities was a shrubby tender vine whose common name, monastery bells, speaks to its big, squat campanulate flower, unlike any other I have seen.", "synonym": null}, {"word": "golem", "definitionA": "Jewish Folklore. a figure artificially constructed in the form of a human being and endowed with life.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A humanoid creature made from clay, animated by magic.<br>&nbsp;&nbsp;&nbsp;2. (by extension) A humanoid creature made from any previously inanimate matter, such as wood or stone, animated by magic.<br>", "etymology": "First recorded in 1895–1900; (via Yiddish goylem ) from Biblical Hebrew gōlem “something wrapped together, shapeless mass; embryo”", "example": "“Dr. Weinberg said my pixies were upsetting her golem.”", "synonym": null}, {"word": "covet", "definitionA": "to desire wrongfully, inordinately, or without due regard for the rights of others:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wish for with eagerness; to desire possession of, often enviously.<br>&nbsp;&nbsp;&nbsp;2. To long for inordinately or unlawfully; to hanker after (something forbidden).<br>&nbsp;&nbsp;&nbsp;3. To yearn; to have or indulge an inordinate desire, especially for another's possession.<br>", "etymology": "First recorded in 1325–1350; Middle English coveiten, from Anglo-French coveiter, Old French coveit(i)er, from unattested Vulgar Latin cupiditāre, verbal derivative of Latin cupiditās cupidity", "example": "His last album “Justice” was released nearly four years ago and garnered a handful of Grammys nominations, even the coveted nod of album of the year.", "synonym": "begrudge"}, {"word": "endorse", "definitionA": "to approve, support, or sustain:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A diminutive of the pale, usually appearing in pairs on either side of a pale.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To support, to back, to give one's approval to, especially officially or by signature.<br>&nbsp;&nbsp;&nbsp;2. To write one's signature on the back of a cheque, or other negotiable instrument, when transferring it to a third party, or cashing it.<br>&nbsp;&nbsp;&nbsp;3. To give an endorsement.<br>", "etymology": "First recorded in 1350–1400; variant (with en- for in- ) of earlier indorse, from Medieval Latin indorsāre “to endorse,” equivalent to Latin in- in- 2 + -dorsāre, derivative of dorsum “back”; replacing endoss, Middle English endossen, from Old French endosser, equivalent to en- en- 1 + -dosser, derivative of dos, from Latin dorsum", "example": "The polls show that the American people appear to be endorsing Trump’s “mandate” on such issues as “the border” and “the economy.”", "synonym": "accredit"}, {"word": "endow", "definitionA": "to provide with a permanent fund or source of income:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To provide with a dower or a dowry.<br>&nbsp;&nbsp;&nbsp;2. To give property to (someone) as a gift; specifically, to provide (a person or institution) with support in the form of a permanent fund of money or other benefits.<br>&nbsp;&nbsp;&nbsp;3. Followed by with, or rarely by of: to enrich or furnish with some faculty or quality.<br>&nbsp;&nbsp;&nbsp;4. Usually in the passive: to naturally furnish (with something).<br>", "etymology": "First recorded in 1350–1400; Middle English endowen, from Old French endouer, equivalent to en- en- 1 + douer, from Latin dōtāre “to dower,” equivalent to dōt- (stem of dōs ) “dowry” + -āre infinitive suffix", "example": "Mercy, it says, “is the act of withholding deserved punishment, while grace is the act of endowing unmerited favor.”", "synonym": "accord"}, {"word": "endue", "definitionA": "to invest or endow with some gift, quality, or faculty.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pass food into the stomach; to digest; also figuratively, to take on, absorb.<br>&nbsp;&nbsp;&nbsp;2. To take on, to take the form of.<br>&nbsp;&nbsp;&nbsp;3. To put on (a piece of clothing); to clothe (someone with something).<br>&nbsp;&nbsp;&nbsp;4. To invest (someone) with a given quality, property etc.; to endow.<br>", "etymology": "First recorded in 1350–1400; Middle English endewen “to induct, initiate,” from Anglo-French, Old French enduire, from Latin indūcere “to lead in, cover, induce”; induce", "example": "Iowa State: The Cyclones weren’t quite ready for the big stage, enduing one of the poorest shooting performances in recent memory.", "synonym": "award"}]