[{"word": "imbrue", "definitionA": "to stain:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stain (in, with, blood, slaughter, etc.).<br>", "etymology": "1400–50; late Middle English enbrewen < Middle French embreuver to cause to drink in, soak, drench < Vulgar Latin *imbiberāre, derivative of Latin imbibere to imbibe", "example": "Then he charged me as an enemy to the King, that I endeavoured to raise a new war, and imbrue the nation in blood again.", "synonym": "cast"}, {"word": "chiropractic", "definitionA": "a therapeutic system based primarily upon the interactions of the spine and nervous system, the method of treatment usually being to adjust the segments of the spinal column.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A system of health care involving manipulation of the spinal column and other body structures, for the purpose of alleviating neuromusculoskeletal dysfunction.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to chiropractics.<br>", "etymology": "1895–1900, Americanism; chiro- + -practic < Greek praktikós; practical", "example": "He tried physical therapy, chiropractic care, epidurals, and cortisone shots, and he finally had surgery.", "synonym": null}, {"word": "shack", "definitionA": "a rough cabin; shanty.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A crude, roughly built hut or cabin.<br>&nbsp;&nbsp;&nbsp;2. Any poorly constructed or poorly furnished building.<br>&nbsp;&nbsp;&nbsp;3. The room from which a ham radio operator transmits.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To live (in or with); to shack up.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Grain fallen to the ground and left after harvest.<br>&nbsp;&nbsp;&nbsp;2. Nuts which have fallen to the ground.<br>&nbsp;&nbsp;&nbsp;3. Freedom to pasturage in order to feed upon shack.<br>&nbsp;&nbsp;&nbsp;4. A shiftless fellow; a low, itinerant beggar; a vagabond; a tramp.<br>&nbsp;&nbsp;&nbsp;5. Bait that can be picked up at sea.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shed or fall, as corn or grain at harvest.<br>&nbsp;&nbsp;&nbsp;2. To feed in stubble, or upon waste.<br>&nbsp;&nbsp;&nbsp;3. To wander as a vagabond or tramp.<br>&nbsp;&nbsp;&nbsp;4. To hibernate; to go into winter quarters.<br>", "etymology": "1875–80, Americanism; compare earlier shackly rickety, probably akin to ramshackle ( Mexican Spanish jacal “hut” is a phonetically impossible source)", "example": "Madison went to a tavern the night of the 25th, but there were rumors that the British were coming to capture him, and he was evacuated to what has been called a “hovel in the woods,” possibly a shack belonging to a ferryman just above Great Falls.", "synonym": "camp"}, {"word": "berate", "definitionA": "to scold; rebuke:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To chide or scold vehemently<br>", "etymology": "First recorded in 1540–50; be- + rate 2", "example": "He sometimes berates the one who remains, stating outright that the other was his favorite.", "synonym": "blister"}, {"word": "gossamer", "definitionA": "a fine, filmy cobweb seen on grass or bushes or floating in the air in calm weather, especially in autumn.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fine film or strand as of cobwebs, floating in the air or caught on bushes, etc.<br>&nbsp;&nbsp;&nbsp;2. A soft, sheer fabric.<br>&nbsp;&nbsp;&nbsp;3. Anything delicate, light and flimsy.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tenuous, light, filmy or delicate.<br>", "etymology": "First recorded in 1300–50; Middle English gos(s)esomer, gossummer “filmy substance made of cobwebs; fine filament; something trivial”; possibly first used as a name for late, mild autumn, a time when goose was a favorite dish (compare German Gänsemonat “November”), then transferred to the cobwebs frequent at that time of year", "example": "Named cardiac nexus glia, these cells appear early in zebrafish development and go on to spread out and form a gossamer-thin web around the heart, Smith and Kikel-Coury reported last year in PLOS Biology.", "synonym": "cobweb"}, {"word": "annul", "definitionA": "(especially of laws or other established rules, usages, etc.) to make void or null; abolish; cancel; invalidate:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To formally revoke the validity of.<br>&nbsp;&nbsp;&nbsp;2. To dissolve (a marital union) on the grounds that it is not valid.<br>", "etymology": "1375–1425; late Middle English < Anglo-French annuler < Late Latin adnūllāre render null (calque of Greek exoudeneîn ), equivalent to ad- ad- + -nullāre, verbal derivative of Latin nūllus no, not any", "example": "For instance, in Australia, marriages have been annulled because governments have previously ruled that an intersex person – someone not seen to be “100% man” or “100% woman” – cannot be legally married.", "synonym": "abate"}, {"word": "broth", "definitionA": "thin soup of concentrated meat or fish stock.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Water in which food (meat or vegetable etc) has been boiled.<br>&nbsp;&nbsp;&nbsp;2. A soup made from broth and other ingredients such as vegetables, herbs or diced meat.<br>", "etymology": "before 1000; Middle English, Old English; cognate with Old Norse broth, Old High German brod; akin to brew", "example": "We usually tie the sprigs together on a thin string that we can then fish out of the cooking broth at the end.", "synonym": "borscht"}, {"word": "ostomy", "definitionA": "any of various surgical procedures, as a colostomy, in which an artificial opening is made so as to permit the drainage of waste products either into an appropriate organ or to the outside of the body.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A surgical procedure to provide an exit point for the waste of an organism.<br>&nbsp;&nbsp;&nbsp;2. An exit point created by such surgical procedure.<br>", "etymology": "1955–60; generalized from words in which -ostomy is the final element; -o-, -stomy", "example": "For many that means living with the damage the disease has done to their intestinal tract, and sometimes with the altering impacts of surgery done to manage it, such as ostomy pouches or increased incontinence.", "synonym": null}, {"word": "colostomy", "definitionA": "the construction of an artificial opening from the colon through the abdominal wall, thus bypassing a diseased portion of the lower intestine and permitting the passage of intestinal contents.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An incision into the colon to allow for drainage; the opening produced in such incision.<br>", "etymology": "First recorded in 1885–90; colo- + -stomy", "example": "And, thanks to a host of women posting photos of themselves with their colostomy bags, the condition is shedding its stigma.", "synonym": null}, {"word": "stoma", "definitionA": "Also  Botany. any of various small apertures, especially one of the minute orifices or slits in the epidermis of leaves, stems, etc., through which gases are exchanged.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of the tiny pores in the epidermis of a leaf or stem through which gases and water vapor pass.<br>&nbsp;&nbsp;&nbsp;2. A small opening in a membrane; a surgically constructed opening, especially one in the abdominal wall that permits the passage of waste after a colostomy or ileostomy.<br>&nbsp;&nbsp;&nbsp;3. A mouthlike opening, such as the oral cavity of a nematode.<br>&nbsp;&nbsp;&nbsp;4. An artificial anus.<br>", "etymology": "First recorded in 1675–85; from New Latin, from Greek stóma “mouth”", "example": "The vast majority of patients choose the urostomy, in which surgeons create a stoma—a beefy red spout protruding from the belly—so that urine can flow from the kidneys, through an intestinal conduit, and out the body.", "synonym": "halo"}, {"word": "impermeable", "definitionA": "not permeable; impassable.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Impossible to permeate.<br>&nbsp;&nbsp;&nbsp;2. Not allowing passage, especially of liquids; waterproof.<br>", "etymology": "From the Late Latin word impermeābilis, dating back to 1690–1700. See im- 2, permeable", "example": "When there’s a highly compacted area beneath where the teeth of a plow can go, that impermeable layer of soil “can create standing water, and all other sorts of problems from an agricultural standpoint,” Hupy says.", "synonym": null}, {"word": "ergatocracy", "definitionA": "government by the workers", "definitionB": "No definition found", "etymology": "C20: from Greek ergatēs a workman, from ergon work, deed + -cracy", "example": null, "synonym": null}, {"word": "gumbo", "definitionA": "a stew or thick soup, usually made with chicken or seafood, greens, and okra or sometimes filé as a thickener.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A soup or stew made with okra.<br>&nbsp;&nbsp;&nbsp;2. A fine silty soil that when wet becomes very thick and heavy.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The edible immature mucilaginous seed pod (properly, capsule) of the Abelmoschus esculentus.<br>&nbsp;&nbsp;&nbsp;2. The flowering mallow plant Abelmoschus esculentus itself, now commonly grown in the tropics and warmer parts of the temperate zones.<br>", "etymology": "1795–1805, Americanism; < Louisiana French gombo, gumbo < a Bantu language; compare Umbundu ochinggombo, Luba chinggombo okra", "example": "Climate projections show that gumbo weather could become a thing of the past.", "synonym": "borscht"}, {"word": "cob", "definitionA": "a corncob.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A male swan.<br>&nbsp;&nbsp;&nbsp;2. A corncob.<br>&nbsp;&nbsp;&nbsp;3. A round, often crusty roll or loaf of bread.<br>&nbsp;&nbsp;&nbsp;4. A building material consisting of clay, sand, straw, water, and earth, similar to adobe; also called cobb, rammed earth or pisé.<br>&nbsp;&nbsp;&nbsp;5. A horse having a stout body and short legs.<br>&nbsp;&nbsp;&nbsp;6. A gull, especially the black-backed gull (Larus marinus); also spelled cobb.<br>&nbsp;&nbsp;&nbsp;7. Any of the gold and silver coins that were minted in the Spanish Empire and valued in reales or escudos, such as the piece of eight—especially those which were crudely struck and irregularly shaped.<br>&nbsp;&nbsp;&nbsp;8. A Spanish coin formerly current in Ireland, worth about four shillings and sixpence.<br>&nbsp;&nbsp;&nbsp;9. One who is eminent, great, large, or rich.<br>&nbsp;&nbsp;&nbsp;10. A spider.<br>&nbsp;&nbsp;&nbsp;11. A small fish, the miller's thumb.<br>&nbsp;&nbsp;&nbsp;12. A large fish, especially the kabeljou (variant spelling of kob).<br>&nbsp;&nbsp;&nbsp;13. The head of a herring.<br>&nbsp;&nbsp;&nbsp;14. The top or head of anything.<br>&nbsp;&nbsp;&nbsp;15. A lump or piece of anything, usually of a somewhat large size, as of coal, or stone.<br>&nbsp;&nbsp;&nbsp;16. A punishment consisting of blows inflicted on the buttocks with a strap or a flat piece of wood.<br>&nbsp;&nbsp;&nbsp;17. A cylinder with pins in it, encoding music to be played back mechanically by a barrel organ.<br>&nbsp;&nbsp;&nbsp;18. A person of mixed black and white ancestry, especially a griffe; a mulatto.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To construct using mud blocks or to seal a wall using mud or an artificial equivalent.<br>&nbsp;&nbsp;&nbsp;2. Of growing corn, to have the heads mature into corncobs.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The nut of the common hazel (Corylus avellana); hazelnut.<br>&nbsp;&nbsp;&nbsp;2. A specific cultivated variety of hazelnut, also known as the Kentish cobnut.<br>&nbsp;&nbsp;&nbsp;3. A game played by children with nuts.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beat with a flat instrument; to paddle.<br>&nbsp;&nbsp;&nbsp;2. (Northern UK, possibly colloquial) To throw, chuck, lob.<br>&nbsp;&nbsp;&nbsp;3. To chip off unwanted pieces of stone, so as to form a desired shape or improve the quality of mineral ore.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Initialism of contingency operating base.<br>&nbsp;&nbsp;&nbsp;2. Acronym of chief of boat.<br>&nbsp;&nbsp;&nbsp;3. Close of Business, usually referring to a deadline for an office in another time zone.<br>&nbsp;&nbsp;&nbsp;4. Coordination of Benefits<br>&nbsp;&nbsp;&nbsp;5. Chairman of the Board<br>&nbsp;&nbsp;&nbsp;6. Chip on Board<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cobblestone.<br>&nbsp;&nbsp;&nbsp;2. A particle from 64 to 256 mm in diameter, following the Wentworth scale.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Small flat-bottomed fishing boat suitable for launching from a beach, found on the north-east coast of England and in Scotland.<br>", "etymology": "First recorded in 1375–1425; late Middle English cobbe “male swan, leader of a gang”; these and various subsequent senses are obscurely related and probably in part of distinct origin", "example": "In 2011, during the final days of our last Iraq war I spent time there, on the former U.S. base called COB Speicher.", "synonym": "agriculturalist"}]