[{"word": "query", "definitionA": "a question; an inquiry.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A question, an inquiry (US), an enquiry (UK).<br>&nbsp;&nbsp;&nbsp;2. A question mark.<br>&nbsp;&nbsp;&nbsp;3. A set of instructions passed to a database.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ask a question.<br>&nbsp;&nbsp;&nbsp;2. To ask, inquire.<br>&nbsp;&nbsp;&nbsp;3. To question or call into doubt.<br>&nbsp;&nbsp;&nbsp;4. To pass a set of instructions to a database to retrieve information from it.<br>&nbsp;&nbsp;&nbsp;5. To send a private message to (a user on IRC).<br>&nbsp;&nbsp;&nbsp;6. To send out a query letter.<br>", "etymology": "First recorded in 1625–35; alteration (with the influence of -y 3 ) of earlier quere, from Latin quaere quaere", "example": "When a person uses their mobile phone for a voice query, for example, it’s not a good user experience if the page they are delivered to isn’t optimized for mobile.", "synonym": "concern"}, {"word": "slag", "definitionA": "Also called  cinder. the more or less completely fused and vitrified matter separated during the reduction of a metal from its ore.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Waste material from a coal mine<br>&nbsp;&nbsp;&nbsp;2. Scum that forms on the surface of molten metal<br>&nbsp;&nbsp;&nbsp;3. Impurities formed and separated out when a metal is smelted from ore; vitrified cinders<br>&nbsp;&nbsp;&nbsp;4. Hard aggregate remaining as a residue from blast furnaces, sometimes used as a surfacing material<br>&nbsp;&nbsp;&nbsp;5. Scoria associated with a volcano<br>&nbsp;&nbsp;&nbsp;6. A coward<br>&nbsp;&nbsp;&nbsp;7. (chiefly Cockney) a contemptible person, a scumbag<br>&nbsp;&nbsp;&nbsp;8. A prostitute<br>&nbsp;&nbsp;&nbsp;9. A woman (sometimes a man) who has loose morals relating to sex; a slut<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To produce slag<br>&nbsp;&nbsp;&nbsp;2. To become slag; to agglomerate when heated below the fusion point<br>&nbsp;&nbsp;&nbsp;3. To reduce to slag<br>&nbsp;&nbsp;&nbsp;4. (sometimes with \"off\") to talk badly about; to malign or denigrate (someone)<br>&nbsp;&nbsp;&nbsp;5. To spit<br>", "etymology": "1545–55; < Middle Low German slagge; cognate with German Schlacke dross, slag; slack 2", "example": "Furnace brick and slag remnants were still to be found in the dirt.", "synonym": "ashes"}, {"word": "topography", "definitionA": "the detailed mapping or charting of the features of a relatively small area, district, or locality.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A precise description of a place.<br>&nbsp;&nbsp;&nbsp;2. A detailed graphic representation of the surface features of a place or object.<br>&nbsp;&nbsp;&nbsp;3. The features themselves; terrain.<br>&nbsp;&nbsp;&nbsp;4. The surveying of the features.<br>", "etymology": "First recorded in 1400–50; late Middle English topographye, from Late Latin topographia, from Greek topographía; topo-, -graphy", "example": "Those fires involve topography, weather, fuel conditions, fire-fighting response, on and on.", "synonym": "area"}, {"word": "hew", "definitionA": "to strike forcibly with an ax, sword, or other cutting instrument; chop; hack.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To chop away at; to whittle down; to mow down.<br>&nbsp;&nbsp;&nbsp;2. To shape; to form.<br>&nbsp;&nbsp;&nbsp;3. To act according to, to conform to; usually construed with to.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Hue; colour<br>&nbsp;&nbsp;&nbsp;2. Shape; form<br>&nbsp;&nbsp;&nbsp;3. Destruction by cutting down.<br>", "etymology": "First recorded before 900; Middle English hewen, Old English hēawan; cognate with German hauen, Old Norse hǫggva; akin to haggle", "example": "That system weakened as members of all three branches hewed increasingly to the platforms of the two political parties.", "synonym": "axe"}, {"word": "topos", "definitionA": "a convention or motif, especially in a literary work; a rhetorical convention.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A literary theme or motif; a rhetorical convention or formula.<br>&nbsp;&nbsp;&nbsp;2. An elementary topos<br>&nbsp;&nbsp;&nbsp;3. A Grothendieck topos<br>", "etymology": "First recorded in 1935–40; from Greek (koinós) tópos “(common) place”; topic ( def )", "example": "And p. 48 epeid per ho ts lichanou topos eis apeirous temnetai tomas.", "synonym": null}, {"word": "sassy", "definitionA": "disrespectful or impudent; impertinent; insolent:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Bold and spirited, cheeky, impudent, saucy.<br>&nbsp;&nbsp;&nbsp;2. Somewhat sexy and provocative.<br>&nbsp;&nbsp;&nbsp;3. Lively, vigorous.<br>", "etymology": "An Americanism dating back to 1830–1835; alteration of saucy", "example": "Since launching its TikTok presence back in February, Duo, which Parvez says is a sassy and fiercely loyal owl, has landed a number of viral TikToks by riffing off of trending audio clips.", "synonym": null}, {"word": "extricate", "definitionA": "to free or release from entanglement; disengage:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To free, disengage, loosen, or untangle.<br>&nbsp;&nbsp;&nbsp;2. To free from intricacies or perplexity<br>", "etymology": "First recorded in 1605–15; from Latin extricātus (past participle of extricāre ), equivalent to ex- ex- 1 + tric(ae) “perplexities” + -ātus -ate 1", "example": "One person had to be extricated from a vehicle, fire officials said.", "synonym": "clear"}, {"word": "canoodle", "definitionA": "to caress, fondle, or pet amorously.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cuddle, hug, or caress<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To caress, pet, feel up, or make love.<br>&nbsp;&nbsp;&nbsp;2. To cajole or persuade.<br>", "etymology": "1855–60; perhaps ca(ress) + noodle 2", "example": "The pair were first seen publicly canoodling in July 2002, shortly before Lopez filed for divorce from Judd.", "synonym": "caress"}, {"word": "abraxas", "definitionA": "a word of unknown significance found on charms, especially amulets, of the late Greco-Roman world and linked with both Gnostic beliefs and magical practices by the early church fathers.", "definitionB": "No definition found", "etymology": "First recorded in 1710–20; from Greek word abráxas, abrásax, abrasáx, of obscure origin; the combined numerical value of the Greek letters is 365, an important figure in Gnosticism and numerology", "example": "Upon them were engraved mysterious hieroglyphs and figures, called Abraxas, and they are known as Abraxoides.", "synonym": null}, {"word": "unceremoniously", "definitionA": "in a way that seems rudely abrupt or hasty; suddenly and without apology or explanation:", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. In an unceremonious manner, abruptly, without the due formalities.<br>", "etymology": "First recorded in 1750–60; unceremonious ( def ) + -ly ( def )", "example": "Sitting in the section of the sitcom’s studio usually reserved for the live audience, the pair wasted very little time on pleasantries, instead diving headfirst into the controversy of Hubert’s unceremonious exit from the show.", "synonym": null}, {"word": "samhainophobia", "definitionA": "an abnormal or extreme fear of Halloween", "definitionB": "No definition found", "etymology": null, "example": null, "synonym": null}]