[{"word": "cairn", "definitionA": "a heap of stones set up as a landmark, monument, tombstone, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A rounded or conical heap of stones erected by early inhabitants of the British Isles, apparently as a sepulchral monument.<br>&nbsp;&nbsp;&nbsp;2. A pile of stones heaped up as a landmark, to guide travelers on land or at sea, or to arrest attention, as in surveying, or in leaving traces of an exploring party, etc.<br>&nbsp;&nbsp;&nbsp;3. A cairn terrier.<br>", "etymology": "First recorded in 1525–35; earlier carn, from Scots Gaelic: “pile of stones”; perhaps akin to horn", "example": "Stumbling upon a cairn or a beautiful arrangement of leaves could bring a little burst of magic to someone’s day, and I’ve often smiled when I come upon similar projects myself.", "synonym": "column"}, {"word": "photogenic", "definitionA": "forming an attractive subject for photography or having features that look well in a photograph:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Generated or caused by light.<br>&nbsp;&nbsp;&nbsp;2. Producing or emitting light, luminescent.<br>&nbsp;&nbsp;&nbsp;3. Looking good when photographed.<br>", "etymology": "First recorded in 1830–40; photo- + -genic", "example": "There also are two photographs of the ever-photogenic Venice, which are finely made but risk turning the show into a different kind of story — one penned by culture and history rather than flickers, shadows and forms.", "synonym": "captivating"}, {"word": "spontaneous ", "definitionA": "coming or resulting from a natural impulse or tendency; without effort or premeditation; natural and unconstrained; unplanned:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Self-generated; happening without any apparent external cause.<br>&nbsp;&nbsp;&nbsp;2. Done by one's own free choice, or without planning.<br>&nbsp;&nbsp;&nbsp;3. Proceeding from natural feeling or native tendency without external or conscious constraint<br>&nbsp;&nbsp;&nbsp;4. Arising from a momentary impulse<br>&nbsp;&nbsp;&nbsp;5. Controlled and directed internally; self-active; spontaneous movement characteristic of living things<br>&nbsp;&nbsp;&nbsp;6. Produced without being planted or without human cultivation or labor.<br>&nbsp;&nbsp;&nbsp;7. Random.<br>&nbsp;&nbsp;&nbsp;8. Sudden, without warning.<br>", "etymology": "irst recorded in 1650–60; from Late Latin spontāneus, equivalent to Latin spont(e) “willingly” + -āneus ( -ān(us) -an + -eus -eous )", "example": "The premise of the sketch was that sex was too spontaneous to be regulated, and the quiz show played that idea to the hilt.", "synonym": null}, {"word": "snarky", "definitionA": "testy or irritable; short.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Snide and sarcastic; usually out of irritation, often humorously.<br>&nbsp;&nbsp;&nbsp;2. Irritable, irritated.<br>", "etymology": "snark 2 + -y 1", "example": "Neither snarky frenemies nor lonely achievers, these characters can achieve their dreams only by building one another up.", "synonym": "irascible"}, {"word": "sliver", "definitionA": "a small, slender, often sharp piece, as of wood or glass, split, broken, or cut off, usually lengthwise or with the grain; splinter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long piece cut or rent off; a sharp, slender fragment; a splinter.<br>&nbsp;&nbsp;&nbsp;2. A strand, or slender roll, of cotton or other fiber in a loose, untwisted state, produced by a carding machine and ready for the roving or slubbing which precedes spinning.<br>&nbsp;&nbsp;&nbsp;3. Bait made of pieces of small fish. Compare kibblings.<br>&nbsp;&nbsp;&nbsp;4. A narrow high-rise apartment building.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut or divide into long, thin pieces, or into very small pieces; to cut or rend lengthwise; to slit.<br>", "etymology": "1325–75; Middle English slivere (noun), derivative of sliven to split, Old English -slīfan (in tōslīfan to split up", "example": "The projects Metro is targeting this time around are a sliver of a nearly $23 billion budget for capital projects that stretches 10 years.", "synonym": "bit"}, {"word": "aficionado", "definitionA": "an ardent devotee; fan, enthusiast.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An amateur bullfighter.<br>&nbsp;&nbsp;&nbsp;2. A person who likes, knows about, and appreciates a particular interest or activity (originally bullfighting); a fan or devotee.<br>", "etymology": "First recorded in 1835–45; from Spanish: literally, “amateur,” past participle -ado ( -ate 1 ) of aficionar “to engender affection,” equivalent to afición affection 1 + -ar infinitive suffix", "example": "Sarnoff said that Warner’s strategy is actually in the interest of the exhibitor industry, despite criticism from theater aficionados like Nolan and cinema chains themselves.", "synonym": null}, {"word": "snoop", "definitionA": "to prowl or pry; go about in a sneaking, prying way.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of snooping<br>&nbsp;&nbsp;&nbsp;2. One who snoops<br>&nbsp;&nbsp;&nbsp;3. A private detective<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be devious and cunning so as not to be seen.<br>&nbsp;&nbsp;&nbsp;2. To secretly spy on or investigate, especially into the private personal life of others.<br>", "etymology": "1825–35, Americanism; < Dutch snoepen to take and eat food on the sly", "example": "Hidden defects could allow a stealthy snoop to penetrate the security unnoticed.", "synonym": "busybody"}, {"word": "bluster", "definitionA": "to roar and be tumultuous, as wind.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Pompous, officious talk.<br>&nbsp;&nbsp;&nbsp;2. A gust of wind.<br>&nbsp;&nbsp;&nbsp;3. Fitful noise and violence.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak or protest loudly.<br>&nbsp;&nbsp;&nbsp;2. To act or speak in an unduly threatening manner.<br>&nbsp;&nbsp;&nbsp;3. To blow in strong or sudden gusts.<br>", "etymology": "First recorded in 1520–30; perhaps from Low German blustern, blüstern “to blow violently”; compare Old Norse blāstr “blowing, hissing”", "example": "Played with equal parts warmth and bluster by Ed Asner, Lou Grant was the ultimate TV boss.", "synonym": "bluff"}, {"word": "inchoate", "definitionA": "not yet completed or fully developed; rudimentary.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A beginning, an immature start.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To begin or start (something).<br>&nbsp;&nbsp;&nbsp;2. To cause or bring about.<br>&nbsp;&nbsp;&nbsp;3. To make a start.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Recently started but not fully formed yet; just begun; only elementary or immature.<br>&nbsp;&nbsp;&nbsp;2. Chaotic, disordered, confused; also, incoherent, rambling.<br>&nbsp;&nbsp;&nbsp;3. Of a crime, imposing criminal liability for an incompleted act.<br>", "etymology": "1525–35; < Latin inchoātus, variant of incohātus, past participle of incohāre “to begin, start work on,” perhaps equivalent to in- in- 2( def ) + coh(um) “hollow of a yoke into which the pole is fitted” + -ātus -ate 1", "example": "The metaverse is inchoate enough as a concept for just about anyone to seem like they know what they’re doing, regardless of whether they actually do.", "synonym": null}, {"word": "labile", "definitionA": "apt or likely to change:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Liable to slip, err, fall, or apostatize.<br>&nbsp;&nbsp;&nbsp;2. Apt or likely to change.<br>&nbsp;&nbsp;&nbsp;3. (of a compound or bond) Kinetically unstable; rapidly cleaved (and possibly reformed).<br>&nbsp;&nbsp;&nbsp;4. (of a verb) Able to change valency without changing its form; especially, able to be used both transitively and intransitively without changing its form.<br>", "etymology": "First recorded in 1400–50; late Middle English labil “(of the mind) wandering, forgetful,” from Latin lābilis “sliding, slipping, (of verse) smooth-flowing,” equivalent to Latin lāb(ī) “to slip” + -ilis -ile", "example": "“People with a history of trauma and mental illness tend to be emotionally labile,” Kupers added.", "synonym": null}]