[{"word": "startle", "definitionA": "to disturb or agitate suddenly as by surprise or alarm.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sudden motion or shock caused by an unexpected alarm, surprise, or apprehension of danger.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move suddenly, or be excited, on feeling alarm; to start.<br>&nbsp;&nbsp;&nbsp;2. To excite by sudden alarm, surprise, or apprehension; to frighten suddenly and not seriously; to alarm; to surprise.<br>&nbsp;&nbsp;&nbsp;3. To deter; to cause to deviate.<br>", "etymology": "First recorded before 1100; Middle English stertlen “to rush, caper,” equivalent to stert(en) “to begin, start” ( start + -(e)len -le, or continuing Old English steartlian “to kick, struggle”", "example": "Previously, scientists have reported that hexadecanal reduces stress in mice, while other research has shown that humans release the compound in our feces, skin, and breath, and that it might affect our startle response.", "synonym": "affright"}, {"word": "splendiferous", "definitionA": "splendid; magnificent; fine.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Beautiful, splendid<br>", "etymology": "1425–75; late Middle English < Late Latin splendōrifer brightness-bearing ( splendor, -fer, -ous; loss of -or probably by shift of stress, syncope, and dissimilation) + -ous", "example": "What Spoto discreetly omits from his text is that Kelly found herself ensnared in a splendiferous prison.", "synonym": "chichi"}, {"word": "alloy", "definitionA": "a substance composed of two or more metals, or of a metal or metals with a nonmetal, intimately mixed, as by fusion or electrodeposition.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A metal that is a combination of two or more elements, at least one of which is a metal.<br>&nbsp;&nbsp;&nbsp;2. A metal of lesser value, mixed with a metal of greater value.<br>&nbsp;&nbsp;&nbsp;3. An admixture; something added which stains, taints etc.<br>&nbsp;&nbsp;&nbsp;4. Fusion, marriage, combination.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mix or combine; often used of metals.<br>&nbsp;&nbsp;&nbsp;2. To reduce the purity of by mixing with a less valuable substance.<br>&nbsp;&nbsp;&nbsp;3. To impair or debase by mixture.<br>", "etymology": "First recorded in 1590–1600; from Middle French aloi, Old French alei, noun derivative of aleier “to combine,” from Latin alligāre “to bind up,” equivalent to al- “toward” ( al- ) + ligāre “to bind” ( ally, ligament ); replacing earlier allay, Middle English, from Anglo-French allai", "example": "The best elastocaloric materials so far are shape memory alloys.", "synonym": "admixture"}, {"word": "aquifer", "definitionA": "any geological formation containing or conducting groundwater, especially one that supplies the water for wells, springs, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An underground layer of water-bearing porous stone, earth, or gravel<br>", "etymology": "First recorded in 1900–05; probably from French aquifère (adjective); aqui-, -fer", "example": "Farmers, for instance, have been pumping lots of groundwater from aquifers for irrigation.", "synonym": "beginning"}, {"word": "bairn", "definitionA": "a child; son or daughter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A child or baby.<br>", "etymology": "before 900; Middle English bern, barn, Old English bearn; cognate with Gothic, Old Norse, Old High German, Old Saxon, barn, Old Frisian bern, Middle Dutch baren, Albanian me barrë pregnant; akin to Lithuanian bérnas boy, fellow, bear 1", "example": "Woman—Thou beest a sound sleeper—Wake up, and see to thy bairn, and I will gie thee both a good breakfast.", "synonym": "baby"}, {"word": "pyrophoric", "definitionA": "capable of igniting spontaneously in air.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Spontaneously igniting in air, especially when in a finely divided state<br>&nbsp;&nbsp;&nbsp;2. Producing sparks, especially by friction<br>&nbsp;&nbsp;&nbsp;3. (fire investigation) Able to oxidize with exposure to atmospheric oxygen at normal temperatures.<br>", "etymology": "1780–90; < Greek pyrophór ( os ) fire-bearing ( pyro-, -phorous ) + -ic", "example": "The residuum of the distillation is pyrophoric and frequently inflames spontaneously, on exposure to the air.", "synonym": null}, {"word": "cyclical", "definitionA": "cyclic.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Recurring at regular intervals<br>", "etymology": "First recorded in 1810–20; cyclic + -al 1", "example": "Meanwhile, the new Candyman takes care to remind us that the violence that gave birth to its titular killer is cyclical.", "synonym": null}, {"word": "lay", "definitionA": "to put or place in a horizontal position or position of rest; set down:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Arrangement or relationship; layout.<br>&nbsp;&nbsp;&nbsp;2. A share of the profits in a business.<br>&nbsp;&nbsp;&nbsp;3. A lyrical, narrative poem written in octosyllabic couplets that often deals with tales of adventure and romance.<br>&nbsp;&nbsp;&nbsp;4. The direction a rope is twisted.<br>&nbsp;&nbsp;&nbsp;5. A casual sexual partner.<br>&nbsp;&nbsp;&nbsp;6. An act of sexual intercourse.<br>&nbsp;&nbsp;&nbsp;7. A plan; a scheme.<br>&nbsp;&nbsp;&nbsp;8. (uncountable) the laying of eggs.<br>&nbsp;&nbsp;&nbsp;9. A layer.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To place down in a position of rest, or in a horizontal position.<br>&nbsp;&nbsp;&nbsp;2. To cause to subside or abate.<br>&nbsp;&nbsp;&nbsp;3. To prepare (a plan, project etc.); to set out, establish (a law, principle).<br>&nbsp;&nbsp;&nbsp;4. To install certain building materials, laying one thing on top of another.<br>&nbsp;&nbsp;&nbsp;5. To produce and deposit an egg.<br>&nbsp;&nbsp;&nbsp;6. To bet (that something is or is not the case).<br>&nbsp;&nbsp;&nbsp;7. To deposit (a stake) as a wager; to stake; to risk.<br>&nbsp;&nbsp;&nbsp;8. To have sex with.<br>&nbsp;&nbsp;&nbsp;9. To take a position; to come or go.<br>&nbsp;&nbsp;&nbsp;10. To state; to allege.<br>&nbsp;&nbsp;&nbsp;11. To point; to aim.<br>&nbsp;&nbsp;&nbsp;12. (ropemaking) To put the strands of (a rope, a cable, etc.) in their proper places and twist or unite them.<br>&nbsp;&nbsp;&nbsp;13. To place and arrange (pages) for a form upon the imposing stone.<br>&nbsp;&nbsp;&nbsp;14. To place (new type) properly in the cases.<br>&nbsp;&nbsp;&nbsp;15. To apply; to put.<br>&nbsp;&nbsp;&nbsp;16. To impose (a burden, punishment, command, tax, etc.).<br>&nbsp;&nbsp;&nbsp;17. To impute; to charge; to allege.<br>&nbsp;&nbsp;&nbsp;18. To present or offer.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lake.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not belonging to the clergy, but associated with them.<br>&nbsp;&nbsp;&nbsp;2. Non-professional; not being a member of an organized institution.<br>&nbsp;&nbsp;&nbsp;3. Not educated or cultivated; ignorant.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rest in a horizontal position on a surface.<br>&nbsp;&nbsp;&nbsp;2. To be placed or situated.<br>&nbsp;&nbsp;&nbsp;3. To abide; to remain for a longer or shorter time; to be in a certain state or condition.<br>&nbsp;&nbsp;&nbsp;4. Used with in: to be or exist; to belong or pertain; to have an abiding place; to consist.<br>&nbsp;&nbsp;&nbsp;5. Used with with: to have sexual relations with.<br>&nbsp;&nbsp;&nbsp;6. Used with on/upon: to be incumbent (on); to be the responsibility of a person.<br>&nbsp;&nbsp;&nbsp;7. To lodge; to sleep.<br>&nbsp;&nbsp;&nbsp;8. To be still or quiet, like one lying down to rest.<br>&nbsp;&nbsp;&nbsp;9. To be sustainable; to be capable of being maintained.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ballad or sung poem; a short poem or narrative, usually intended to be sung.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A meadow; a lea.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A law.<br>&nbsp;&nbsp;&nbsp;2. An obligation; a vow.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To don or put on (tefillin (phylacteries)).<br>", "etymology": "First recorded before 900; Middle English layen, leggen, Old English lecgan (causative of licgan “to lie”; cognate with Dutch leggen, German legen, Old Norse legja, Gothic lagjan. lie 2", "example": "If the organization were in a better financial position — and hadn’t laid off around 25% of its staff this year — it may have kept Notes alive and maybe tried to rework Send.", "synonym": "ordinary"}, {"word": "laic", "definitionA": "Also laical. lay; secular.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A layperson, as opposed to a member of the clergy.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lay, relating to laypersons, as opposed to clerical.<br>", "etymology": "1555–65; < Late Latin lāicus < Greek lāikós of the people, equivalent to lā ( ós ) people + -ikos -ic", "example": "Touching my peers, it is but necessary to say, that Mistress Martha Trapbois will none of them, whether clerical or laic.", "synonym": null}, {"word": "exfoliate", "definitionA": "to throw off in scales, splinters, etc.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To remove the leaves from a plant.<br>&nbsp;&nbsp;&nbsp;2. To remove a layer of skin, as in cosmetic preparation.<br>&nbsp;&nbsp;&nbsp;3. To split into scales, especially to become converted into scales as the result of heat or decomposition.<br>", "etymology": "First recorded in 1605–15; from Late Latin exfoliātus, past participle of exfoliāre “to strip off leaves”; ex- 1, foliate", "example": "Because it’s easy to over-exfoliate at home, some dermatologists prefer in-office treatments, seeing the latter as a controlled burn compared with a wildfire.", "synonym": "desquamate"}, {"word": "newfangled", "definitionA": "of a new kind or fashion:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually derogatory or humorous) Modern, unfamiliar, or different.<br>", "etymology": "First recorded in 1425–75; late Middle English, equivalent to newefangel “fond of or taken by what is new ”( newe new + -fangel, unattested Old English fangol “inclined to take,” equivalent to fang-, stem of fōn “to take” ( fang 2 ) + -ol adjective suffix) + -ed 3", "example": "After more than five hours, they unanimously agreed to take out a loan and build this newfangled idea called a treetop walk.", "synonym": null}, {"word": "flinch", "definitionA": "to draw back or shrink, as from what is dangerous, difficult, or unpleasant.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A reflexive jerking away.<br>&nbsp;&nbsp;&nbsp;2. The slipping of the foot from a ball, when attempting to give a tight croquet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a sudden, involuntary movement in response to a (usually negative) stimulus; to cringe.<br>&nbsp;&nbsp;&nbsp;2. To dodge (a question), to avoid an unpleasant task or duty<br>&nbsp;&nbsp;&nbsp;3. To let the foot slip from a ball, when attempting to give a tight croquet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To strip the blubber or skin from, as from a whale, seal, etc.<br>", "etymology": "First recorded in 1555–65; perhaps nasalized variant of dial. flitch to flit, shift one's position", "example": "I find it fascinating when friends scoff at a $300 price tag for a mattress that they will spend hundreds of hours sleeping on, but won’t flinch at thousands of dollars for a ski kit that will see dozens of hours of use in a good season.", "synonym": "avoid"}, {"word": "adhibit", "definitionA": "to take or let in; admit.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To allow in; to admit.<br>&nbsp;&nbsp;&nbsp;2. To apply or administer (something, such as a remedy).<br>&nbsp;&nbsp;&nbsp;3. To affix.<br>", "etymology": "1520–30; < Latin adhibitus brought (past participle of adhibēre to bring to), equivalent to ad- ad- + -hibi- (combining form of habēre to hold, have) + -tus past participle suffix", "example": "It is claimed, however, that prisoners on conviction were required to adhibit their mark as a seal of confession.", "synonym": null}, {"word": "jeremiad", "definitionA": "a prolonged lamentation or mournful complaint.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long speech or prose work that bitterly laments the state of society and its morals, and often contains a prophecy of its coming downfall.<br>", "etymology": "1770–80; Jeremi(ah) + -ad 1 in reference to Jeremiah's Lamentations", "example": "He could have easily penned a jeremiad, calling on his readers to reassert old values from which Americans have unfortunately departed.", "synonym": "anger"}, {"word": "monism", "definitionA": "Philosophy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The doctrine of the oneness and unity of reality, despite the appearance of diversity in the world.<br>", "etymology": "First recorded in 1860–65; from German Monismus; mon-, -ism", "example": "I have just been reading your letters again, and beautiful letters they are—also your pregnant little paper on Monism.", "synonym": null}, {"word": "dualism", "definitionA": "the state of being dual or consisting of two parts; division into two.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Duality; the condition of being double.<br>&nbsp;&nbsp;&nbsp;2. The view that the world consists of, or is explicable in terms of, two fundamental principles, such as mind and matter or good and evil.<br>&nbsp;&nbsp;&nbsp;3. The belief that the world is ruled by a pair of antagonistic forces, such as good and evil; the belief that man has two basic natures, the physical and the spiritual.<br>&nbsp;&nbsp;&nbsp;4. The theory, originated by Lavoisier and developed by Berzelius, that all definite compounds are binary in their nature, and consist of two distinct constituents, themselves simple or complex, and having opposite chemical or electrical affinities.<br>", "etymology": "First recorded in 1785–95; dual + -ism", "example": "Dualism is a philosophical view that draws a distinction between the mind and the body.", "synonym": "polarity"}, {"word": "pluralism", "definitionA": "Philosophy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality or state of being plural, or in the plural number.<br>&nbsp;&nbsp;&nbsp;2. The state of a pluralist; the holding of more than one ecclesiastical living at a time.<br>&nbsp;&nbsp;&nbsp;3. A social system that permits smaller groups within a society to maintain their individual cultural identities.<br>&nbsp;&nbsp;&nbsp;4. The belief that there should be diverse and competing centers of power in society.<br>&nbsp;&nbsp;&nbsp;5. The acknowledgement of a diversity of political systems.<br>&nbsp;&nbsp;&nbsp;6. The existence of differing legal systems in a population or area.<br>&nbsp;&nbsp;&nbsp;7. The belief that values can be simultaneously antagonistic and incommensurable.<br>", "etymology": "First recorded in 1810–20; plural + -ism", "example": "It is meant to suggest a kind of pluralism in the chambers of power in Moscow, with rival camps of liberals and hawks, oligarchs and generals, pulling the President toward fringe positions, which his decisions balance out.", "synonym": "diversity"}, {"word": "attenuate", "definitionA": "to weaken or reduce in force, intensity, effect, quantity, or value:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To reduce in size, force, value, amount, or degree.<br>&nbsp;&nbsp;&nbsp;2. To make thinner, as by physically reshaping, starving, or decaying.<br>&nbsp;&nbsp;&nbsp;3. To become thin or fine; to grow less.<br>&nbsp;&nbsp;&nbsp;4. To weaken.<br>&nbsp;&nbsp;&nbsp;5. To rarefy.<br>&nbsp;&nbsp;&nbsp;6. To reduce the virulence of a bacterium or virus.<br>&nbsp;&nbsp;&nbsp;7. To reduce the amplitude of an electrical, radio, or optical signal.<br>&nbsp;&nbsp;&nbsp;8. (of a beer) To become less dense as a result of the conversion of sugar to alcohol.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of leaves) Gradually tapering into a petiole-like extension toward the base.<br>", "etymology": "First recorded in 1520–30; from Latin attenuātus (past participle of attenuāre “to make thin, reduce”); at-, tenuis, -ate 1", "example": "RNA vaccines were developed as an alternative to the standard method of vaccination using attenuated or inactivated microorganisms.", "synonym": "abate"}, {"word": "maelstrom", "definitionA": "a large, powerful, or violent whirlpool.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large and violent whirlpool.<br>&nbsp;&nbsp;&nbsp;2. Any violent or turbulent situation.<br>", "etymology": "1550–60  maelstrom fordef 3; < early Dutch maelstroom, now spelling maalstroom, representing mal ( en ) to grind + stroom stream. See meal 2, stream", "example": "They suspected that one particular geometric trait might allow electrons to swirl into exotic maelstroms that behave in an entirely novel manner.", "synonym": "bedlam"}, {"word": "nidificate", "definitionA": "to build a nest.", "definitionB": "No definition found", "etymology": "1810–20; < Latin nīdificātus (past participle of nīdificāre to build a nest); nidify, -ate 1", "example": "Fly-catchers usually nidificate in the neighbourhood of water, because that element favours the existence of their insect food.", "synonym": null}, {"word": "squeegee", "definitionA": "an implement edged with rubber or the like, for removing water from windows after washing, sweeping water from wet decks, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tool consisting of a rubber or similar blade attached at a right angle to a handle, particularly<br>&nbsp;&nbsp;&nbsp;2. A roller used to similar effect, particularly<br>&nbsp;&nbsp;&nbsp;3. A person who uses a squeegee, especially one who \"cleans\" the windshield of a car stopped at a traffic light and then demands payment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a squeegee.<br>", "etymology": "First recorded in 1835–45; originally a nautical term; of obscure origin", "example": "So whenever it rained, we had to pull over every two miles and take a squeegee to it.", "synonym": "swab"}, {"word": "languish", "definitionA": "to be or become weak or feeble; droop; fade:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To lose strength and become weak; to be in a state of weakness or sickness.<br>&nbsp;&nbsp;&nbsp;2. To pine away in longing for something; to have low spirits, especially from lovesickness.<br>&nbsp;&nbsp;&nbsp;3. To live in miserable or disheartening conditions.<br>&nbsp;&nbsp;&nbsp;4. To be neglected; to make little progress, be unsuccessful.<br>&nbsp;&nbsp;&nbsp;5. To make weak; to weaken, devastate.<br>&nbsp;&nbsp;&nbsp;6. To affect a languid air, especially disingenuously.<br>", "etymology": "First recorded in 1250–1300; Middle English, from Middle French languiss-, long stem of languir, from Latin languēre “to languish”; akin to laxus lax; -ish 2", "example": "Other journalists and opposition activists languish in prison on similar charges.", "synonym": "brood"}, {"word": "wanton", "definitionA": "done, shown, used, etc., maliciously or unjustifiably:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pampered or coddled person.<br>&nbsp;&nbsp;&nbsp;2. An overly playful person; a trifler.<br>&nbsp;&nbsp;&nbsp;3. A self-indulgent person, fond of excess.<br>&nbsp;&nbsp;&nbsp;4. A lewd or immoral person, especially a prostitute.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rove and ramble without restraint, rule, or limit; to revel; to play loosely; to frolic.<br>&nbsp;&nbsp;&nbsp;2. To waste or squander, especially in pleasure (most often with away).<br>&nbsp;&nbsp;&nbsp;3. To act wantonly; to be lewd or lascivious.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Undisciplined, unruly; not able to be controlled.<br>&nbsp;&nbsp;&nbsp;2. Playful, sportive; merry or carefree.<br>&nbsp;&nbsp;&nbsp;3. Lewd, immoral; sexually open, unchaste.<br>&nbsp;&nbsp;&nbsp;4. Capricious, reckless of morality, justice etc.; acting without regard for the law or the well-being of others; gratuitous.<br>&nbsp;&nbsp;&nbsp;5. Extravagant, unrestrained, excessive.<br>", "etymology": "First recorded in 1250–1300; Middle English wantowen, literally, “undisciplined, ill-reared,” Old English wan- “not” + togen, past participle of tēon “to discipline, rear,” cognate with German ziehen, Latin dūcere “to lead”; akin to tow 1", "example": "Even in liberal havens like California, many considered what they viewed as an unacceptable surge in public disorder—wanton homeless camps, smash-and-grab burglaries, needles on sidewalks—and voted accordingly.", "synonym": "abandoned"}, {"word": "abode", "definitionA": "a place in which a person resides; residence; dwelling; habitation; home.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To endure without yielding; to withstand; await defiantly; to encounter; to persevere.<br>&nbsp;&nbsp;&nbsp;2. To bear patiently; to tolerate; to put up with; stand.<br>&nbsp;&nbsp;&nbsp;3. To pay for; to stand the consequences of; to answer for; to suffer for; to atone for.<br>&nbsp;&nbsp;&nbsp;4. To wait in expectation.<br>&nbsp;&nbsp;&nbsp;5. To pause; to delay.<br>&nbsp;&nbsp;&nbsp;6. To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left.<br>&nbsp;&nbsp;&nbsp;7. To have one's abode; to dwell; to reside; to sojourn.<br>&nbsp;&nbsp;&nbsp;8. To endure; to remain; to last.<br>&nbsp;&nbsp;&nbsp;9. To stand ready for; to await for someone; watch for.<br>&nbsp;&nbsp;&nbsp;10. To endure or undergo a hard trial or a task; to stand up under.<br>&nbsp;&nbsp;&nbsp;11. To await submissively; accept without question; submit to.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Act of waiting; delay.<br>&nbsp;&nbsp;&nbsp;2. Stay or continuance in a place; sojourn.<br>&nbsp;&nbsp;&nbsp;3. A residence, dwelling or habitation.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An omen; a foretelling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bode; to foreshow; to presage.<br>&nbsp;&nbsp;&nbsp;2. To be ominous.<br>", "etymology": "1200–50; Middle English abood a waiting, delay, stay; akin to abide", "example": "When it comes to feeling proud of your abode and peaceful at home, a well-manicured yard can make all the difference.", "synonym": "address"}, {"word": "ricochet", "definitionA": "the motion of an object or a projectile in rebounding or deflecting from a surface one or more times as a result of a glancing blow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A method of firing a projectile so that it skips along a surface.<br>&nbsp;&nbsp;&nbsp;2. An instance of ricocheting; a glancing rebound.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rebound off something wildly in a seemingly random direction.<br>&nbsp;&nbsp;&nbsp;2. To operate upon by ricochet firing.<br>", "etymology": "First recorded in 1760–70; from French; further origin uncertain", "example": "Ezra Klein also makes a compelling case that such ricochet legislating would be tamped down by voters holding both sides accountable for what they pass — or repeal.", "synonym": "backfire"}]