[{"word": "epiphany", "definitionA": "(initial capital letter) a Christian festival, observed on January 6, commemorating the manifestation of Christ to the gentiles in the persons of the Magi; Twelfth-day.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The appearance of Jesus Christ to the Magi on the twelfth day after Christmas.<br>&nbsp;&nbsp;&nbsp;2. An annual Christian feast celebrating this event.<br>&nbsp;&nbsp;&nbsp;3. The day of the celebration, January 6th, or sometimes (in Western Christianity), the Sunday between January 2nd and 8th.<br>&nbsp;&nbsp;&nbsp;4. The season or time of the Christian church year either from the Epiphany feast day to Shrove Tuesday (the day before Ash Wednesday, the start of Lent) or from the Epiphany feast day to the feast of the Presentation of Christ in the Temple.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An illuminating realization or discovery, often resulting in a personal feeling of elation, awe, or wonder.<br>&nbsp;&nbsp;&nbsp;2. A manifestation or appearance of a divine or superhuman being.<br>", "etymology": "First recorded in 1275–1325; Middle English epiphanie, from Late Latin epiphanīa, from Late Greek epipháneia, from Greek: “apparition,” equivalent to epi- epi- ( def ) + phan- (stem of phaínein “to appear”) + -eia -y 3( def )", "example": "I had an epiphany, realizing she was the most gorgeously attractive girl my 17-year-old self had ever encountered.", "synonym": "oracle"}, {"word": "abstergent", "definitionA": "cleansing.", "definitionB": "No definition found", "etymology": "1605–15; < Latin abstergent-, stem of abstergēns, present participle of abstergēre to wipe off, equivalent to abs- abs- + tergēre to wipe; -ent", "example": "A substance used in cleansing; a detergent; as, soap is an abstergent.", "synonym": "abrasive"}, {"word": "deterge", "definitionA": "to wipe or wash away; cleanse.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To clean of undesirable material, especially a wound (technical).<br>", "etymology": "First recorded in 1615–25; from French déterger, from Latin dētergēre “to wipe off,” equivalent to dē- prefix indicating removal + tergēre “to wipe”; de-", "example": "The deterging, cleansing Gargarisin referred to § 112, is a light Infusion of the Tops of Sage, adding two Ounces of Honey to each Pint of it.", "synonym": "bath"}, {"word": "custodian", "definitionA": "a person who has custody; keeper; guardian.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person entrusted with the custody or care of something or someone; a caretaker or keeper.<br>&nbsp;&nbsp;&nbsp;2. A janitor; a cleaner<br>", "etymology": "1775–85; < Latin custōdi ( a ) watchman ( custody ) + -an", "example": "\"The club is always bigger than me, I am a custodian and so far I have handled it pretty well.\"", "synonym": "bodyguard"}, {"word": "abridge", "definitionA": "to shorten by omissions while retaining the basic contents:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deprive; to cut off.<br>&nbsp;&nbsp;&nbsp;2. To debar from.<br>&nbsp;&nbsp;&nbsp;3. To make shorter; to shorten in duration or extent.<br>&nbsp;&nbsp;&nbsp;4. To shorten or contract by using fewer words, yet retaining the sense; to epitomize; to condense.<br>&nbsp;&nbsp;&nbsp;5. Cut short; truncate.<br>&nbsp;&nbsp;&nbsp;6. To curtail.<br>", "etymology": "First recorded in 1350–1400; Middle English abreggen, abriggen, from Middle French abreg(i)er, from Late Latin abbreviāre “to shorten”; a- 4, abbreviate", "example": "There are abridged biographies of certain people throughout the book.", "synonym": "abstract"}, {"word": "consuetude", "definitionA": "custom, especially as having legal force.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Custom, familiarity.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Old French consuetude, a learned borrowing or Latinism from Latin consuētūd(o), “custom, habit, usage, social intercourse, illicit affair,” equivalent to con- con- + suē- (root of suēscere “to accustom, become accustomed,” akin to suus “one's own”) + -tūdō -tude", "example": "It is right that we should look before we leap, but it is gross misconduct to neglect duty to conform to the consuetudes of the hour.", "synonym": "familiarity"}, {"word": "primordial", "definitionA": "constituting a beginning; giving origin to something derived or developed; original; elementary:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A first principle or element.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. First, earliest or original<br>&nbsp;&nbsp;&nbsp;2. Characteristic of the earliest stage of the development of an organism, or relating to a primordium<br>&nbsp;&nbsp;&nbsp;3. Primeval<br>", "etymology": "1350–1400; Middle English < Late Latin prīmōrdiālis of the beginning. See primordium, -al 1", "example": "Throughout the decades, numerous observations of how dust, gas, and ripples in the cosmic microwave background, or the leftover radiation from the primordial plasma of the universe, moved indicated that dark matter exists.", "synonym": null}, {"word": "desolate", "definitionA": "barren or laid waste; devastated:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deprive of inhabitants.<br>&nbsp;&nbsp;&nbsp;2. To devastate or lay waste somewhere.<br>&nbsp;&nbsp;&nbsp;3. To abandon or forsake something.<br>&nbsp;&nbsp;&nbsp;4. To make someone sad, forlorn and hopeless.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Deserted and devoid of inhabitants.<br>&nbsp;&nbsp;&nbsp;2. Barren and lifeless.<br>&nbsp;&nbsp;&nbsp;3. Made unfit for habitation or use because of neglect, destruction etc.<br>&nbsp;&nbsp;&nbsp;4. Dismal or dreary.<br>&nbsp;&nbsp;&nbsp;5. Sad, forlorn and hopeless.<br>", "etymology": "First recorded in 1325–75; Middle English, from Latin dēsōlātus “forsaken,” past participle of dēsōlāre, from dē- de- + sōlāre “to make lonely” (derivative of sōlus sole 1 )", "example": "Its editorial team said John O' Groats was \"notorious for being so desolate\" and described it as a \"bleak outpost\".", "synonym": "abandoned"}, {"word": "cozen", "definitionA": "to cheat, deceive, or trick.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To become cozy; (by extension) to become acquainted, comfortable, or familiar with.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cheat; to defraud; to deceive, usually by small arts, or in a pitiful way.<br>", "etymology": "1565–75; perhaps < Old North French coçonner to resell, verbal derivative of coçon retailer (< Latin coctiōnem, accusative of coctiō, cōciō dealer), influenced by Middle French cousin dupe, literally, cousin", "example": "The point, however, is not to entertain the driver/employee but to cozen the owner.", "synonym": "bamboozle"}, {"word": "dichotomy", "definitionA": "division into two parts, kinds, etc.; subdivision into halves or pairs.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A separation or division into two; a distinction that results in such a division.<br>&nbsp;&nbsp;&nbsp;2. Such a division involving apparently incompatible or opposite principles; a duality.<br>&nbsp;&nbsp;&nbsp;3. The division of a class into two disjoint subclasses that are together comprehensive, as the division of man into white and not white.<br>&nbsp;&nbsp;&nbsp;4. The division of a genus into two species; a division into two subordinate parts.<br>&nbsp;&nbsp;&nbsp;5. A phase of the moon when it appears half lit and half dark, as at the quadratures.<br>&nbsp;&nbsp;&nbsp;6. Division and subdivision; bifurcation, as of a stem of a plant or a vein of the body into two parts as it proceeds from its origin; often successive.<br>", "etymology": "First recorded in 1580–90; from Late Latin dichotomia, from Greek dichotomía “dividing in two (of the quarters of the moon), point of a bisection, division into two parts”; dicho-, -tomy", "example": "Journalist Theodore H. White perhaps best captured this dichotomy between Carter's accomplishments and his image in the book, \"America in Search of Itself: The Making of the President, 1956-1980.\"", "synonym": "difference"}, {"word": "retardant", "definitionA": "any substance capable of reducing the speed of a given reaction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (often in combination) Something that serves to retard (slow down) the action of something<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (often in combination) Serving to retard (slow down) the action of something<br>", "etymology": "First recorded in 1635–45; retard + -ant", "example": "Firefighting helicopters and airplanes dropped water and fire retardant on fire lines not far from the 405 Freeway in an attempt to prevent flames from engulfing more neighborhoods.", "synonym": null}]