[{"word": "aptitude", "definitionA": "capability; ability; innate or acquired capacity for something; talent:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Natural ability to acquire knowledge or skill.<br>&nbsp;&nbsp;&nbsp;2. The condition of being suitable.<br>", "etymology": "First recorded in 1400–50; from Late Latin aptitūdō; apt, -i-, -tude", "example": "She agrees that specialisation is less important than aptitude in the space sector.", "synonym": "bent"}, {"word": "squashy", "definitionA": "easily squashed; squash; pulpy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Easily squashed when pressed.<br>&nbsp;&nbsp;&nbsp;2. Resembling a bog or marsh underfoot.<br>", "etymology": "First recorded in 1690–1700; squash 1 + -y 1", "example": null, "synonym": null}, {"word": "canard ", "definitionA": "a false or baseless, usually derogatory story, report, or rumor.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A false or misleading report or story, especially if deliberately so.<br>&nbsp;&nbsp;&nbsp;2. A type of aircraft in which the primary horizontal control and stabilization surfaces are in front of the main wing.<br>&nbsp;&nbsp;&nbsp;3. Any small winglike structure on a vehicle, usually used for stabilization.<br>", "etymology": "irst recorded in 1840–45; from French: literally, “duck,” from Old French quanart “drake,” originally “cackler,” equivalent to can(er) “to cackle” (of expressive origin) + -art -art, as in mallart “drake”; mallard", "example": null, "synonym": "exaggeration"}, {"word": "zealous", "definitionA": "full of, characterized by, or due to zeal; ardently active, devoted, or diligent.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Full of zeal; ardent, fervent; exhibiting enthusiasm or strong passion.<br>", "etymology": "First recorded in 1520–30; from Medieval Latin zēlōsus; zeal, -ous", "example": "Bondi demanded from federal prosecutors \"zealous advocacy\" of Trump's agenda and threatened that dissent would not be tolerated:", "synonym": null}, {"word": "crutch", "definitionA": "a staff or support to assist a lame or infirm person in walking, now usually with a crosspiece at one end to fit under the armpit.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device to assist in motion as a cane, especially one that provides support under the arm to reduce weight on a leg.<br>&nbsp;&nbsp;&nbsp;2. Something that supports, often used negatively to indicate that it is not needed and causes an unhealthful dependency; a prop<br>&nbsp;&nbsp;&nbsp;3. A crotch; the area of body where the legs fork from the trunk.<br>&nbsp;&nbsp;&nbsp;4. A form of pommel for a woman's saddle, consisting of a forked rest to hold the leg of the rider.<br>&nbsp;&nbsp;&nbsp;5. A knee, or piece of knee timber.<br>&nbsp;&nbsp;&nbsp;6. A forked stanchion or post; a crotch.<br>&nbsp;&nbsp;&nbsp;7. A type of cross formed from two C-shapes joined back to back.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To support on crutches; to prop up.<br>&nbsp;&nbsp;&nbsp;2. To move on crutches.<br>&nbsp;&nbsp;&nbsp;3. To shear the hindquarters of a sheep; to dag.<br>&nbsp;&nbsp;&nbsp;4. To stir with a crutch (in soap making)<br>", "etymology": "before 900; Middle English crucche, Old English cryce (oblique crycce ); cognate with Norwegian krykkja, Danish krykke, German Krücke, Dutch kruk. See crook 1", "example": null, "synonym": "aid"}, {"word": "simile", "definitionA": "a figure of speech in which two unlike things are explicitly compared, as in “she is like a rose.” Compare metaphor.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A figure of speech in which one thing is compared to another, in the case of English generally using like or as.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin: “image, likeness, comparison,” noun use of neuter of similis similar", "example": null, "synonym": "analogy"}, {"word": "metaphor ", "definitionA": "a figure of speech in which a term or phrase is applied to something to which it is not literally applicable in order to suggest a resemblance, as in “A mighty fortress is our God.” Compare mixed metaphor, simile ( def 1 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The use of a word or phrase to refer to something that it is not, invoking a direct similarity between the word or phrase used and the thing described (but in the case of English without the words like or as, since use of those words would imply a simile); the word or phrase used in this way; an implied comparison.<br>&nbsp;&nbsp;&nbsp;2. The use of an everyday object or concept to represent an underlying facet of the computer and thus aid users in performing tasks.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a metaphor.<br>&nbsp;&nbsp;&nbsp;2. To describe by means of a metaphor.<br>", "etymology": "irst recorded in 1525–35; from Latin metaphora, from Greek metaphorá “a transfer,” akin to metaphérein “to transfer”; meta-, -phore", "example": null, "synonym": "allegory"}, {"word": "coop", "definitionA": "an enclosure, cage, or pen, usually with bars or wires, in which fowls or other small animals are confined for fattening, transportation, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A basket, pen or enclosure for birds or small animals.<br>&nbsp;&nbsp;&nbsp;2. A wickerwork basket (kipe) or other enclosure for catching fish.<br>&nbsp;&nbsp;&nbsp;3. A narrow place of confinement, a cage; a jail, a prison.<br>&nbsp;&nbsp;&nbsp;4. A barrel or cask for holding liquids.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To keep in a coop.<br>&nbsp;&nbsp;&nbsp;2. To shut up or confine in a narrow space; to cramp.<br>&nbsp;&nbsp;&nbsp;3. To unlawfully confine one or more voters to prevent them from casting their ballots in an election.<br>&nbsp;&nbsp;&nbsp;4. (law enforcement) Of a police officer: to sleep or relax while on duty.<br>&nbsp;&nbsp;&nbsp;5. To make or repair barrels, casks and other wooden vessels; to work upon in the manner of a cooper.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cart with sides and ends made from boards, enabling it to carry manure, etc.<br>&nbsp;&nbsp;&nbsp;2. A cart which opens at the back to release its load; a tumbril.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small heap.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A unit of a housing co-operative; a purchased apartment where the apartment owners collectively are responsible for maintenance of common areas and upkeep.<br>&nbsp;&nbsp;&nbsp;2. Any co-operative, including housing, retail, utility, agricultural, banking or worker cooperatives.<br>&nbsp;&nbsp;&nbsp;3. Any shop owned by a co-operative.<br>&nbsp;&nbsp;&nbsp;4. A co-operative game, as opposed to a competitive game or deathmatch.<br>", "etymology": "First recorded in 1250–1300; Middle English coupe “basket,” perhaps from Scandinavian or ultimately from Latin cūpa “cask, tub” ( cup ( def ) ); cognate with Norwegian kaup “wooden can,” Old English cȳpa “basket”", "example": null, "synonym": "birdcage"}, {"word": "plutocracy", "definitionA": "the rule or power of wealth or of the wealthy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Government by the wealthy.<br>&nbsp;&nbsp;&nbsp;2. A controlling class of the wealthy.<br>", "etymology": "1645–55; < Greek ploutokratía, equivalent to ploûto ( s ) wealth + -kratia -cracy", "example": "They want to return the United States to the Gilded Age — if not before — as they transform the country into a new apartheid Christofascist plutocracy.", "synonym": null}, {"word": "bawl", "definitionA": "to cry or wail lustily.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A loud, intense shouting or wailing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shout or utter in a loud and intense manner.<br>&nbsp;&nbsp;&nbsp;2. To wail; to give out a blaring cry.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Medieval Latin baulāre “to bark,” from Germanic; compare Old Norse baula “to low,” baula “cow,” perhaps a conflation of belja ( bell 2 ) with an unrecorded old root bhu-", "example": null, "synonym": "bark"}, {"word": "crib", "definitionA": "a child's bed with enclosed sides.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A baby’s bed with high, often slatted, often moveable sides, suitable for a child who has outgrown a cradle or bassinet.<br>&nbsp;&nbsp;&nbsp;2. A bed for a child older than a baby.<br>&nbsp;&nbsp;&nbsp;3. A small sleeping berth in a packet ship or other small vessel<br>&nbsp;&nbsp;&nbsp;4. A wicker basket; compare Moses basket.<br>&nbsp;&nbsp;&nbsp;5. A manger, a feeding trough for animals elevated off the earth or floor, especially one for fodder such as hay.<br>&nbsp;&nbsp;&nbsp;6. The baby Jesus and the manger in a creche or nativity scene, consisting of statues of Mary, Joseph and various other characters such as the magi.<br>&nbsp;&nbsp;&nbsp;7. A bin for drying or storing grain, as with a corn crib.<br>&nbsp;&nbsp;&nbsp;8. A small room or covered structure, especially one of rough construction, used for storage or penning animals.<br>&nbsp;&nbsp;&nbsp;9. A confined space, as with a cage or office-cubicle<br>&nbsp;&nbsp;&nbsp;10. A job, a position; (British), an appointment.<br>&nbsp;&nbsp;&nbsp;11. A hovel, a roughly constructed building best suited to the shelter of animals but used for human habitation.<br>&nbsp;&nbsp;&nbsp;12. One’s residence, or where one normally hangs out. A house or dwelling place.<br>&nbsp;&nbsp;&nbsp;13. A boxy structure traditionally built of heavy wooden timbers, to support an existing structure from below, as with a mineshaft or a building being raised off its foundation in preparation for being moved; see cribbing.<br>&nbsp;&nbsp;&nbsp;14. (usually in the plural) A collection of quotes or references for use in speaking, for assembling a written document, or as an aid to a project of some sort; a crib sheet.<br>&nbsp;&nbsp;&nbsp;15. A minor theft, extortion or embezzlement, with or without criminal intent.<br>&nbsp;&nbsp;&nbsp;16. The card game cribbage.<br>&nbsp;&nbsp;&nbsp;17. The cards discarded by players and used by the dealer.<br>&nbsp;&nbsp;&nbsp;18. A known piece of information corresponding to a section of encrypted text, that is then used to work out the remaining sections.<br>&nbsp;&nbsp;&nbsp;19. A small holiday home, often near a beach and of simple construction.<br>&nbsp;&nbsp;&nbsp;20. A packed lunch taken to work.<br>&nbsp;&nbsp;&nbsp;21. A small raft made of timber.<br>&nbsp;&nbsp;&nbsp;22. (thieves' cant) The stomach.<br>&nbsp;&nbsp;&nbsp;23. A cheat sheet or past test used by students; crib sheet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To place or confine in a crib.<br>&nbsp;&nbsp;&nbsp;2. To shut up or confine in a narrow habitation; to cage; to cramp.<br>&nbsp;&nbsp;&nbsp;3. To collect one or more passages and/or references for use in a speech, written document or as an aid for some task; to create a crib sheet.<br>&nbsp;&nbsp;&nbsp;4. To plagiarize; to copy; to cheat.<br>&nbsp;&nbsp;&nbsp;5. To install timber supports, as with cribbing.<br>&nbsp;&nbsp;&nbsp;6. To steal or embezzle, to cheat out of.<br>&nbsp;&nbsp;&nbsp;7. (Indian English) To complain, to grumble<br>&nbsp;&nbsp;&nbsp;8. To crowd together, or to be confined, as if in a crib or in narrow accommodations.<br>&nbsp;&nbsp;&nbsp;9. (of a horse) To seize the manger or other solid object with the teeth and draw in wind.<br>", "etymology": "before 1000; Middle English cribbe, Old English crib ( b ); cognate with Dutch krib, German Krippe; crèche", "example": null, "synonym": "bassinet"}, {"word": "spoonerism ", "definitionA": "the transposition of initial or other sounds of words, usually by accident, as in a blushing crow for a crushing blow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A play on words on a phrase in which the initial (usually consonantal) sounds of two or more of the main words are transposed.<br>", "etymology": "irst recorded in 1895–1900; after W. A. Spooner (1844–1930), English clergyman noted for such slips; -ism", "example": null, "synonym": null}, {"word": "malapropism ", "definitionA": "an act or habit of misusing words ridiculously, especially by the confusion of words that are similar in sound.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The blundering use of an absurdly inappropriate word or expression in place of a similar-sounding one.<br>&nbsp;&nbsp;&nbsp;2. An instance of this; malaprop.<br>", "etymology": "irst recorded in 1840–50; Malaprop + -ism", "example": null, "synonym": "catachresis"}, {"word": "finesse", "definitionA": "extreme delicacy or subtlety in action, performance, skill, discrimination, taste, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Skill in the handling or manipulation of a situation.<br>&nbsp;&nbsp;&nbsp;2. The property of having elegance, grace, refinement, or skill.<br>&nbsp;&nbsp;&nbsp;3. An adroit manoeuvre.<br>&nbsp;&nbsp;&nbsp;4. In bridge, whist, etc.: a technique which allows one to win a trick, usually by playing a card when it is thought that a card that can beat it is held by another player whose turn is over.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To evade (a problem, situation, etc.) by using some clever argument or strategem.<br>&nbsp;&nbsp;&nbsp;2. To play (a card) as a finesse.<br>&nbsp;&nbsp;&nbsp;3. To handle or manage carefully or skilfully; to manipulate in a crafty way.<br>&nbsp;&nbsp;&nbsp;4. To attempt to win a trick by finessing.<br>&nbsp;&nbsp;&nbsp;5. To play a ball out of the way of an opponent.<br>", "etymology": "First recorded in 1400–50; late Middle English: “degree of excellence or purity,” from Middle French, from fin fine 1 + -esse -ice", "example": null, "synonym": "adeptness"}]