[{"word": "gruff", "definitionA": "low and harsh; hoarse:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak gruffly.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a rough, surly, and harsh demeanor and nature.<br>&nbsp;&nbsp;&nbsp;2. Hoarse-voiced.<br>", "etymology": "First recorded in 1525–35; from Middle Dutch grof “coarse”; cognate with German grob", "example": null, "synonym": null}, {"word": "decorum", "definitionA": "dignified propriety of behavior, speech, dress, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Appropriate social behavior.<br>&nbsp;&nbsp;&nbsp;2. A convention of social behavior.<br>", "etymology": "First recorded in 1560–70; from Latin decōrum, noun use of neuter of decōrus decorous", "example": null, "synonym": "breeding"}, {"word": "relish", "definitionA": "liking or enjoyment of the taste of something.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pleasant taste<br>&nbsp;&nbsp;&nbsp;2. Enjoyment; pleasure.<br>&nbsp;&nbsp;&nbsp;3. A quality or characteristic tinge.<br>&nbsp;&nbsp;&nbsp;4. (followed by \"for\") A taste (for); liking (of); fondness.<br>&nbsp;&nbsp;&nbsp;5. A cooked or pickled sauce, usually made with vegetables or fruits, generally used as a condiment.<br>&nbsp;&nbsp;&nbsp;6. In a wooden frame, the projection or shoulder at the side of, or around, a tenon, on a tenoned piece.<br>&nbsp;&nbsp;&nbsp;7. Something that is greatly liked or savoured.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To taste or eat with pleasure, to like the flavor of<br>&nbsp;&nbsp;&nbsp;2. To take great pleasure in.<br>&nbsp;&nbsp;&nbsp;3. To taste; to have a specified taste or flavour.<br>&nbsp;&nbsp;&nbsp;4. To give a taste to; to cause to taste nice, to make appetizing.<br>&nbsp;&nbsp;&nbsp;5. To give pleasure.<br>", "etymology": "First recorded in 1520–30; alteration of Middle English reles “aftertaste, scent,” from Old French, variant of relais “remainder, that left behind”; release", "example": null, "synonym": "appetite"}, {"word": "alacrity", "definitionA": "cheerful readiness, promptness, or willingness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Eagerness; liveliness; enthusiasm.<br>&nbsp;&nbsp;&nbsp;2. Promptness; speed.<br>", "etymology": "First recorded in 1500–10; from Latin alacritāt-, stem of alacritās “enthusiasm, zeal,” equivalent to alacer + -tās- noun suffix ( -ty 2 )", "example": null, "synonym": "avidity"}, {"word": "mull", "definitionA": "to study or ruminate; ponder.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin, soft muslin.<br>&nbsp;&nbsp;&nbsp;2. Marijuana that has been chopped to prepare it for smoking.<br>&nbsp;&nbsp;&nbsp;3. A stew of meat, broth, milk, butter, vegetables, and seasonings, thickened with soda crackers.<br>&nbsp;&nbsp;&nbsp;4. The gauze used in bookbinding to adhere a text block to a book's cover.<br>&nbsp;&nbsp;&nbsp;5. An inferior kind of madder prepared from the smaller roots or the peelings and refuse of the larger.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually with over) To work (over) mentally; to cogitate; to ruminate.<br>&nbsp;&nbsp;&nbsp;2. To powder; to pulverize.<br>&nbsp;&nbsp;&nbsp;3. To chop marijuana so that it becomes a smokable form.<br>&nbsp;&nbsp;&nbsp;4. To heat and spice something, such as wine.<br>&nbsp;&nbsp;&nbsp;5. To join two or more individual windows at mullions.<br>&nbsp;&nbsp;&nbsp;6. To dull or stupefy.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A promontory.<br>&nbsp;&nbsp;&nbsp;2. A snuffbox made of the small end of a horn.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Dirt; rubbish<br>", "etymology": "First recorded in 1815–25; perhaps identical with mull “to crumble, pulverize”; mull 4", "example": null, "synonym": "chaw"}, {"word": "crip", "definitionA": "A cripple.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cripple.<br>&nbsp;&nbsp;&nbsp;2. (rehabilitation, generally self-referential) A person with a disability.<br>", "etymology": "An Americanism dating back to 1915–20; shortening of cripple", "example": null, "synonym": null}, {"word": "scourge", "definitionA": "a whip or lash, especially for the infliction of punishment or torture.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A source of persistent trouble such as pestilence that causes pain and suffering or widespread destruction.<br>&nbsp;&nbsp;&nbsp;2. A means to inflict such pain or destruction.<br>&nbsp;&nbsp;&nbsp;3. A whip, often of leather.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To strike with a scourge; to flog.<br>", "etymology": "1175–1225; (noun) Middle English < Anglo-French escorge, derivative of escorgier to whip < Vulgar Latin *excorrigiāre, derivative of Latin corrigia thong, whip ( ex- 1 ); (v.) Middle English < Old French escorgier", "example": null, "synonym": "affliction"}, {"word": "letch", "definitionA": "a lecherous desire or craving.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Strong desire; passion.<br>&nbsp;&nbsp;&nbsp;2. A lecher.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stream or pool in boggy land.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quantity of wood ashes, through which water passes, and thus imbibes the alkali.<br>&nbsp;&nbsp;&nbsp;2. A tub or vat for leaching ashes, bark, etc.<br>&nbsp;&nbsp;&nbsp;3. A jelly-like sweetmeat popular in the fifteenth century.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To purge a soluble matter out of something by the action of a percolating fluid.<br>&nbsp;&nbsp;&nbsp;2. To part with soluble constituents by percolation.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An aquatic blood-sucking annelid of class Hirudinea, especially Hirudo medicinalis.<br>&nbsp;&nbsp;&nbsp;2. A person who derives profit from others in a parasitic fashion.<br>&nbsp;&nbsp;&nbsp;3. A glass tube designed for drawing blood from damaged tissue by means of a vacuum.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A physician.<br>&nbsp;&nbsp;&nbsp;2. (Heathenry) A healer.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The vertical edge of a square sail.<br>&nbsp;&nbsp;&nbsp;2. The aft edge of a triangular sail.<br>", "etymology": "First recorded in 1790–1800; probably back formation from lecher", "example": null, "synonym": null}, {"word": "exasperate", "definitionA": "to irritate or provoke to a high degree; annoy extremely:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tax the patience of, irk, frustrate, vex, provoke, annoy; to make angry.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Exasperated; embittered.<br>", "etymology": "First recorded in 1525–35; from Latin exasperātus (past participle of exasperāre “to make rough, provoke”), equivalent to ex- ex- 1 + asper “harsh, rough” + -ātus -ate 1", "example": null, "synonym": "aggravate"}, {"word": "ambergris", "definitionA": "an opaque, ash-colored secretion of the sperm whale intestine, usually found floating on the ocean or cast ashore: used in perfumery.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A solid, waxy, flammable substance of a dull grey or blackish color, produced in the intestines of the sperm whale. It is used in perfumes.<br>", "etymology": "1375–1425; < Middle French ambre gris gray amber ( amber ); replacing late Middle English imbergres", "example": null, "synonym": null}, {"word": "encumber", "definitionA": "to impede or hinder; hamper:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To load down something with a burden<br>&nbsp;&nbsp;&nbsp;2. To restrict or block something with a hindrance or impediment<br>&nbsp;&nbsp;&nbsp;3. To burden with a legal claim or other obligation<br>", "etymology": "First recorded in 1300–50; Middle English encombren, encombre, encomber, from Anglo-French, Middle French encombrer, equivalent to en- prefix + -combrer, verbal derivative of combre “dam, weir,” from early Medieval Latin combrus, from Gaulish comberos (unrecorded) “confluence, bringing together” (compare Quimper, in Brittany, from Breton Kemper ); en- 1, com-, bear 1", "example": "Two questions that have forever encumbered treatment of intellectual responsibility remain with us.", "synonym": "block"}, {"word": "emporium", "definitionA": "a large retail store, especially one selling a great variety of articles.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A city or region which is a major trading centre; also, a place within a city for commerce and trading; a marketplace.<br>&nbsp;&nbsp;&nbsp;2. A shop that offers a wide variety of goods for sale; a department store; (with a descriptive word) a shop specializing in particular goods.<br>&nbsp;&nbsp;&nbsp;3. A business set up to enable foreign traders to engage in commerce in a country; a factory (now the more common term).<br>&nbsp;&nbsp;&nbsp;4. (by extension) The brain.<br>", "etymology": "First recorded in 1580–90; from Latin, from Greek empórion “market, emporium,” equivalent to émporos “merchant,” originally “traveler, passenger” ( em- em- 2 + póros “passage, voyage”) + -ion noun suffix of place", "example": null, "synonym": "chain"}]