[{"word": "didactic", "definitionA": "intended for instruction; instructive:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A treatise on teaching or education.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Instructive or intended to teach or demonstrate, especially with regard to morality.<br>&nbsp;&nbsp;&nbsp;2. Excessively moralizing.<br>&nbsp;&nbsp;&nbsp;3. Teaching from textbooks rather than laboratory demonstration and clinical application.<br>", "etymology": "First recorded in 1635–45; from Greek didaktikós “apt at teaching, instructive,” from didakt(ós) “that may be taught, teachable” (from didáskein “to teach”) + -ikos -ic", "example": null, "synonym": null}, {"word": "autodidact", "definitionA": "a person who has learned a subject without the benefit of a teacher or formal education; a self-taught person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A self-taught person.<br>", "etymology": "First recorded in 1525–35; from Greek autodídaktos “self-taught”; auto- 1, didactic", "example": null, "synonym": null}, {"word": "execrate", "definitionA": "to detest utterly; abhor; abominate.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To feel loathing for; to abhor<br>&nbsp;&nbsp;&nbsp;2. To declare to be hateful or abhorrent; to denounce<br>&nbsp;&nbsp;&nbsp;3. To invoke a curse; to curse or swear<br>", "etymology": "1555–65; < Latin ex ( s ) ecrātus (past participle of ex ( s ) ecrārī to curse), equivalent to ex- ex- 1 + secr- (combining form of sacrāre to consecrate; sacrament ) + -ātus -ate 1", "example": null, "synonym": "abhor"}, {"word": "anathema", "definitionA": "a person or thing detested or loathed:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ban or curse pronounced with religious solemnity by ecclesiastical authority, often accompanied by excommunication; something denounced as accursed.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Something which is vehemently disliked by somebody.<br>&nbsp;&nbsp;&nbsp;3. An imprecation; a curse; a malediction.<br>&nbsp;&nbsp;&nbsp;4. Any person or thing anathematized, or cursed by ecclesiastical authority.<br>", "etymology": "First recorded in 1520–30; from Latin, from Greek: “a thing accursed, devoted to evil,” originally “devoted,” from ana(ti)thé(nai) “to set up” + -ma, noun suffix", "example": null, "synonym": "abomination"}, {"word": "homily", "definitionA": "a sermon, usually on a Biblical topic and usually of a nondoctrinal nature.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sermon, especially concerning a practical matter.<br>&nbsp;&nbsp;&nbsp;2. A moralizing lecture.<br>&nbsp;&nbsp;&nbsp;3. A platitude.<br>", "etymology": "1545–55; < Late Latin homīlia < Greek homīlía assembly, sermon, equivalent to hómīl ( os ) crowd ( hom ( oû ) together + -īlos, masculine combining form of ī́lē (feminine) crowd) + -ia -y 3; replacing Middle English omelie < Middle French < Latin, as above", "example": null, "synonym": "doctrine"}, {"word": "atrocious", "definitionA": "extremely or shockingly wicked, cruel, or brutal:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Frightful, evil, cruel, or monstrous.<br>&nbsp;&nbsp;&nbsp;2. Offensive or heinous.<br>&nbsp;&nbsp;&nbsp;3. Very bad; abominable, disgusting.<br>", "etymology": "First recorded in 1660–70; atroci(ty) + -ous", "example": null, "synonym": null}, {"word": "henotheism", "definitionA": "the worship of a particular god, as by a family or tribe, without disbelieving in the existence of others.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Belief in or worship of one deity without denying the existence of other deities.<br>", "etymology": "1855–60; < Greek heno-, combining form of hén one (neuter of heîs ) + theism", "example": null, "synonym": null}, {"word": "aneurysm ", "definitionA": "a permanent cardiac or arterial dilatation usually caused by weakening of the vessel wall.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An abnormal blood-filled swelling of an artery or vein, resulting from a localized weakness in the wall of the vessel.<br>", "etymology": "irst recorded in 1650–60; from Greek aneúrysma “dilation,” equivalent to aneurys- (variant stem of aneurýnein “to dilate,” from an- an- 3 + eurýnein “to widen, broaden”; eury- ) + -ma, noun suffix", "example": null, "synonym": null}, {"word": "stubble", "definitionA": "Usually stubbles. the stumps of grain and other stalks left in the ground when the crop is cut.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Short, coarse hair, especially on a man’s face.<br>&nbsp;&nbsp;&nbsp;2. The short stalks left in a field after crops have been harvested.<br>", "etymology": "1250–1300; Middle English stuble < Old French estuble < Vulgar Latin *stupula, Latin stipula stipule", "example": null, "synonym": "bristles"}, {"word": "salient", "definitionA": "prominent or conspicuous:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An outwardly projecting part of a fortification, trench system, or line of defense.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Worthy of note; pertinent or relevant.<br>&nbsp;&nbsp;&nbsp;2. Prominent; conspicuous.<br>&nbsp;&nbsp;&nbsp;3. (usually of a quadruped) Depicted in a leaping posture.<br>&nbsp;&nbsp;&nbsp;4. Projecting outwards, pointing outwards.<br>&nbsp;&nbsp;&nbsp;5. Moving by leaps or springs; jumping.<br>&nbsp;&nbsp;&nbsp;6. Shooting or springing out; projecting.<br>&nbsp;&nbsp;&nbsp;7. Denoting any angle less than two right angles.<br>", "etymology": "First recorded in 1555–65; from Latin salient-, stem of saliēns “jumping,” present participle of salīre “to spring, jump”", "example": null, "synonym": "jutting"}, {"word": "presage", "definitionA": "a presentiment or foreboding.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A warning of a future event; an omen.<br>&nbsp;&nbsp;&nbsp;2. An intuition of a future event; a presentiment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To predict or foretell something.<br>&nbsp;&nbsp;&nbsp;2. To make a prediction.<br>&nbsp;&nbsp;&nbsp;3. To have a presentiment of; to feel beforehand; to foreknow.<br>", "etymology": "1350–1400; Middle English (noun) < Middle French presage < Latin praesāgium presentiment, forewarning, equivalent to praesāg ( us ) having a foreboding ( prae- pre- + sāgus prophetic; sagacious ) + -ium -ium", "example": null, "synonym": "apprehension"}, {"word": "sarcophagus", "definitionA": "a stone coffin, especially one bearing sculpture, inscriptions, etc., often displayed as a monument.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stone coffin, often inscribed or decorated with sculpture.<br>&nbsp;&nbsp;&nbsp;2. The cement and steel structure that encases the destroyed reactor at the power station in Chernobyl, Ukraine.<br>&nbsp;&nbsp;&nbsp;3. A kind of limestone used by the Greeks for coffins, so called because it was thought to consume the flesh of corpses.<br>&nbsp;&nbsp;&nbsp;4. An 18th-century form of wine cooler.<br>", "etymology": "1595–1605; < Latin < Greek sarkophágos, noun use of the adj.; sarcophagous", "example": null, "synonym": "bin"}, {"word": "zaftig", "definitionA": "(of a woman) having a pleasantly plump figure.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a woman, having a plump and sexually attractive figure; voluptuous, well-proportioned; large.<br>", "etymology": "First recorded in 1935–40; from Yiddish zaftik, literally, “juicy, succulent”; compare Middle High German saftec, derivative of saf(t), Old High German saf ( German Saft ) “juice, sap”; sap 1,", "example": null, "synonym": "gross"}, {"word": "quoin", "definitionA": "an external solid angle of a wall or the like.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of the corner building blocks of a building, usually larger or more ornate than the surrounding blocks.<br>&nbsp;&nbsp;&nbsp;2. The keystone of an arch.<br>&nbsp;&nbsp;&nbsp;3. A metal wedge which fits into the space between the type and the edge of a chase, and is tightened to fix the metal type in place.<br>&nbsp;&nbsp;&nbsp;4. A form of wedge used to prevent casks from moving<br>&nbsp;&nbsp;&nbsp;5. A wedge of wood or iron put under the breech of heavy guns or the muzzle of siege-mortars to raise them to the proper level.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wedge or steady with quoins.<br>", "etymology": "First recorded in 1525–35; variant of coin", "example": null, "synonym": "angle"}]