[{"word": "fluke", "definitionA": "the part of an anchor that catches in the ground, especially the flat triangular piece at the end of each arm.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lucky or improbable occurrence, with the implication that the occurrence could not be repeated.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To obtain a successful outcome by pure chance.<br>&nbsp;&nbsp;&nbsp;2. To fortuitously pot a ball in an unintended way.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A flounder.<br>&nbsp;&nbsp;&nbsp;2. A trematode; a parasitic flatworm of the Trematoda class, related to the tapeworm.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Either of the two lobes of a whale's or similar creature's tail.<br>&nbsp;&nbsp;&nbsp;2. Any of the triangular blades at the end of an anchor, designed to catch the ground.<br>&nbsp;&nbsp;&nbsp;3. A metal hook on the head of certain staff weapons (such as a bill), made in various forms depending on function, whether used for grappling or to penetrate armour when swung at an opponent.<br>&nbsp;&nbsp;&nbsp;4. In general, a winglike formation on a central piece.<br>&nbsp;&nbsp;&nbsp;5. Waste cotton.<br>", "etymology": "First recorded in 1555–65; perhaps special use of fluke 3", "example": null, "synonym": "accident"}, {"word": "mope", "definitionA": "to be sunk in dejection or listless apathy; sulk; brood.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dull, spiritless person.<br>&nbsp;&nbsp;&nbsp;2. (pornography industry) A bottom feeder who \"mopes\" around a pornography studio hoping for his big break and often does bit parts in exchange for room and board and meager pay.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To carry oneself in a depressed, lackadaisical manner; to give oneself up to low spirits; to pout, sulk.<br>&nbsp;&nbsp;&nbsp;2. To make spiritless and stupid.<br>", "etymology": "First recorded in 1560–70; variant of mop 2", "example": null, "synonym": "ache"}, {"word": "troth", "definitionA": "faithfulness, fidelity, or loyalty:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An oath, pledge, or promise.<br>&nbsp;&nbsp;&nbsp;2. Truth; something true.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pledge to marry somebody.<br>", "etymology": "1125–75; Middle English trowthe, trouthe, variant of treuthe, Old English trēowth. See truth", "example": null, "synonym": "betrothal"}, {"word": "peek", "definitionA": "to look or glance quickly or furtively, especially through a small opening or from a concealed location; peep; peer.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To look slyly, or with the eyes half closed, or through a crevice; to peep.<br>&nbsp;&nbsp;&nbsp;2. To be only slightly, partially visible, as if peering out from a hiding place.<br>&nbsp;&nbsp;&nbsp;3. To retrieve (a value) from a memory address.<br>", "etymology": "First recorded in 1325–75; Middle English piken (verb); perhaps dissimilated variant of kiken “to look furtively, keek”; keek", "example": null, "synonym": "gander"}, {"word": "grapple", "definitionA": "to hold or make fast to something, as with a grapple.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A close hand-to-hand struggle; the act of grappling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To seize something and hold it firmly.<br>&nbsp;&nbsp;&nbsp;2. To wrestle or tussle.<br>&nbsp;&nbsp;&nbsp;3. (with with) To ponder and intensely evaluate a problem.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tool with claws or hooks which is used to catch or hold something.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fasten, as with a grapple; (by extension) to fix; to join indissolubly.<br>&nbsp;&nbsp;&nbsp;2. To climb (whether by means of a grapple and rope, or by hand, etc).<br>&nbsp;&nbsp;&nbsp;3. To use a grapple (for example to attempt to find, hook, and raise a net or cable).<br>&nbsp;&nbsp;&nbsp;4. To hook and raise with a grapple.<br>", "etymology": "1520–30; apparently a frequentative of Old English gegrǣppian to seize; associated with grapnel", "example": null, "synonym": "attack"}, {"word": "demiurge", "definitionA": "the artificer of the world", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The (usually benevolent) being that created the universe out of primal matter.<br>&nbsp;&nbsp;&nbsp;2. A (usually jealous or outright malevolent) being who is inferior to the supreme being, and sometimes seen as the creator of evil.<br>&nbsp;&nbsp;&nbsp;3. Something (such as an idea, individual or institution) conceived as an autonomous creative force or decisive power.<br>&nbsp;&nbsp;&nbsp;4. The title of a magistrate in a number of states of Ancient Greece, and in the city states (poleis) of the Achaean League.<br>", "etymology": "First recorded in 1590–1600; from Greek dēmiourgós “a worker for the people, public worker, skilled worker,” equivalent to dḗmio(s) “of the people, public” + -ergos “a worker,” derivative of érgon work ( none )", "example": null, "synonym": null}, {"word": "consubstantial", "definitionA": "of one and the same substance, essence, or nature, especially the three divine persons of the Christian Trinity.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of the same substance or essence.<br>", "etymology": "First recorded in 1450–1500; late Middle English, from Late Latin consubstantiālis, equivalent to con- prefix + substanti(a) “existence, corporeal existence” + -ālis adjective suffix; con-, substantial", "example": null, "synonym": "like"}, {"word": "arrant", "definitionA": "downright; thorough; unmitigated; notorious:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Utter; complete (with a negative sense).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Straying from the proper course or standard, or outside established limits.<br>&nbsp;&nbsp;&nbsp;2. Wandering; roving around.<br>&nbsp;&nbsp;&nbsp;3. Prone to making errors; misbehaved.<br>&nbsp;&nbsp;&nbsp;4. Utter, complete (negative); arrant.<br>", "etymology": "1350–1400; Middle English, variant of errant", "example": null, "synonym": null}, {"word": "sward", "definitionA": "the grassy surface of land; turf.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A layer of earth into which grass has grown; turf; sod.<br>&nbsp;&nbsp;&nbsp;2. An expanse of land covered in grass; a lawn or meadow.<br>&nbsp;&nbsp;&nbsp;3. Skin; covering.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cover with sward.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A homosexual man.<br>", "etymology": "before 900; Middle English (noun); Old English sweard skin, rind; cognate with German Schwarte rind, Old Frisian swarde scalp, Middle Dutch swaerde skin", "example": null, "synonym": "field"}, {"word": "ablactate", "definitionA": "to wean.", "definitionB": "No definition found", "etymology": "< Late Latin ablactātus weaned (past participle of ablactāre ), equivalent to ab- ab- + lact- (stem of lac ) milk + -ātus -ate 1", "example": null, "synonym": null}, {"word": "pyrophoric", "definitionA": "capable of igniting spontaneously in air.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Spontaneously igniting in air, especially when in a finely divided state<br>&nbsp;&nbsp;&nbsp;2. Producing sparks, especially by friction<br>&nbsp;&nbsp;&nbsp;3. (fire investigation) Able to oxidize with exposure to atmospheric oxygen at normal temperatures.<br>", "etymology": "1780–90; < Greek pyrophór ( os ) fire-bearing ( pyro-, -phorous ) + -ic", "example": null, "synonym": null}, {"word": "divulgate", "definitionA": "to make publicly known; publish.", "definitionB": "No definition found", "etymology": "1375–1425; late Middle English < Latin dīvulgātus made common property (past participle of dīvulgāre ), equivalent to dīvulg- ( divulge ) + -ātus -ate 1", "example": null, "synonym": null}, {"word": "onerous", "definitionA": "burdensome, oppressive, or troublesome; causing hardship:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Imposing or constituting a physical, mental, or figurative load which can be borne only with effort; burdensome.<br>", "etymology": "1350–1400; Middle English < Latin onerōsus, equivalent to oner- (stem of onus ) burden + -ōsus -ous", "example": "The American Clean Power Assn. has opposed her proposal, Assembly Bill 303, saying it puts overly onerous restrictions on the clean energy industry.", "synonym": null}, {"word": "entelechy", "definitionA": "a realization or actuality as opposed to a potentiality.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The complete realisation and final form of some potential concept or function; the conditions under which a potential thing becomes actualized.<br>&nbsp;&nbsp;&nbsp;2. A particular type of motivation, need for self-determination, and inner strength directing life and growth to become all one is capable of being; the need to actualize one's beliefs; having both a personal vision and the ability to actualize that vision from within.<br>", "etymology": "1595–1605; < Late Latin entelechīa < Greek entelécheia, equivalent to en- en- 2 + tél ( os ) goal + éch ( ein ) to have + -eia -y 3", "example": null, "synonym": null}, {"word": "counterpoise", "definitionA": "a counterbalancing weight.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A weight sufficient to balance another, for example in the opposite end of scales; an equal weight.<br>&nbsp;&nbsp;&nbsp;2. An equal power or force acting in opposition; a force sufficient to balance another force.<br>&nbsp;&nbsp;&nbsp;3. The relation of two weights or forces which balance each other; equilibrium<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act against with equal weight; to equal in weight; to balance the weight of; to counterbalance.<br>&nbsp;&nbsp;&nbsp;2. To act against with equal power; to balance.<br>", "etymology": "1375–1425; counter- + poise 1; replacing late Middle English countrepeis < Anglo-French, equivalent to Old French contrepois", "example": null, "synonym": "balance"}, {"word": "stilt", "definitionA": "one of two poles, each with a support for the foot at some distance above the bottom end, enabling the wearer to walk with their feet above the ground.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Either of two poles with footrests that allow someone to stand or walk above the ground; used mostly by entertainers.<br>&nbsp;&nbsp;&nbsp;2. A tall pillar or post used to support some structure; often above water.<br>&nbsp;&nbsp;&nbsp;3. Any of various wading birds of the genera Himantopus and Cladorhynchus, related to the avocet, that have extremely long legs and long thin bills.<br>&nbsp;&nbsp;&nbsp;4. A crutch.<br>&nbsp;&nbsp;&nbsp;5. The handle of a plough.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To raise on stilts, or as if on stilts<br>", "etymology": "First recorded in 1275–1325; Middle English stilte; cognate with Low German stilte “pole,” German Stelze", "example": null, "synonym": "barren"}, {"word": "telos", "definitionA": "the end term of a goal-directed process; especially, the Aristotelian final cause.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The aim or goal.<br>", "etymology": "1900–05; < Greek télos; tele- 2", "example": null, "synonym": null}, {"word": "telodynamic", "definitionA": "pertaining to the transmission of mechanical power over considerable distances, as by means of endless cables on pulleys.", "definitionB": "No definition found", "etymology": "First recorded in 1865–70; telo- 1 + dynamic", "example": null, "synonym": null}]