[{"word": "exorbitant", "definitionA": "exceeding the bounds of custom, propriety, or reason, especially in amount or extent; highly excessive:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Exceeding proper limits; extravagant; excessive or unduly high.<br>", "etymology": "1425–75; late Middle English < Late Latin exorbitant- (stem of exorbitāns, present participle of exorbitāre to go out of the track), equivalent to ex- ex- 1 + orbit ( a ) wheel track ( orbit ) + -ant- -ant", "example": "One of her tasks was directing baseball activities in the Dominican Republic, where for years local agents—called buscones—have skimmed off exorbitant portions of the signing bonuses awarded to young prospects.", "synonym": null}, {"word": "innocuous", "definitionA": "not harmful or injurious; harmless:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Harmless; producing no ill effect.<br>&nbsp;&nbsp;&nbsp;2. Inoffensive; unprovocative; not exceptional.<br>", "etymology": "From the Latin word innocuus, dating back to 1590–1600. See in- 3, nocuous", "example": "Seemingly innocuous at the time, Abdullahi’s statement now feels ominous after details of the bill became public this week.", "synonym": null}, {"word": "internecine", "definitionA": "of or relating to conflict or struggle within a group:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Mutually destructive; most often applied to warfare.<br>&nbsp;&nbsp;&nbsp;2. Characterized by struggle within a group, usually applied to an ethnic or familial relationship.<br>", "etymology": "1655–65; < Latin internecīnus, internecīvus murderous, equivalent to internec ( āre ) to kill out, exterminate ( inter- inter- + necāre to kill) + -īnus -ine 1, -īvus -ive", "example": "Yellowstone follows the internecine squabbling of John Dutton’s three youngest children, who include two sons and a daughter.", "synonym": null}, {"word": "necrosis", "definitionA": "death of a circumscribed portion of animal or plant tissue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The localized death of cells or tissues through injury, disease, or the interruption of blood supply.<br>", "etymology": "First recorded in 1655–65; from New Latin, from Greek nékrōsis “mortification, state of death”; necr-, -osis", "example": "Particularly effective are drugs like antitumor necrosis factor agents.", "synonym": "cessation"}, {"word": "nectarine", "definitionA": "a variety or mutation of peach having a smooth, downless skin.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cultivar of the peach distinguished by its skin being smooth, not fuzzy.<br>&nbsp;&nbsp;&nbsp;2. A nectar-like liquid medicine.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Nectarous; like nectar.<br>", "etymology": "First recorded in 1610–20; nectar + -ine 1", "example": "Instead of judging by appearance, select a mango as you would a peach or nectarine.", "synonym": null}, {"word": "nociceptive", "definitionA": "causing or reacting to pain", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to the perception or sensation of pain.<br>", "etymology": "C20: from Latin nocēre to injure + (re)ceptive", "example": null, "synonym": null}, {"word": "nocuous", "definitionA": "likely to cause damage or injury; harmful; noxious.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Likely to cause harm or damage.<br>", "etymology": "First recorded in 1625–35; < Latin nocuus “harmful, injurious,” equivalent to noc(ēre) “to harm, hurt” + -uus adjective suffix; -ous", "example": null, "synonym": null}, {"word": "noxious", "definitionA": "harmful or injurious to health or physical well-being:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Harmful; injurious.<br>", "etymology": "1605–15; < Latin noxius harmful, hurtful, injurious, equivalent to nox ( a ) harm, hurt, injury (akin to nocēre to do harm, inflict injury; innocent ) + -ius -ious", "example": "This, combined with the ozone, made worse by the heat, and the pesticides from the nearby fields, led to a noxious, inflammatory cocktail that swirled deep in Nicolas’ family’s lungs.", "synonym": null}, {"word": "nuisance", "definitionA": "an obnoxious or annoying person, thing, condition, practice, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A minor annoyance or inconvenience.<br>&nbsp;&nbsp;&nbsp;2. A person or thing causing annoyance or inconvenience.<br>&nbsp;&nbsp;&nbsp;3. Anything harmful or offensive to the community or to a member of it, for which a legal remedy exists.<br>", "etymology": "First recorded in 1375–1425; late Middle English nu(i)sa(u)nce, from Anglo-French, from nuis(er) “to harm” (from Latin nocēre “to harm, injure”) + -ance -ance", "example": "My experience working through the many nuisances associated with vacation rentals has shown me that a compromise was the best approach for Mission Beach and is likely the best approach for San Diego.", "synonym": "blister"}, {"word": "obnoxious", "definitionA": "highly objectionable or offensive; odious:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Extremely unpleasant or offensive; very annoying, odious or contemptible.<br>&nbsp;&nbsp;&nbsp;2. Exposing to harm or injury.<br>", "etymology": "First recorded in 1575–85; from Latin obnoxiōsus “harmful,” equivalent to ob- “to, toward, against,” + noxiōsus “harmful”; ob-, noxious", "example": "That made it hard to ignore obnoxious contacts or ones you’d prefer to forget.", "synonym": null}, {"word": "pernicious", "definitionA": "causing insidious harm or ruin; ruinous; injurious; hurtful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Causing much harm in a subtle way.<br>&nbsp;&nbsp;&nbsp;2. Causing death or injury; deadly.<br>", "etymology": "First recorded in 1515–25; from Latin perniciōsus “ruinous,” from pernici(ēs) “ruin” (from per- per- + -nici-, combining form of nex “death, murder” + -ēs, noun suffix) + -ōsus -ous", "example": "We will pursue every legal avenue we can to block this pernicious law.", "synonym": null}]