[{"word": "thrall", "definitionA": "a person who is morally or mentally enslaved by some power, influence, or the like:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who is enslaved or under mind control.<br>&nbsp;&nbsp;&nbsp;2. The state of being under the control of another person.<br>&nbsp;&nbsp;&nbsp;3. A shelf; a stand for barrels, etc.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Enthralled; captive.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a thrall; enslave.<br>", "etymology": "First recorded before 950; Middle English thral, thral(l)e, threl(l)e, Old English thrǣl “bondman, slave, servant, thrall,” from Old Norse thrǣll “slave, servant”", "example": "With all those dead pine trees in thrall to wildfire, the Sierra, transmuted into ash, is right outside our door.", "synonym": "servitude"}, {"word": "ilk", "definitionA": "family, class, or kind:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A type, race or category; a group of entities that have common characteristics such that they may be grouped together.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Very; same.<br>", "etymology": "before 900; Middle English ilke, Old English ilca (pronoun) the same, equivalent to demonstrative i (cognate with Gothic is he, Latin is that) + a reduced form of līc like 1; which, such", "example": "As much as mold is not great and people don’t like it, and they think if you’ve got mold on the top … it spoils down into the jam, I’m still of the ilk of taking the mold off the top and eating what’s underneath.", "synonym": "brand"}, {"word": "apathy", "definitionA": "absence or suppression of passion, emotion, or excitement.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lack of emotion or motivation; lack of interest or enthusiasm towards something; disinterest (in something).<br>", "etymology": "First recorded in 1595–1605; from French or directly from Latin apathīa, from Greek apátheia “insensibility to suffering,” equivalent to apathe- (stem of apathḗs ) “unfeeling” ( a- a- 6 + pathe-, variant stem of páthos pathos ) + -ia -ia", "example": "They need to change the conversation about their team, which is full of doubt and apathy.", "synonym": "aloofness"}, {"word": "yonder", "definitionA": "being in that place or over there; being that or those over there:", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. To that place.<br>&nbsp;&nbsp;&nbsp;2. To that point, end, or result.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The vast distance, particularly the sky or trackless forest.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (with \"the\") The farther, the more distant of two choices.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. At or in a distant but indicated place.<br>", "etymology": "1250–1300; Middle English yonder, yender, equivalent to yond + -er as in hither, thither, etc.; akin to Dutch ginder, Gothic jaindre", "example": "Most of the drones on this list will either land or just fly off into the great blue yonder if they lose signal, so try to keep everything where it should be.", "synonym": "yon"}, {"word": "yon", "definitionA": "yonder.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. That (thing) over there; of something distant, but within sight.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Yonder.<br>&#60;pronoun&#62;<br>&nbsp;&nbsp;&nbsp;1. That one or those over there.<br>", "etymology": "First recorded before 900; Middle English; Old English geon; akin to Dutch gene, German jener, Old Norse enn, inn “the,” Gothic jains “that”", "example": "We've seen Mitt Romney fly thither and yon grasping at excuses not to release his tax returns.", "synonym": null}, {"word": "anthropopathy", "definitionA": "ascription of human passions or feelings to a being or beings not human, especially to a deity.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The attribution of human emotions to a god.<br>", "etymology": "1640–50; < Medieval Latin anthrōpopatheia < Greek anthrōpopátheia humanness. See anthropo-, -pathy", "example": "The older abstract term is “anthropopathy,” literally “attributing human feelings,” in sense (b).", "synonym": null}, {"word": "osteopathy", "definitionA": "Also called  os·te·o·path·ic med·i·cine. a medical discipline with an emphasis on the health and drug-free treatment of the musculoskeletal system and on the diagnostic significance of patient lifestyle and environment:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The branch of therapy based on manipulation of bones and muscles.<br>&nbsp;&nbsp;&nbsp;2. Any disease of the bones.<br>", "etymology": "First recorded in 1855–60; osteo- + -pathy", "example": "Perplexed and frowning, my physical therapist prodded me with dry needles near terrifyingly tender places, added yet more exercises, and declared it was time to level up—to a new primary-care doctor who also specialized in osteopathy.", "synonym": null}, {"word": "osseous", "definitionA": "composed of, containing, or resembling bone; bony.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, relating to, or made of bone; bony.<br>", "etymology": "1675–85; < Latin osseus bony, equivalent to oss- (stem of os ) bone + -eus -eous", "example": "Indeed, the whole osseous structure of those animals proves that they were formed to uprend the trees that gave them sustenance.", "synonym": null}, {"word": "ossicle", "definitionA": "a small bone.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small bone (or bony structure), especially one of the three of the middle ear.<br>&nbsp;&nbsp;&nbsp;2. Bone-like joint or plate, especially:<br>", "etymology": "1570–80; < Latin ossiculum, equivalent to ossi- (combining form of os ) bone + -culum -cle 1", "example": "In the ossicles, the atomic pattern and the diamondlike lattice align in a way that compensates for calcite’s intrinsic weakness.", "synonym": null}, {"word": "ossuary", "definitionA": "a place or receptacle for the bones of the dead.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A container, receptacle, or building, such as an urn or vault, for holding the bones of the dead.<br>", "etymology": "1650–60; < Late Latin ossuārium, variant of ossārium, equivalent to oss- (stem of os ) bone + -ārium -ary", "example": "The French cemetery at Notre Dame de Lorette has 20,000 named graves and an ossuary with 20,000 unknown dead.", "synonym": "container"}, {"word": "osteology", "definitionA": "the branch of anatomy dealing with the skeleton.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The scientific study of the morphology and pathology of bones.<br>&nbsp;&nbsp;&nbsp;2. The bone structure of a particular individual, or species.<br>", "etymology": "From the New Latin word osteologia, dating back to 1660–70. See osteo-, -logy", "example": "Yet the study is one in which even greater specialisation is needed than in respect of comparative osteology.", "synonym": "bones"}]