[{"word": "indoctrinate", "definitionA": "to instruct in a doctrine, principle, ideology, etc., especially to imbue with a specific partisan or biased belief or point of view.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To teach with a biased, one-sided or uncritical ideology; to brainwash.<br>&nbsp;&nbsp;&nbsp;2. To teach; to instruct.<br>", "etymology": "First recorded in 1620–30; in- 2 + Medieval Latin doctrīnātus, past participle of doctrīnāre “to teach”; doctrine, -ate 1", "example": "Over time, the campaign to remove books from classrooms that allegedly indoctrinated students into CRT thinking evolved into one focused on \"punishing woke corporations\".", "synonym": "convince"}, {"word": "ajar", "definitionA": "neither entirely open nor entirely shut; partly open:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To turn or open slightly; to become ajar or to cause to become ajar; to be or to hang ajar.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Slightly turned or opened.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Slightly turned or opened.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To show variance or contradiction with something; to be or cause to be askew.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Out of harmony.<br>&nbsp;&nbsp;&nbsp;2. Being at variance or in contradiction to something.<br>", "etymology": "1350–1400; Middle English on char on the turn; a- 1, char 3", "example": "The door to a pilot’s plane appeared to be ajar as it took off from Fullerton Airport, moments before it crashed into a warehouse, killing two and injuring 19 others, according to investigators.", "synonym": null}, {"word": "antsy", "definitionA": "unable to sit or stand still; fidgety:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Restless, apprehensive and fidgety<br>", "etymology": "1950–55; ant + -s 3 + -y 1; -sy", "example": "As the Palisades transitions into recovery, leaders outlined the next steps in the process for residents who are antsy to begin rebuilding.", "synonym": null}, {"word": "countervail", "definitionA": "to act or avail against with equal power, force, or effect; counteract.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have the same value as.<br>&nbsp;&nbsp;&nbsp;2. To counteract, counterbalance or neutralize.<br>&nbsp;&nbsp;&nbsp;3. To compensate for.<br>", "etymology": "1350–1400; Middle English contrevailen < Anglo-French countrevail-, tonic stem (subjunctive) of countrevaloir to equal, be comparable to < Latin phrase contrā valēre to be of worth against (someone or something). See counter-, -valent", "example": "Constant sorrow coexists with countervailing strength and perseverance.", "synonym": "balance"}, {"word": "kowtow", "definitionA": "to act in an obsequious manner; show servile deference.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of kowtowing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To grovel, act in a very submissive manner.<br>&nbsp;&nbsp;&nbsp;2. To kneel and bow low enough to touch one’s forehead to the ground.<br>&nbsp;&nbsp;&nbsp;3. To bow very deeply.<br>", "etymology": "First recorded in 1795–1805, kowtow is from the Chinese word kòutóu, literally, “knock (one's) head”", "example": "On an episode of \"The Daily Show\" he excoriated the party for its continued kowtowing to Republicans and attempts to flank the GOP to its right.", "synonym": "bow"}, {"word": "pogue", "definitionA": "slang  a disparaging term for military members who do not engage in direct combat ", "definitionB": "No definition found", "etymology": null, "example": null, "synonym": null}, {"word": "seething", "definitionA": "boiling or foaming as if boiling", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To boil.<br>&nbsp;&nbsp;&nbsp;2. (of a liquid) To boil vigorously.<br>&nbsp;&nbsp;&nbsp;3. (of a liquid) To foam in an agitated manner, as if boiling.<br>&nbsp;&nbsp;&nbsp;4. (of a person) To be in an agitated or angry mental state, as if boiling.<br>&nbsp;&nbsp;&nbsp;5. (of a place) To buzz with activity.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The action of the verb to seethe.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Boiling, bubbling<br>&nbsp;&nbsp;&nbsp;2. Angry, livid.<br>", "etymology": null, "example": "Trump is seething with anger and resentment at having been officially exposed as a sexual predator, a fraud, a coup plotter and a thief.", "synonym": "sudsy"}, {"word": "itinerant", "definitionA": "traveling from place to place, especially on a circuit, as a minister, judge, or sales representative; itinerating; journeying.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who travels from place to place.<br>&nbsp;&nbsp;&nbsp;2. A member of the Travelling Community, whether settled or not.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Habitually travelling from place to place.<br>", "etymology": "1560–70; < Late Latin itinerant- (stem of itinerāns ), present participle of itinerārī to journey, equivalent to itiner- (stem of iter ) journey ( iter ) + -ant- -ant", "example": "What ensued was an itinerant decade, one in which the two bounced from home to home, and for Marshall, from school to school, before they settled in Detroit.", "synonym": "ambulatory"}, {"word": "beckon", "definitionA": "to signal, summon, or direct by a gesture of the head or hand.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sign made without words; a beck.<br>&nbsp;&nbsp;&nbsp;2. A children's game similar to hide and seek in which children who have been \"caught\" may escape if they see another hider beckon to them.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wave or nod to somebody with the intention to make the person come closer.<br>&nbsp;&nbsp;&nbsp;2. To seem attractive and inviting<br>", "etymology": "before 950; Middle English beknen, Old English gebē ( a ) cnian, derivative of bēacen beacon", "example": "In another post, Holmes shared photos of three young women whose afros radiated like halos in front of Magnificent Brothers Barber & Beauty Salon #2 in Watts in 1969, beckoning natives to the comments.", "synonym": "allure"}, {"word": "factoid", "definitionA": "an insignificant or trivial fact.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An inaccurate statement or statistic believed to be true because of broad repetition, especially if cited in the media.<br>&nbsp;&nbsp;&nbsp;2. (originally North America) An interesting item of trivia; a minor fact.<br>", "etymology": "First recorded in 1973; fact + -oid", "example": "\"It's just a weird little factoid about our community,\" she said.", "synonym": null}, {"word": "pulchritude", "definitionA": "physical beauty; comeliness.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Physical beauty.<br>", "etymology": "First recorded in 1450–1500; late Middle English, from Latin pulchritūdō “beauty,” equivalent to pulchri- (combining form of pulcher “beautiful”) + -tūdō noun suffix; -tude", "example": "Why, at this moment celebrating body positivity and diversity, the natural pulchritude of all figures, do women continue to wrap wire around their breasts, hoisting them inches above their innate resting position?", "synonym": "adorableness"}, {"word": "aesthetic", "definitionA": "relating to the philosophy of aesthetics; concerned with notions such as the beautiful and the ugly.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The study of art or beauty.<br>&nbsp;&nbsp;&nbsp;2. That which appeals to the senses.<br>&nbsp;&nbsp;&nbsp;3. The artistic motifs defining a collection of things, especially works of art; more broadly, their vibe.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Concerned with beauty, artistic impact, or appearance.<br>&nbsp;&nbsp;&nbsp;2. Beautiful or appealing to one's sense of beauty and/or art.<br>", "etymology": "First recorded in 1795–1800; from New Latin aesthēticus, from Greek aisthētikós “pertaining to sense perception, perceptible, sensitive,” equivalent to aisthēt(ḗs) ( aesthete ) + -ikos -ic", "example": "He takes a wisp of an idea, a what-if, and turns it into a viable aesthetic.", "synonym": null}]