[{"word": "attire", "definitionA": "to dress, array, or adorn, especially for special occasions, ceremonials, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (clothing) One's dress; what one wears; one's clothes.<br>&nbsp;&nbsp;&nbsp;2. The single horn of a deer or stag.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To clothe or adorn.<br>", "etymology": "1250–1300; (v.) Middle English atiren < Anglo-French atirer, Old French atirier, verbal derivative of a tire into a row or rank ( a- 3, tier 1 ); (noun) Middle English atir < Anglo-French, noun derivative of the v.", "example": "The guidelines would require schools to accept name and pronoun changes, eliminate gender-specific attire from dress codes and uniforms and allow students and staff to use facilities that correspond with their gender identity.", "synonym": "accoutrements"}, {"word": "necromancy ", "definitionA": "a method of divination through alleged communication with the dead; black art.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Divination involving the dead or death.<br>&nbsp;&nbsp;&nbsp;2. Loosely, any sorcery or witchcraft, especially involving death or the dead, particularly sorcery involving raising or reanimating the dead.<br>&nbsp;&nbsp;&nbsp;3. Synonym of necroposting<br>", "etymology": "irst recorded in 1250–1300; necro- + -mancy; replacing Middle English nigromancie, from Medieval Latin nigromantīa for Late Latin necromantīa, from Greek nekromanteía; by folk etymology nigro- (combining form of Latin niger “black”) was substituted in Medieval Latin for the original necro-", "example": "Necromancy—wizardry—fairy-lore—all the stuff and nonsense that goes to the making of 'The Arabian nights'!", "synonym": "abracadabra"}, {"word": "recluse", "definitionA": "a person who lives in seclusion or apart from society, often for religious meditation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who lives in self-imposed isolation or seclusion from the world, especially for religious purposes; a hermit<br>&nbsp;&nbsp;&nbsp;2. The place where a recluse dwells; a place of isolation or seclusion<br>&nbsp;&nbsp;&nbsp;3. A brown recluse spider<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shut; to seclude<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sequestered; secluded, isolated<br>&nbsp;&nbsp;&nbsp;2. Hidden, secret<br>", "etymology": "1175–1225; Middle English < Old French reclus < Late Latin reclūsus, past participle of reclūdere to shut up, equivalent to re- re- + -clūd-, combining form of claudere to close + -tus past participle suffix, with dt > s", "example": "In addition to dealing with hunger and loneliness, North suffered bites from a Chilean recluse spider, which eventually became infected and threatened her time on the show.", "synonym": "anchorite"}, {"word": "immure", "definitionA": "to enclose within walls.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A wall; an enclosure.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cloister, confine, imprison: to lock up behind walls.<br>&nbsp;&nbsp;&nbsp;2. To put or bury within a wall.<br>&nbsp;&nbsp;&nbsp;3. (of a growing crystal) To trap or capture (an impurity); chiefly in the participial adjective immured and gerund or gerundial noun immuring.<br>", "etymology": "1575–85; < Medieval Latin immūrāre, equivalent to Latin im- im- 1 + -mūrāre, verbal derivative of mūrus wall ( mural )", "example": "It never forged a chain to bind a heretic or an adversary, nor erected a prison to immure him.", "synonym": "cloister"}, {"word": "esoteric", "definitionA": "understood by or meant for only the select few who have special knowledge or interest; recondite:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An esoteric doctrine or treatise; esoteric philosophy.<br>&nbsp;&nbsp;&nbsp;2. One who believes, or is an initiate, in esoteric doctrines or rites.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Intended for or likely to be understood by only a small number of people with a specialized knowledge or interest, or an enlightened inner circle.<br>&nbsp;&nbsp;&nbsp;2. Having to do with concepts that are highly theoretical and without obvious practical application; often with mystical or religious connotations.<br>&nbsp;&nbsp;&nbsp;3. Confidential; private.<br>", "etymology": "First recorded in 1645–55; from Greek esōterikós “inner,” equivalent to esṓter(os) “inner” + -ikos -ic", "example": "It may sound like an esoteric problem, but a rapidly-spinning litter beneath a helicopter with a 74-year-old evacuee in it made news in 2019 in a video that will make you gasp.", "synonym": null}, {"word": "spoof", "definitionA": "a mocking imitation of someone or something, usually light and good-humored; lampoon or parody:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of deception; a hoax; a joking prank.<br>&nbsp;&nbsp;&nbsp;2. A light parody.<br>&nbsp;&nbsp;&nbsp;3. A drinking game in which players hold up to three (or another specified number of) coins hidden in a fist and attempt to guess the total number of coins held.<br>&nbsp;&nbsp;&nbsp;4. Nonsense.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To gently satirize.<br>&nbsp;&nbsp;&nbsp;2. To deceive.<br>&nbsp;&nbsp;&nbsp;3. To falsify.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fake, hoax.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Semen.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ejaculate, to come.<br>", "etymology": "First recorded in 1885–90; after a game invented and named by Arthur Roberts (1852–1933), British comedian", "example": "Rainbow is best known for spoof interviews that blend musical parodies and political satire from a progressive perspective.", "synonym": "bluff"}, {"word": "intrinsic", "definitionA": "belonging to a thing by its very nature:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A built-in function that is implemented directly by the compiler, without any intermediate call to a library.<br>&nbsp;&nbsp;&nbsp;2. An ability possessed by a character and not requiring any external equipment.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Innate, inherent, inseparable from the thing itself, essential.<br>&nbsp;&nbsp;&nbsp;2. (of a body part) Situated, produced, secreted in, or coming from inside an organ, tissue, muscle or member.<br>", "etymology": "First recorded in 1480–90; Middle English intrinsique “inner,” from Old French intrinseque “internal, inner,” from Late Latin intrinsecus “inward” (adjective), from Latin intrinsecus “on the inside, inwards” (adverb), equivalent to intrin- (from int(e)r-, as in interior + -im, an old accusative ending used as an adverb suffix + secus “beside,” derivative of sequī “to follow”)", "example": "These considerations are key when choosing personalized gifts for those you care about, because the crux of joy in receiving a gift comes from the intrinsic change that the gift provides in someone’s daily experience.", "synonym": null}, {"word": "guffaw", "definitionA": "a loud, unrestrained burst of laughter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A boisterous laugh.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To laugh boisterously.<br>", "etymology": "First recorded in 1710–20; perhaps imitative", "example": "A bitter and reflexive gotcha guffaw to match the mean times, in which headlines redound with “Slams,” “Rips,” and “Blasted” as things people routinely do to each other.", "synonym": "howl"}, {"word": "intransigent ", "definitionA": "refusing to agree or compromise; uncompromising; inflexible.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who is intransigent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to compromise or moderate a position; unreasonable<br>", "etymology": "875–80; < Spanish intransigente, equivalent to in- in- 3 + transigente (present participle of transigir to compromise) < Latin trānsigent- (stem of trānsigēns, present participle of trānsigere to come to an agreement); transact", "example": "He becomes angry, intransigent, furiously scribbling notes; Chaz meets determination with determination.", "synonym": null}, {"word": "colliery ", "definitionA": "a coal mine, including all buildings and equipment.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An underground coal mine, together with its surface buildings.<br>&nbsp;&nbsp;&nbsp;2. A facility that supplies coal.<br>", "etymology": "irst recorded in 1625–35; collier + -y 3", "example": "Benxihu, China (1942) To date, the Benxihu (Honkeiko) colliery was the site of the most lethal mining accidents on record.", "synonym": null}, {"word": "hemorrhage ", "definitionA": "a profuse discharge of blood, as from a ruptured blood vessel; bleeding.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A heavy release of blood within or from the body.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bleed copiously.<br>&nbsp;&nbsp;&nbsp;2. To lose (something) in copious quantities.<br>", "etymology": "665–75; < Latin haemorrhagia < Greek haimorrhagía. See hemo-, -rrhagia", "example": "In 1993 a doctor described the Lazarus phenomenon in a seventy-five-year-old man with a lung hemorrhage.", "synonym": "drain"}, {"word": "fraught", "definitionA": "full of, accompanied by, or involving something specified, usually something unpleasant (often followed by with ): her pain-fraught body; a gathering fraught with joyful sounds.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The hire of a ship or boat to transport cargo.<br>&nbsp;&nbsp;&nbsp;2. Money paid to hire a ship or boat to transport cargo; freight<br>&nbsp;&nbsp;&nbsp;3. The transportation of goods, especially in a ship or boat.<br>&nbsp;&nbsp;&nbsp;4. A ship's cargo, lading or freight.<br>&nbsp;&nbsp;&nbsp;5. A load; a burden.<br>&nbsp;&nbsp;&nbsp;6. Two bucketfuls (of water).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To load (a ship, cargo etc.).<br>&nbsp;&nbsp;&nbsp;2. To form the cargo of a vessel.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a cargo-carrier) Laden.<br>&nbsp;&nbsp;&nbsp;2. (with with) Loaded up or charged with; accompanied by; entailing.<br>&nbsp;&nbsp;&nbsp;3. (with with) Furnished, equipped.<br>&nbsp;&nbsp;&nbsp;4. Distressed or causing distress, for example through complexity.<br>", "etymology": "First recorded in 1300–50; Middle English, from Middle Dutch or Middle Low German vracht “freight money, freight”; compare Old High German frēht “earnings,” Old English ǣht “possession”; freight", "example": "It’s a fraught category but may be helpful in understanding the merits of the show.", "synonym": null}, {"word": "commandant", "definitionA": "the commanding officer of a place, group, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A commanding officer, usually of a specific force or division.<br>", "etymology": "1680–90; < French, noun use of present participle of commander to command; -ant", "example": "Stuart Scheller expressed “contempt” that the defense secretary, chairman of the Joint Chiefs of Staff and commandant of the Marine Corps executed the president’s directive to withdraw from Afghanistan.", "synonym": "boss"}, {"word": "anachronism ", "definitionA": "something or someone that is not in its correct historical or chronological time, especially a thing or person that belongs to an earlier time:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A chronological mistake; the erroneous dating of an event, circumstance, or object.<br>&nbsp;&nbsp;&nbsp;2. A person or thing which seems to belong to a different time or period of time.<br>", "etymology": "640–50; < Latin anachronismus < Greek anachronismós a wrong time reference, equivalent to anachron ( ízein ) to make a wrong time reference ( ana-, chron-, -ize ) + -ismos -ism", "example": "The “reenactment” of the battle, an even more recent anachronism, dates back only to 1977.", "synonym": "misplacement"}, {"word": "acquiesce", "definitionA": "to assent tacitly; submit or comply silently or without protest; agree; consent:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (with in (or sometimes with, to)) To rest satisfied, or apparently satisfied, or to rest without opposition and discontent (usually implying previous opposition or discontent); to accept or consent by silence or by omitting to object.<br>&nbsp;&nbsp;&nbsp;2. To concur upon conviction; as, to acquiesce in an opinion; to assent to; usually, to concur, not heartily but so far as to forbear opposition.<br>", "etymology": "First recorded in 1610–20; from Latin acquiēscere “to find rest in, ” equivalent to ac- ac- + quiē- + -sc- inchoative suffix + -ere infinitive suffix", "example": "The underlying problem is whether conservatives can continue to acquiesce quietly in a rendition of the causes of the decline of the Republic and the entire Western world which is false.", "synonym": "accept"}, {"word": "arraign", "definitionA": "Law. to call or bring before a court to answer to an indictment, a formal charge for which it has been ascertained that there is enough evidence to warrant trial:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Arraignment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To officially charge someone in a court of law.<br>&nbsp;&nbsp;&nbsp;2. To call to account, or accuse, before the bar of reason, taste, or any other tribunal.<br>", "etymology": "First recorded in 1275–1325; Middle English arainen, from Anglo-French arainer, Old French araisnier, equivalent to a- a- 5 + raisnier, from unrecorded Vulgar Latin ratiōnāre “to talk, reason”; ratio", "example": "Hodges was arraigned in 2001 and eventually pleaded guilty to felony commercial burglary.", "synonym": "charge"}, {"word": "bougie", "definitionA": "Sometimes Disparaging. relating to or characteristic of a person who indulges in some of the luxuries and comforts of a fancy lifestyle:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tapered cylindrical instrument for introducing an object into a tubular anatomical structure, or to dilate such a structure, as with an esophageal bougie.<br>&nbsp;&nbsp;&nbsp;2. A wax candle.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually derogatory) Behaving like or pertaining to people of a higher social status, middle-class / bourgeois people (sometimes carrying connotations of fakeness, elitism, or snobbery).<br>&nbsp;&nbsp;&nbsp;2. Fancy or good-looking, without the same connotations of snobbery or pretentiousness as in sense 1.<br>", "etymology": "An Americanism dating back to 1965–70; shortening and alteration of bourgeois 1( def )", "example": "Then it could be boxed up when they need the space for more condos or bougie swap meets.", "synonym": "dip"}]