[{"word": "affray", "definitionA": "a public fight; a noisy quarrel; brawl.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of suddenly disturbing anyone; an assault or attack.<br>&nbsp;&nbsp;&nbsp;2. A tumultuous assault or quarrel.<br>&nbsp;&nbsp;&nbsp;3. The fighting of two or more persons, in a public place, to the terror of others.<br>&nbsp;&nbsp;&nbsp;4. Terror.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To startle from quiet; to alarm.<br>&nbsp;&nbsp;&nbsp;2. To frighten; to scare; to frighten away.<br>", "etymology": "1275–1325; Middle English < Anglo-French afray (noun), afrayer (v.), Old French esfrei (noun), esfreer (v.) < Vulgar Latin *exfridāre to break the peace, equivalent to ex- ex- 1 + -frid- peace (< Germanic; compare German Friede ) + -āre infinitive suffix", "example": "Alexander was additionally convicted of affray, having a firearm with intent to endanger life, possession of a bladed article, and possession of class A drugs with intent to supply.", "synonym": "altercation"}, {"word": "gullible", "definitionA": "easily deceived or cheated.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A gullible person; someone easily fooled or tricked.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Easily deceived or duped; naive, easily cheated or fooled.<br>", "etymology": "First recorded in 1815–25; gull 2 + -ible", "example": "Milhouse, named after former President Richard Milhous Nixon, often finds himself following his best friend, Bart, into trouble as a gullible sidekick.", "synonym": null}, {"word": "promulgate", "definitionA": "to make known by open declaration; publish; proclaim formally or put into operation (a law, decree of a court, etc.).", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make known or public.<br>&nbsp;&nbsp;&nbsp;2. To put into effect as a regulation.<br>", "etymology": "First recorded in 1520–30; from Latin prōmulgātus, past participle of prōmulgāre “to make known, promulgate”; promulge, -ate 1", "example": "But Davis pointed out that the regulations were promulgated months ago – and she said it’s unlikely that the Department of Education would have started to immediately scrutinize schools..", "synonym": "advertise"}, {"word": "assuage", "definitionA": "to make milder or less severe; alleviate; ease; mitigate:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To lessen the intensity of, to mitigate or relieve (hunger, emotion, pain etc.).<br>&nbsp;&nbsp;&nbsp;2. To pacify or soothe (someone).<br>&nbsp;&nbsp;&nbsp;3. To calm down, become less violent (of passion, hunger etc.); to subside, to abate.<br>", "etymology": "First recorded in 1250–1300; Middle English aswagen, from Old French asouagier, from unrecorded Vulgar Latin assuāviāre, equivalent to Latin as- as- + -suāviāre, verbal derivative of Latin suāvis “agreeable to the taste, pleasant” ( suave; akin to sweet )", "example": "Such outdoor experiments, these proponents argue, could demonstrate a particular approach’s utility and finally assuage critics’ concerns.", "synonym": "calm"}, {"word": "giblets", "definitionA": "the heart, liver, gizzard, and the like, of a fowl, often cooked separately.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The internal organs of poultry birds, used as food.<br>", "etymology": "1275–1325; Middle English < Old French gibelet a stew of game; compare French gibelotte rabbit stew", "example": "In fact, in the case of supermarket turkeys, the necks are often removed or relegated to a slimy plastic bag of giblets that gets jammed into the cavity.", "synonym": null}, {"word": "shirk", "definitionA": "to evade (work, duty, responsibility, etc.).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who shirks, who avoids a duty or responsibility.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To avoid, especially a duty, responsibility, etc.; to stay away from.<br>&nbsp;&nbsp;&nbsp;2. To evade an obligation; to avoid the performance of duty, as by running away.<br>&nbsp;&nbsp;&nbsp;3. To procure by petty fraud and trickery; to obtain by mean solicitation.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The unforgivable sin of idolatry.<br>", "etymology": "First recorded in 1625–35; obscurely akin to shark 2", "example": "De León denounced Feldstein Soto’s decision, saying she had “shirked her duty as a criminal prosecutor” by declining to pursue charges.", "synonym": "bypass"}, {"word": "fidget", "definitionA": "to move about restlessly, nervously, or impatiently.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A nervous wriggling or twitching motion.<br>&nbsp;&nbsp;&nbsp;2. A person who fidgets, especially habitually.<br>&nbsp;&nbsp;&nbsp;3. A toy intended to be fidgeted with.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wiggle or twitch; to move around nervously or idly.<br>&nbsp;&nbsp;&nbsp;2. To cause to fidget; to make uneasy.<br>", "etymology": "First recorded in 1665–75; compare dialectal fidge “to fidget,” akin to the synonymous expressive words fitch, fig, fike; compare Old Norse fīkjast “to be eager,” Old Swedish fīkja “to be restless”", "example": "He was triggered by a close family member who would fidget and smooth their hair.", "synonym": "bustle"}, {"word": "serendipity", "definitionA": "an aptitude for making desirable discoveries by accident.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A combination of events which have come together by chance to make a surprisingly good or wonderful outcome.<br>&nbsp;&nbsp;&nbsp;2. An unsought, unintended, and/or unexpected, but fortunate, discovery and/or learning experience that happens by accident.<br>", "etymology": "Serendip + -ity; coined in 1754 by English novelist Horace Walpole ( def ) for an ability possessed by the heroes of a fairy tale called The Three Princes of Serendip, using a former name for Sri Lanka", "example": "This dish came about more by happenstance than planning, but I’m deeply grateful for that serendipity.", "synonym": "blessing"}, {"word": "gizmo", "definitionA": "a gadget or device:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something, generally a device, for which one does not know the proper term.<br>", "etymology": "First recorded in 1940–45; origin uncertain", "example": "One by one, the satellites – each of them encrusted with a hodge-podge of solar panels and other gizmos – detached from their mothership.", "synonym": "contrivance"}, {"word": "platter", "definitionA": "a large, shallow dish, usually elliptical in shape, for holding and serving food, especially meat or fish.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tray for serving foods.<br>&nbsp;&nbsp;&nbsp;2. A main dish and side dishes served together on one plate.<br>&nbsp;&nbsp;&nbsp;3. The hard surface of a turntable on which a gramophone record rests when being played.<br>&nbsp;&nbsp;&nbsp;4. One of possibly many disks on which data is stored in a mechanical hard drive.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who plats/plaits or braids.<br>", "etymology": "First recorded in 1250–1300; Middle English plater, from Anglo-French, derivative of plat “dish”; plate 1, -er 2", "example": "Those perfectly cut, firm, fork-able rounds are the easiest thing in the world to plop out and place on a platter.", "synonym": "charger"}, {"word": "nocturia", "definitionA": "a condition in which one often wakes up during the night to urinate.", "definitionB": "No definition found", "etymology": "noct- + -uria", "example": "The reason: Treatment of sleep apnea has been shown to decrease production of BNP, thus reducing nocturia.", "synonym": null}, {"word": "animadversion", "definitionA": "an unfavorable or censorious comment:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A criticism, a critical remark.<br>&nbsp;&nbsp;&nbsp;2. The state or characteristic of being animadversive.<br>", "etymology": "1590–1600; < Latin animadversiōn- (stem of animadversiō ) a heeding, censure, equivalent to animadvers ( us ) (past participle of animadvertere to heed, censure; animadvert ) + -iōn- -ion", "example": "So what is it, exactly, that fuels the animadversion against Martin Amis?", "synonym": "accusation"}]