[{"word": "intransigent", "definitionA": "refusing to agree or compromise; uncompromising; inflexible.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who is intransigent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to compromise or moderate a position; unreasonable<br>", "etymology": "1875–80; < Spanish intransigente, equivalent to in- in- 3 + transigente (present participle of transigir to compromise) < Latin trānsigent- (stem of trānsigēns, present participle of trānsigere to come to an agreement); transact", "example": "The tide was turning but the intransigent faction needed a few more kicks.", "synonym": null}, {"word": "saucer", "definitionA": "a small, round, shallow dish to hold a cup.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small shallow dish to hold a cup and catch drips.<br>&nbsp;&nbsp;&nbsp;2. An object round and gently curved (shaped like a saucer).<br>&nbsp;&nbsp;&nbsp;3. A small pan or vessel in which sauce was set on a table.<br>&nbsp;&nbsp;&nbsp;4. A flat, shallow caisson for raising sunken ships.<br>&nbsp;&nbsp;&nbsp;5. A shallow socket for the pivot of a capstan.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pour (tea, etc.) from the cup into the saucer in order to cool it before drinking.<br>", "etymology": "First recorded in 1300–50; Middle English word from Old French word saussier. See sauce, -er 2", "example": "This gentle hill is perfect for sliding on tubes, sleds, and saucers.", "synonym": "boat"}, {"word": "subsidiary", "definitionA": "serving to assist or supplement; auxiliary; supplementary.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A company owned by a parent company or a holding company, also called daughter company or sister company.<br>&nbsp;&nbsp;&nbsp;2. A subordinate theme.<br>&nbsp;&nbsp;&nbsp;3. One who aids or supplies; an assistant.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Auxiliary or supplemental.<br>&nbsp;&nbsp;&nbsp;2. Secondary or subordinate.<br>&nbsp;&nbsp;&nbsp;3. Of, or relating to a subsidy.<br>", "etymology": "1535–45; < Latin subsidiārius, equivalent to subsidi ( um ) ( subsidy ) + -ārius -ary", "example": "The case involved Telenor Hungary, a former subsidiary of the Norwegian telecoms giant Telenor.", "synonym": "accessory"}, {"word": "winnow", "definitionA": "to free (grain) from the lighter particles of chaff, dirt, etc., especially by throwing it into the air and allowing the wind or a forced current of air to blow away impurities.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. That which winnows or which is used in winnowing; a contrivance for fanning or winnowing grain.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To subject (granular material, especially food grain) to a current of air separating heavier and lighter components, as grain from chaff.<br>&nbsp;&nbsp;&nbsp;2. To separate, sift, analyze, or test by separating items having different values.<br>&nbsp;&nbsp;&nbsp;3. To blow upon or toss about by blowing; to set in motion as with a fan or wings.<br>&nbsp;&nbsp;&nbsp;4. To move about with a flapping motion, as of wings; to flutter.<br>", "etymology": "before 900; Middle English win ( d ) wen (v.), Old English windwian, derivative of wind wind 1", "example": "The blasts of adversity were necessary to winnow the spurious and false away, and to leave the tried and true behind.", "synonym": "fan"}, {"word": "paraphernalia", "definitionA": "(sometimes used with a singular verb) equipment, apparatus, or furnishing used in or necessary for a particular activity:", "definitionB": "No definition found", "etymology": "1470–80; < Medieval Latin paraphernālia ( bona ) a bride's goods, beyond her dowry, equivalent to Late Latin paraphern ( a ) a bride's property (< Greek parápherna, equivalent to para- para- 1 + phern ( ḗ ) dowry, derivative of phérein to bear 1 + -a neuter plural noun suffix) + Latin -ālia, noun use of neuter plural of -ālis -al 1", "example": "From demonstrations and political paraphernalia on the podium to an athlete defecting at the Games, there’s been a marked increase in political activity in Tokyo over the past few days—but the Olympics have always been political.", "synonym": "accoutrements"}, {"word": "approbation", "definitionA": "approval; commendation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of approving; an assenting to the propriety of a thing with some degree of pleasure or satisfaction; approval, sanction, commendation or official recognition.<br>", "etymology": "1350–1400; Middle English (< Middle French ) < Latin approbātiōn- (stem of approbātiō ). See approbate, -ion", "example": "A commercial transaction does not confer ethical approbation on a customer.", "synonym": "admiration"}, {"word": "mendacious", "definitionA": "telling lies, especially habitually; dishonest; lying; untruthful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a person) Lying, untruthful or dishonest.<br>&nbsp;&nbsp;&nbsp;2. (of a statement, etc) False or untrue.<br>", "etymology": "1610–20; < Latin mendāci- ( mendacity ) + -ous", "example": "They created well-intentioned rules—which most mendacious lobbyists have found a way to ignore legally.", "synonym": null}, {"word": "juke", "definitionA": "to make a move intended to deceive (an opponent).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A roadside cafe or bar, especially one with dancing and sometimes prostitution.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To play dance music, or to dance, in a juke<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hit<br>&nbsp;&nbsp;&nbsp;2. To stab<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feint.<br>&nbsp;&nbsp;&nbsp;2. The neck of a bird.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deceive or outmaneuver someone using a feint, especially in American football or soccer<br>&nbsp;&nbsp;&nbsp;2. To bend the neck; to bow or duck the head.<br>", "etymology": "Spelling variant of jouk", "example": "In the South, the city boys are free to drive and party at the boozy juke joint on Saturday nights.", "synonym": "dark"}, {"word": "yuppie", "definitionA": "(often initial capital letter) a young, ambitious, and well-educated city-dweller who has a professional career and an affluent lifestyle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A young upwardly mobile urban professional person with an affluent lifestyle.<br>", "etymology": "First recorded in 1980–85, Americanism; y(oung) u(rban) p(rofessional) + -ie", "example": "It’s also an “American problem, a yuppie problem, a badge of success,” as Jill Lepore wrote in The New Yorker last year.", "synonym": "clone"}, {"word": "courier", "definitionA": "a messenger, usually traveling in haste, bearing urgent news, important reports or packages, diplomatic messages, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who looks after and guides tourists<br>&nbsp;&nbsp;&nbsp;2. A person who delivers messages<br>&nbsp;&nbsp;&nbsp;3. A company that delivers messages<br>&nbsp;&nbsp;&nbsp;4. A company that transports goods<br>&nbsp;&nbsp;&nbsp;5. A user who earns access to a topsite by uploading warez<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deliver by courier.<br>", "etymology": "1350–1400; < Middle French cour ( r ) ier < Italian corriere, equivalent to corr ( ere ) to run (< Latin currere ) + -iere < Latin -ārius -ary; replacing Middle English corour < Anglo-French cor ( i ) our, Old French coreor < Late Latin curritor runner; current, -tor", "example": "The couriers know the best routes through the city, but the trips take some minimum amount of time determined by the distance between the branches and archives, the courier’s top speed, and how many other couriers are on the road.", "synonym": "bearer"}, {"word": "snort", "definitionA": "(of animals) to force the breath violently through the nostrils with a loud, harsh sound:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sound made by exhaling or inhaling roughly through the nose.<br>&nbsp;&nbsp;&nbsp;2. A dose of a drug to be snorted. Here, \"drug\" includes snuff (i.e., pulverized tobacco).<br>&nbsp;&nbsp;&nbsp;3. A consumed portion of alcoholic drink.<br>&nbsp;&nbsp;&nbsp;4. A submarine snorkel.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a snort; to exhale roughly through the nose.<br>&nbsp;&nbsp;&nbsp;2. To express or force out by snorting.<br>&nbsp;&nbsp;&nbsp;3. To inhale (usually a drug) through the nose.<br>&nbsp;&nbsp;&nbsp;4. To snore.<br>&nbsp;&nbsp;&nbsp;5. (of submarines) To sail at periscope depth through the use of a snort or snorkel.<br>", "etymology": "1325–75; Middle English snorten (v.); probably akin to snore", "example": "Chronic snorers don’t usually realize when they sound like they’re sawing logs unless they do a big snort.", "synonym": "blow"}, {"word": "gimmick", "definitionA": "an ingenious or novel device, scheme, or stratagem, especially one designed to attract attention or increase appeal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trick or device used to attain some end.<br>&nbsp;&nbsp;&nbsp;2. A clever ploy or strategy.<br>&nbsp;&nbsp;&nbsp;3. A gimmick capacitor.<br>&nbsp;&nbsp;&nbsp;4. A night out with one's friends.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rig or set up with a trick or device.<br>", "etymology": "An Americanism dating back to 1925–30; origin uncertain", "example": "The best magic is not about a clever gimmick but telling a really good story.", "synonym": "aid"}, {"word": "gimcrack", "definitionA": "a showy, useless trifle; gewgaw.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something showy but worthless; a gimmick or bauble.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put together quickly and without much care; to bodge.<br>&nbsp;&nbsp;&nbsp;2. To embellish with gimcracks.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showy but of poor quality; worthless.<br>", "etymology": "1325–75 for earlier sense; Middle English gib ( e ) crake; compare Middle English gibben to waver (< Old French giber to shake)", "example": "About two-thirds of the masters have lost their heads, and are trying to produce a gimcrack copy of Eton.", "synonym": "bagatelle"}, {"word": "gewgaw", "definitionA": "something gaudy and useless; trinket; bauble.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A showy trifle, a toy; a showy trinket, ornament or decoration.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showy; unreal; pretentious.<br>", "etymology": "First recorded in 1175–1225; Middle English giuegaue; gradational compound of uncertain origin; perhaps akin to Middle French, French gogo (see (à) gogo )", "example": "Here again the gewgaw of royal parade was intended to entrap the admiration of the ignorant.", "synonym": "bagatelle"}, {"word": "egregious", "definitionA": "extraordinary in some bad way; glaring; flagrant:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Usually in a negative sense: conspicuous, exceptional, outstanding.<br>&nbsp;&nbsp;&nbsp;2. Outrageously bad; shocking.<br>", "etymology": "First recorded in 1525–35; from Latin ēgregius “preeminent, outstanding,” equivalent to ē- + greg-, stem of grēx “flock” + -ius adjective suffix; e- 1, -ous", "example": "After years of activists’ efforts to alert lawmakers to these egregious legal gaps, deepfakes are finally forcing them to pay attention.", "synonym": null}, {"word": "peep", "definitionA": "to look through a small opening or from a concealed location.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quiet sound, particularly one from a baby bird.<br>&nbsp;&nbsp;&nbsp;2. A feeble utterance or complaint.<br>&nbsp;&nbsp;&nbsp;3. The sound of a steam engine's whistle; typically shrill.<br>&nbsp;&nbsp;&nbsp;4. A kind of bird; a sandpiper.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a soft, shrill noise like a baby bird.<br>&nbsp;&nbsp;&nbsp;2. To speak briefly with a quiet voice.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quick look or glimpse, especially a furtive one.<br>&nbsp;&nbsp;&nbsp;2. The first partial appearance of something; a beginning to appear.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To look, especially through a narrow opening, or while trying not to be seen or noticed.<br>&nbsp;&nbsp;&nbsp;2. To begin to appear; to look forth from concealment; to make the first appearance.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A spot on a die or domino.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Person.<br>", "etymology": "First recorded in 1425–75; late Middle English pepe; assimilated variant of peek", "example": "Instead, Mayor Todd Gloria took over in December, and his first 100 days passed without a peep about the project.", "synonym": "chatter"}, {"word": "explicate", "definitionA": "to make plain or clear; explain; interpret.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To explain meticulously or in great detail; to elucidate; to analyze.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Evolved; unfolded.<br>", "etymology": "1525–35; < Latin explicātus unfolded, set forth, past participle of explicāre, equivalent to ex- ex- 1 + plicāre to fold; -ate 1", "example": "How he can wield such a weapon, or have modified it to serve his own aims, is never suitably explicated, nor is the reason why John is so wildly hung up on remaking the world by eliminating the human urge for deception.", "synonym": "construe"}, {"word": "craven", "definitionA": "cowardly; contemptibly timid; pusillanimous.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A coward.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make craven.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to fight; lacking even the rudiments of courage; extremely cowardly.<br>", "etymology": "1175–1225; Middle English cravant, cravaunde defeated < Old French craventé, past participle of cravanter to crush, overwhelm (< Vulgar Latin *crepantāre ), influenced by Middle English creaunt defeated ( recreant )", "example": "In that, her legacy is in very, very safe territory in a city otherwise occupied by craven opportunists.", "synonym": "chicken"}, {"word": "enlighten", "definitionA": "to give intellectual or spiritual light to; instruct; impart knowledge to:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To supply with light.<br>&nbsp;&nbsp;&nbsp;2. To make something clear to (someone); to give knowledge or understanding to.<br>", "etymology": "First recorded in 1350–1400; Middle English enli(g)htenen; en- 1, lighten 1", "example": "This guide is meant to enlighten your search for the best night-vision goggles.", "synonym": "apprise"}]