[{"word": "dominion", "definitionA": "the power or right of governing and controlling; sovereign authority.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Power or the use of power; sovereignty over something; stewardship, supremacy.<br>&nbsp;&nbsp;&nbsp;2. Predominance; ascendancy<br>&nbsp;&nbsp;&nbsp;3. (sometimes figurative) A kingdom, nation, or other sphere of influence; governed territory.<br>&nbsp;&nbsp;&nbsp;4. An order of angel in Christian angelology, ranked above virtues and below thrones.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Middle French, from Medieval Latin dominiōn- (unrecorded), stem of dominiō (unrecorded) “lordship,” from Latin domin(ium) dominium + -iō -ion", "example": "The deity in this case is the one who has dominion over the lottery.", "synonym": "ascendancy"}, {"word": "lollygag", "definitionA": "to spend time idly; loaf.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Silliness, nonsense.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dawdle; to be lazy or idle; to avoid necessary work or effort.<br>&nbsp;&nbsp;&nbsp;2. (19th-20th centuries) To fool around, especially sexually.<br>", "etymology": "An Americanism dating back to 1860–65; origin uncertain", "example": "Workers lollygag, die of dehydration and exhaustion, and revolt.", "synonym": "grovel"}, {"word": "dawdle", "definitionA": "to waste time; idle; trifle; loiter:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dawdler.<br>&nbsp;&nbsp;&nbsp;2. A slow walk, journey.<br>&nbsp;&nbsp;&nbsp;3. An easily accomplished task; a doddle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To spend time idly and unfruitfully, to waste time.<br>&nbsp;&nbsp;&nbsp;2. To spend (time) without haste or purpose.<br>&nbsp;&nbsp;&nbsp;3. To move or walk lackadaisically.<br>", "etymology": "First recorded in 1650–60; variant of daddle “to toddle”", "example": "In thus dawdling away their time they show a strange inconsistency – at one and the same time loving indolence and hating peace.", "synonym": "amble"}, {"word": "tomfoolery", "definitionA": "foolish or silly behavior; tomfoolishness.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Foolish behaviour or speech.<br>&nbsp;&nbsp;&nbsp;2. Jewellery.<br>", "etymology": "First recorded in 1805–15; tomfool + -ery", "example": "I ought to be above feeling annoyed at this tomfoolery—but these conjuring fellows go too far.", "synonym": "absurdity"}, {"word": "tomfool", "definitionA": "a grossly foolish or stupid person; a silly fool.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A silly or stupid person, especially a boy or man.<br>&nbsp;&nbsp;&nbsp;2. Any of various tyrant flycatchers viewed as foolishly confiding.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act foolishly.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Silly or stupid.<br>", "etymology": "1325–75; Middle English Thome fole Tom the fool", "example": "Danged if iver I see sech tomfool notions as he's took up with in all my born days!", "synonym": "absurd"}, {"word": "exceedingly", "definitionA": "to an unusual degree; very; extremely:", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. To a great or unusual degree, extent, etc.; extremely<br>", "etymology": "1425–75; late Middle English. See exceeding, -ly", "example": "Of the 9,000 people who have reported a side effect—which is exceedingly less than 1 percent of the people who have been vaccinated—the bulk of those reports were fatigue, nausea, chills, and headaches.", "synonym": null}, {"word": "gag", "definitionA": "to stop up the mouth of (a person) by putting something in it, thus preventing speech, shouts, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device to restrain speech, such as a rag in the mouth secured with tape or a rubber ball threaded onto a cord or strap.<br>&nbsp;&nbsp;&nbsp;2. An order or rule forbidding discussion of a case or subject.<br>&nbsp;&nbsp;&nbsp;3. A joke or other mischievous prank.<br>&nbsp;&nbsp;&nbsp;4. A device or trick used to create a practical effect; a gimmick<br>&nbsp;&nbsp;&nbsp;5. A convulsion of the upper digestive tract.<br>&nbsp;&nbsp;&nbsp;6. A mouthful that makes one retch or choke.<br>&nbsp;&nbsp;&nbsp;7. Mycteroperca microlepis, a species of grouper.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To experience the vomiting reflex.<br>&nbsp;&nbsp;&nbsp;2. To cause to heave with nausea.<br>&nbsp;&nbsp;&nbsp;3. To restrain someone's speech by blocking his or her mouth.<br>&nbsp;&nbsp;&nbsp;4. To pry or hold open by means of a gag.<br>&nbsp;&nbsp;&nbsp;5. To restrain someone's speech without using physical means.<br>&nbsp;&nbsp;&nbsp;6. To choke; to retch.<br>&nbsp;&nbsp;&nbsp;7. To deceive (someone); to con.<br>", "etymology": "First recorded in 1400–50; late Middle English gaggen “to strangle, suffocate”; perhaps imitative of the sound made in choking; compare Old Norse adjective gag-háls “with the neck thrown back”", "example": "The movie was bursting with brilliant visual and verbal gags that paid irreverent tribute to Universal Studios horror films such as “Frankenstein” with Boris Karloff and “Dracula” with Bela Lugosi.", "synonym": "crack"}, {"word": "jackdaw", "definitionA": "a glossy, black, European bird, Corvus monedula, of the crow family, that nests in towers, ruins, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A European bird (Coloeus monedula) of the crow family, often nesting in church towers and ruins.<br>&nbsp;&nbsp;&nbsp;2. A Daurian jackdaw, a closely related Asian bird (Coloeus dauuricus).<br>", "etymology": "First recorded in 1535–45; jack 1 + daw", "example": "Every morning an old jackdaw perched on a chimney outside our skylight, and entertained us with his chatter.", "synonym": null}, {"word": "daw", "definitionA": "jackdaw.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A western jackdaw, Coloeus monedula, a passerine bird in the crow family (Corvidae), more commonly called jackdaw.<br>&nbsp;&nbsp;&nbsp;2. An idiot, a simpleton; fool.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (obsolete outside Scotland) To dawn.<br>&nbsp;&nbsp;&nbsp;2. To wake (someone) up.<br>&nbsp;&nbsp;&nbsp;3. To daunt; to terrify.<br>", "etymology": "1400–50; late Middle English dawe; compare Old High German taha", "example": "Most of the time, however, someone talking about what DAW they use is describing a sophisticated, deeply featured software program for capturing, creating, and sequencing audio.", "synonym": null}, {"word": "toft", "definitionA": "the site of a house and outbuildings.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hillock.<br>&nbsp;&nbsp;&nbsp;2. A homestead, especially one on a hill.<br>&nbsp;&nbsp;&nbsp;3. A messuage with right of common.<br>", "etymology": "before 1050; Middle English, late Old English < ?", "example": "\"That you never will,\" exclaimed a voice behind him; and Toft, turning round, again met the glance of Peter.", "synonym": null}]