[{"word": "bevy", "definitionA": "a group of birds, as larks or quail, or animals, as roebuck, in close association.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (collective) A group of animals, in particular quail.<br>&nbsp;&nbsp;&nbsp;2. (collective) A group of women.<br>&nbsp;&nbsp;&nbsp;3. (collective) A large group or collection.<br>", "etymology": "First recorded in 1400–50; late Middle English bevey, of obscure origin", "example": "Since the “mansion tax” took effect last April, a bevy of groups have aired their grievances.", "synonym": "assembly"}, {"word": "wonky", "definitionA": "(of a person) shaky, groggy, or unsteady.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A subgenre of electronic music employing unstable rhythms, complex time signatures, and mid-range synths.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lopsided, misaligned or off-centre.<br>&nbsp;&nbsp;&nbsp;2. Feeble, shaky or rickety.<br>&nbsp;&nbsp;&nbsp;3. (especially Usenet) Suffering from intermittent bugs.<br>&nbsp;&nbsp;&nbsp;4. Generally incorrect.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Technically worded, in the style of jargon.<br>", "etymology": "First recorded in 1915–20; perhaps variant of dialectal wanky, equivalent to wank(le) ( Middle English wankel, Old English wancol; wench ) + -y 1", "example": "Measure G didn’t grab as much attention as others, but the wonky reform package could help Los Angeles County make progress on its jail, homelessness and more.", "synonym": "crooked"}, {"word": "hypnosis", "definitionA": "an artificially induced trance state resembling sleep, characterized by heightened susceptibility to suggestion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trancelike state, artificially induced, in which a person has a heightened suggestibility, and in which suppressed memories may be experienced.<br>&nbsp;&nbsp;&nbsp;2. The art or skill of hypnotism.<br>", "etymology": "First recorded in 1875–80; hypn(otic) + -osis", "example": "Self-help videos offered advice on relationships, wellness, business success and spirituality - including hypnosis, meditation and exercise programmes.", "synonym": "analgesic"}, {"word": "cubicle", "definitionA": "a small space or compartment partitioned off.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small separate part or one of the compartments of a room, especially in a work environment.<br>&nbsp;&nbsp;&nbsp;2. A small enclosure at a swimming pool etc. used to provide personal privacy when changing.<br>&nbsp;&nbsp;&nbsp;3. A small enclosure in a public toilet for individual use.<br>", "etymology": "1400–50; late Middle English < Latin cubiculum bedroom, equivalent to cub ( āre ) to lie down + -i- -i- + -culum -cle 2", "example": "“It just feels like I’m walking into a cubicle with a Dell computer that I don’t know how to work,” she says with a laugh.", "synonym": "cubbyhole"}, {"word": "pectinate", "definitionA": "formed into or having closely parallel, toothlike projections that resemble the teeth of a comb.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ester or salt formed of pectinic acid.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Resembling a comb.<br>&nbsp;&nbsp;&nbsp;2. Having segments which are greatly lengthened to one side.<br>&nbsp;&nbsp;&nbsp;3. Striate<br>", "etymology": "First recorded in 1785–95; from Latin pectinātus, past participle of pectināre “to comb, rake” equivalent to pectin-, stem of pecten “comb, rake” + -ātus past participle suffix; pecten, -ate 1", "example": "Previous analyses have tended to arrange parvipelvians in a pectinate arrangement: that is, where each taxon represents an additional step on a phylogenetic tree that has ophthalmosaurids at its ‘tip’.", "synonym": null}, {"word": "zippy", "definitionA": "lively; peppy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Energetic and lively.<br>&nbsp;&nbsp;&nbsp;2. Quick, speedy.<br>", "etymology": "First recorded in 1915–20; zip 1 + -y 1", "example": "A garlicky, creamy yogurt sauce spiked with even more za’atar would add a tangy, zippy flourish right at the end.", "synonym": null}, {"word": "bunker", "definitionA": "a large bin or receptacle; a fixed chest or box:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hardened shelter, often buried partly or fully underground, designed to protect the inhabitants from falling bombs or other attacks.<br>&nbsp;&nbsp;&nbsp;2. A large container or bin for storing coal, often built outside in the yard of a house. Now rare, as different types of fuels and energy sources are being used.<br>&nbsp;&nbsp;&nbsp;3. A container for storing coal or fuel oil for a ship's engine. [Also, by extension] the quantity of fuel needed to replenish that container.<br>&nbsp;&nbsp;&nbsp;4. The coal compartment on a tank engine.<br>&nbsp;&nbsp;&nbsp;5. A sand-filled hollow on a golf course.<br>&nbsp;&nbsp;&nbsp;6. An obstacle used to block an opposing player's view and field of fire.<br>&nbsp;&nbsp;&nbsp;7. A sort of chest or box, as in a window, the lid of which serves for a seat.<br>&nbsp;&nbsp;&nbsp;8. A kitchen worktop.<br>&nbsp;&nbsp;&nbsp;9. One who bunks off; a truant from school.<br>&nbsp;&nbsp;&nbsp;10. Certain fish, menhaden.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To load a vessel with oil or coal for the engine.<br>&nbsp;&nbsp;&nbsp;2. To hit a golf ball into a bunker.<br>&nbsp;&nbsp;&nbsp;3. To fire constantly at a hiding opponent, preventing them from firing at other players and trapping them behind the barrier. This can also refer to eliminating an opponent behind cover by rushing the position and firing at extremely close range as the player becomes exposed.<br>", "etymology": "First recorded in 1750–60; earlier bonkar ( Scots ) “box, chest, serving also as a seat,” of obscure origin", "example": "These missiles, which are launched from an aircraft, fly close to the speed of sound and carry highly explosive warheads making them an ideal weapon for penetrating Russian bunkers and ammunition stores.", "synonym": "blockhouse"}, {"word": "pectoral", "definitionA": "of, in, on, or pertaining to the chest or breast; thoracic.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pectoral fin.<br>&nbsp;&nbsp;&nbsp;2. Protective armor for a horse's breast.<br>&nbsp;&nbsp;&nbsp;3. A covering or protection for the breast.<br>&nbsp;&nbsp;&nbsp;4. A breastplate, especially that worn by the Jewish high priest.<br>&nbsp;&nbsp;&nbsp;5. A clasp, cross, or ornamental square of cloth etc. worn upon the breast.<br>&nbsp;&nbsp;&nbsp;6. A medicine for diseases of the chest organs, especially the lungs.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to the breast, or chest.<br>&nbsp;&nbsp;&nbsp;2. Relating to, or good for, diseases of the chest or lungs.<br>&nbsp;&nbsp;&nbsp;3. Having the breast conspicuously colored.<br>", "etymology": "1400–50; (noun) late Middle English < Latin pectorāle, noun use of neuter of pectorālis of the breast ( pector-, stem of pectus breast + -ālis -al 1 ); (adj.) < Latin pectorālis", "example": "On offense, left tackle Rashawn Slater was sidelined with a strained pectoral muscle.", "synonym": null}, {"word": "expectorate", "definitionA": "to eject or expel matter, as phlegm, from the throat or lungs by coughing or hawking and spitting; spit.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cough up fluid from the lungs.<br>&nbsp;&nbsp;&nbsp;2. To spit.<br>", "etymology": "1595–1605; < Latin expectorātus (past participle of expectorāre to expel from the breast), equivalent to ex- ex- 1 + pector- (stem of pectus ) breast + -ātus -ate 1", "example": "Others freely hissed, booed, cheered, stamped, applauded, threw things, ate, talked and expectorated their way through performances.", "synonym": "hawk"}, {"word": "parapet", "definitionA": "Fortification.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low protective wall.<br>&nbsp;&nbsp;&nbsp;2. Part of a perimeter that extends above the roof.<br>&nbsp;&nbsp;&nbsp;3. A fortification consisting of a wall.<br>", "etymology": "1575–85; < Italian parapetto, equivalent to para- para- 2 + petto chest, breast < Latin pectus", "example": "\"It's just under the parapet. It's not gone away.\"", "synonym": "barricade"}]