[{"word": "qualm", "definitionA": "an uneasy feeling or pang of conscience as to conduct; compunction:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feeling of apprehension, doubt, fear etc.<br>&nbsp;&nbsp;&nbsp;2. A sudden sickly feeling; queasiness.<br>&nbsp;&nbsp;&nbsp;3. A prick of the conscience; a moral scruple, a pang of guilt. (Now often in negative constructions.)<br>&nbsp;&nbsp;&nbsp;4. Mortality; plague; pestilence.<br>&nbsp;&nbsp;&nbsp;5. A calamity or disaster.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a sickly feeling.<br>", "etymology": "First recorded in 1520–30; origin uncertain", "example": "But one senior former intelligence official told Politico that allies like Israel would still have \"serious qualms\" about Gabbard.", "synonym": "agitation"}, {"word": "epicure", "definitionA": "a person who cultivates a refined taste, especially in food and wine; connoisseur.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who takes particular pleasure in fine food and drink.<br>", "etymology": "1350–1400 for earlier sense; 1555–65  epicure fordef 2; Middle English Epicures, Epicureis Epicureans (plural) < Latin Epicūrēus (singular) ( epicurean )", "example": "As French epicure Jean Anthelme Brillat-Savarin famously put it, “Tell me what you eat: I will tell you what you are.”", "synonym": "connoisseur"}, {"word": "eluvium", "definitionA": "a deposit of soil, dust, etc., formed from the decomposition of rock and found in its place of origin.", "definitionB": "No definition found", "etymology": "1880–85; formed on the model of alluvium from Latin ēluere (of water) to wash out (soil, etc.); elute", "example": "And on “Dusk Tempi,” Eluvium laces violin through intricate layers of bat calls, stretched and stacked to conjure the radiant skies of twilight.", "synonym": null}, {"word": "antinomy", "definitionA": "opposition between one law, principle, rule, etc., and another.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An apparent contradiction between valid conclusions; a paradox<br>", "etymology": "1585–95; < Latin antinomia < Greek antinomía a contradiction between laws. See anti-, -nomy", "example": "Philosophers similarly examined the antinomy of the individual and the group, shaped by the periods of history and the dialectic.", "synonym": "antithesis"}, {"word": "heteronomy", "definitionA": "the condition of being under the domination of an outside authority, either human or divine.", "definitionB": "No definition found", "etymology": "First recorded in 1815–25; hetero- + -nomy", "example": "“Heteronomy” is therefore applied by Kant to all other ethical systems, inasmuch as they place the individual in subjection to external laws of conduct.", "synonym": null}, {"word": "queasy", "definitionA": "inclined to or feeling nausea, as the stomach, a person, etc.; nauseous; nauseated.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Experiencing or causing nausea or uneasiness, often characterized by an unsettled stomach.<br>&nbsp;&nbsp;&nbsp;2. Easily troubled; squeamish.<br>", "etymology": "First recorded in 1425–75; late Middle English qweysy, coisi, of uncertain origin", "example": "No matter how historically significant the subject is, that kind of framing will only ever be queasy.", "synonym": null}, {"word": "squeamish", "definitionA": "fastidious or dainty.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Easily bothered or upset; tending to be nauseated or nervous; oversensitive<br>&nbsp;&nbsp;&nbsp;2. Averse or reluctant<br>", "etymology": "First recorded in 1450–1500; late Middle English squaymysch, squaimish(e), alteration of squemes, squaymes, squaimous, squaymous “easily nauseated, nauseating, fastidious,” from Anglo-French escoimus, escoymous; further origin uncertain", "example": "This was Rivers unplugged, foul-mouthed in a way that made me feel like a squeamish altar boy.", "synonym": null}, {"word": "forsake", "definitionA": "to quit or leave entirely; abandon; desert:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To abandon, to give up, to leave (permanently), to renounce.<br>", "etymology": "First recorded before 900; Middle English forsaken “to deny, reject,” Old English forsacan, equivalent to for- prefix meaning “away, off” + sacan “to dispute”; for-", "example": "I was part of that generation of Latinos who forsook the Republican Party.", "synonym": "abdicate"}, {"word": "mirth", "definitionA": "gaiety or jollity, especially when accompanied by laughter:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The emotion usually following humour and accompanied by laughter; merriment; jollity; gaiety.<br>&nbsp;&nbsp;&nbsp;2. That which causes merriment.<br>", "etymology": "First recorded before 900; Middle English mirthe, Old English myrgth. See merry, -th 1", "example": "The book by Jay Thompson, Marshall Barer and Dean Fuller, which infuses vaudevillian mirth into “The Princess and the Pea,” has been updated by Amy Sherman-Palladino to be more in keeping with contemporary sensitivities.", "synonym": "amusement"}, {"word": "diaspora", "definitionA": "Usually Diaspora. the scattering of the Jews to countries outside of ancient Palestine after the Babylonian captivity.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The dispersion of the Jews among the Gentiles after the Babylonian captivity (6th century B.C.E.).<br>&nbsp;&nbsp;&nbsp;2. (by extension) Any similar dispersion.<br>&nbsp;&nbsp;&nbsp;3. (collective) A group so dispersed, especially Jews outside of the land of Israel.<br>&nbsp;&nbsp;&nbsp;4. The regions where such a dispersed group (especially the Jews) resides, taken collectively.<br>&nbsp;&nbsp;&nbsp;5. Any dispersion of an originally homogeneous entity, such as a language or culture.<br>", "etymology": "First recorded in 1690–1700; from Greek diasporá “scattering, dispersion”; dia-, spore", "example": "Britain has a small, but fast-growing Hispanic diaspora.", "synonym": "disbandment"}]