[{"word": "nimbus", "definitionA": "Classical Mythology. a shining cloud sometimes surrounding a deity when on earth.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A circle of light; a halo.<br>&nbsp;&nbsp;&nbsp;2. A gray rain cloud.<br>", "etymology": "First recorded in 1600–10; from Latin, “rainstorm, rain cloud, thundercloud, cloud”; akin to Latin nebula and Greek nephélē, néphos “cloud,” and Slavic ( Polish ) niebo “sky, heaven”", "example": null, "synonym": "atmosphere"}, {"word": "chutzpah", "definitionA": "informal. shameless audacity; impudence", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nearly arrogant courage; utter audacity, effrontery or impudence; supreme self-confidence; exaggerated self-opinion.<br>", "etymology": "C20: from Yiddish", "example": null, "synonym": "backbone"}, {"word": "fascine", "definitionA": "a long bundle of sticks bound together, used in building earthworks and batteries and in strengthening ramparts.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (fortification) A cylindrical bundle of small sticks of wood, bound together, used in raising batteries, filling ditches, strengthening ramparts, and making parapets; also in revetments for river banks, and in mats for dams, jetties, etc.<br>", "etymology": "1680–90; < French < Latin fascīna bundle of sticks. See fasces, -ine 1", "example": null, "synonym": null}, {"word": "wrangle", "definitionA": "to argue or dispute, especially in a noisy or angry manner.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of wrangling.<br>&nbsp;&nbsp;&nbsp;2. An angry dispute.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bicker, or quarrel angrily and noisily.<br>&nbsp;&nbsp;&nbsp;2. To herd (horses or other livestock); to supervise, manage (people).<br>&nbsp;&nbsp;&nbsp;3. To involve in a quarrel or dispute; to embroil.<br>", "etymology": "1350–1400; Middle English, apparently < Low German wrangeln, frequentative of wrangen to struggle, make an uproar; akin to wring", "example": null, "synonym": "blowup"}, {"word": "forlorn", "definitionA": "desolate or dreary; unhappy or miserable, as in feeling, condition, or appearance.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To abandon, forsake.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A forlorn hope.<br>&nbsp;&nbsp;&nbsp;2. A member of a forlorn hope.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abandoned, deserted, left behind.<br>&nbsp;&nbsp;&nbsp;2. Miserable, as when lonely after being abandoned.<br>&nbsp;&nbsp;&nbsp;3. Unlikely to succeed; hopeless.<br>", "etymology": "First recorded before 1150; Middle English foreloren “lost completely,” past participle of forlesen “to lose completely,” Old English forlēosan; cognate with Old High German firliosan ( German verlieren ), Gothic fraliusan; equivalent to for- + lorn", "example": null, "synonym": null}, {"word": "snub", "definitionA": "to treat with disdain or contempt, especially by ignoring.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A deliberate affront or slight.<br>&nbsp;&nbsp;&nbsp;2. A sudden checking of a cable or rope.<br>&nbsp;&nbsp;&nbsp;3. A knot; a protuberance; a snag.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To slight, ignore or behave coldly toward someone.<br>&nbsp;&nbsp;&nbsp;2. To turn down; to dismiss.<br>&nbsp;&nbsp;&nbsp;3. To check; to reprimand.<br>&nbsp;&nbsp;&nbsp;4. To stub out (a cigarette etc).<br>&nbsp;&nbsp;&nbsp;5. To halt the movement of a rope etc by turning it about a cleat or bollard etc; to secure a vessel in this manner.<br>&nbsp;&nbsp;&nbsp;6. To clip or break off the end of; to check or stunt the growth of.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Conspicuously short.<br>&nbsp;&nbsp;&nbsp;2. Of the nose: flat and broad, with the end slightly turned up.<br>&nbsp;&nbsp;&nbsp;3. (of a polyhedron) Derived from a simpler polyhedron by the addition of extra triangular faces.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sob with convulsions.<br>", "etymology": "First recorded in 1300–50; Middle English snubben, from Old Norse snubba “to scold, reprimand”; cognate with Middle Low German snūben", "example": null, "synonym": "burr"}, {"word": "rambunctious", "definitionA": "difficult to control or handle; wildly boisterous:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Boisterous, energetic, noisy, and difficult to control.<br>", "etymology": "An Americanism dating back to 1820–30; origin uncertain", "example": null, "synonym": "loud"}, {"word": "unanimity ", "definitionA": "the state or quality of being unanimous; a consensus or undivided opinion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The condition of agreement by all parties, the state of being unanimous.<br>", "etymology": "400–50; late Middle English unanimite < Middle French < Latin ūnanimitās, equivalent to ūnanim ( us ) unanimous + -itās -ity", "example": null, "synonym": "accord"}, {"word": "implausible ", "definitionA": "not plausible; not having the appearance of truth or credibility:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not plausible; unlikely; dubious.<br>", "etymology": "irst recorded in 1595–1605; im- 2 + plausible", "example": null, "synonym": null}, {"word": "reciprocal", "definitionA": "given or felt by each toward the other; mutual:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The number obtained by dividing 1 by another given number; the result of exchanging the numerator and the denominator of a fraction.<br>&nbsp;&nbsp;&nbsp;2. (grammar) A construction expressing mutual action.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a feeling, action or such: mutual, uniformly felt or done by each party towards the other or others; two-way.<br>&nbsp;&nbsp;&nbsp;2. Mutually interchangeable.<br>&nbsp;&nbsp;&nbsp;3. (grammar) expressing mutual action, applied to pronouns and verbs; also in a broad sense: reflexive<br>&nbsp;&nbsp;&nbsp;4. Used to denote different kinds of mutual relation; often with reference to the substitution of reciprocals for given quantities.<br>&nbsp;&nbsp;&nbsp;5. Done, given, felt, or owed in return<br>", "etymology": "First recorded in 1560–70; from Latin reciproc(us) “returning, reciprocal” + -al 1", "example": "There was reciprocal admiration between the celebrated Bruin and his successors.", "synonym": "companion"}, {"word": "afoul", "definitionA": "in a state of collision or entanglement:", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. (principally nautical) In a state of collision or entanglement.<br>&nbsp;&nbsp;&nbsp;2. (with of) In a state of entanglement or conflict (with).<br>", "etymology": "An Americanism dating back to 1800–10; a- 1 + foul", "example": null, "synonym": null}, {"word": "constellation", "definitionA": "Astronomy. any of various groups of stars to which definite names have been given, as Ursa Major, Ursa Minor, Boötes, Cancer, Orion", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An asterism, an arbitrary formation of stars perceived as a figure or pattern, or a division of the sky including it, especially one officially recognised by astronomers.<br>&nbsp;&nbsp;&nbsp;2. An image associated with a group of stars.<br>&nbsp;&nbsp;&nbsp;3. The configuration of planets at a given time (notably of birth), as used for determining a horoscope.<br>&nbsp;&nbsp;&nbsp;4. A wide, seemingly unlimited assortment.<br>&nbsp;&nbsp;&nbsp;5. A fleet of satellites of the same purpose (such as the set of GPS satellites, or Iridium satcom fleet).<br>&nbsp;&nbsp;&nbsp;6. A configuration or grouping.<br>&nbsp;&nbsp;&nbsp;7. A network of connections that exists between people who are in polyamorous relationships, for example between one person, their partner, and that person's partner.<br>", "etymology": "1275–1325; Middle English constellacioun (< Anglo-French ) < Late Latin constellātiōn- (stem of constellātiō ). See constellate, -ion", "example": null, "synonym": "afterlife"}, {"word": "cusp", "definitionA": "a point that marks the beginning of a change:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sharp point or pointed end.<br>&nbsp;&nbsp;&nbsp;2. An important moment when a decision is made that will determine future events.<br>&nbsp;&nbsp;&nbsp;3. A point of a curve where the curve is continuous but has no derivative, but such that it has a derivative at every nearby point.<br>&nbsp;&nbsp;&nbsp;4. A point made by the intersection of two curved lines or curved structures, a common motif in Gothic architecture.<br>&nbsp;&nbsp;&nbsp;5. A boundary between zodiacal signs and houses.<br>&nbsp;&nbsp;&nbsp;6. Any of the pointed parts of a canine tooth or molar.<br>&nbsp;&nbsp;&nbsp;7. A flap of a valve of a heart or blood vessel.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To behave in a reckless or dangerous manner.<br>", "etymology": "First recorded in 1575–85, from Latin cuspis “a point”", "example": null, "synonym": "angle"}, {"word": "clump", "definitionA": "a small, close group or cluster, especially of trees or other plants.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cluster or lump; an unshaped piece or mass.<br>&nbsp;&nbsp;&nbsp;2. A thick group or bunch, especially of bushes or hair.<br>&nbsp;&nbsp;&nbsp;3. A dull thud.<br>&nbsp;&nbsp;&nbsp;4. The compressed clay of coal strata.<br>&nbsp;&nbsp;&nbsp;5. A small group of trees or plants.<br>&nbsp;&nbsp;&nbsp;6. A thick addition to the sole of a shoe.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To form clusters or lumps.<br>&nbsp;&nbsp;&nbsp;2. To gather in dense groups.<br>&nbsp;&nbsp;&nbsp;3. To walk with heavy footfalls.<br>&nbsp;&nbsp;&nbsp;4. To strike; to beat.<br>", "etymology": "First recorded in 1580–90; akin to Dutch klompe “lump, mass,” Old English clympre “lump of metal”", "example": null, "synonym": "array"}, {"word": "flounder", "definitionA": "to struggle with stumbling or plunging movements (usually followed by about, along, on, through, etc.):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A European species of flatfish having dull brown colouring with reddish-brown blotches; fluke, European flounder, Platichthys flesus.<br>&nbsp;&nbsp;&nbsp;2. Any of various flatfish of the family Pleuronectidae or Bothidae.<br>&nbsp;&nbsp;&nbsp;3. A bootmaker's tool for crimping boot fronts.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To flop around as a fish out of water.<br>&nbsp;&nbsp;&nbsp;2. To make clumsy attempts to move or regain one's balance.<br>&nbsp;&nbsp;&nbsp;3. To act clumsily or confused; to struggle or be flustered.<br>&nbsp;&nbsp;&nbsp;4. To be in serious difficulty.<br>", "etymology": "First recorded in 1570–80; perhaps blend of flounce 1 and founder 2", "example": null, "synonym": "blunder"}, {"word": "jabberwocky", "definitionA": "a playful imitation of language consisting of invented, meaningless words; nonsense; gibberish.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Invented or meaningless language; nonsense<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Meaningless, worthless<br>&nbsp;&nbsp;&nbsp;2. Absurd, nonsense, nonsensical<br>", "etymology": "Coined in 1871 by Lewis Carroll ( def ) in “Jabberwocky,” poem in Through the Looking Glass; nonsensical formation perhaps inspired by jabber ( def ); claimed around 1883 by Carroll to mean “the result of much excited and voluble discussion” and derive from jabber + Old English wocer, wocor “fruit, offspring,” also “increase, usury”", "example": null, "synonym": "blather"}, {"word": "prosaic", "definitionA": "commonplace or dull; matter-of-fact or unimaginative:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to or having the characteristics of prose.<br>&nbsp;&nbsp;&nbsp;2. (of writing or speaking) Straightforward; matter-of-fact; lacking the feeling or elegance of poetry.<br>&nbsp;&nbsp;&nbsp;3. (main usage, usually of writing or speaking but also figurative) Overly plain, simple or commonplace, to the point of being boring.<br>", "etymology": "First recorded in 1650–60, prosaic is from the Late Latin word prōsaicus. See prose, -ic", "example": null, "synonym": null}, {"word": "megalomaniac", "definitionA": "a person who has megalomania.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One affected with or exhibiting megalomania.<br>", "etymology": "First recorded in 1885–90; megalo- + maniac", "example": null, "synonym": "egoistic"}]