[{"word": "vitiate", "definitionA": "to impair the quality of; make faulty; spoil.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To spoil, make faulty; to reduce the value, quality, or effectiveness of something<br>&nbsp;&nbsp;&nbsp;2. To debase or morally corrupt<br>&nbsp;&nbsp;&nbsp;3. To violate, to rape<br>&nbsp;&nbsp;&nbsp;4. To make something ineffective, to invalidate<br>", "etymology": "First recorded in 1525–35; from Latin vitiātus, past participle of vitiāre “to spoil, impair,” derivative of vitium “blemish, defect, fault” + -ātus; vice 1, -ate 1", "example": "The result will be provisions that are watered down or loopholes that vitiate key provisions altogether.", "synonym": "abate"}, {"word": "seismic", "definitionA": "pertaining to, of the nature of, or caused by an earthquake or vibration of the earth, whether due to natural or artificial causes.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Related to, or caused by an earthquake or other vibration of the Earth.<br>&nbsp;&nbsp;&nbsp;2. Of very large or widespread effect.<br>", "etymology": "First recorded in 1855–60; seism + -ic", "example": "Previous studies have noted that CO2 tends to escape Earth in seismic hot spots.", "synonym": "quaky"}, {"word": "fragrance", "definitionA": "the quality of being fragrant; a sweet or pleasing scent.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pleasant smell or odour.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To apply a fragrance to; to perfume.<br>", "etymology": "First recorded in 1660–70; from French, from Late Latin frāgrantia. See fragrant, -ance", "example": null, "synonym": "aroma"}, {"word": "foremost", "definitionA": "first in place, order, rank, etc.:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. First, either in time or in space<br>&nbsp;&nbsp;&nbsp;2. Most forward; front<br>&nbsp;&nbsp;&nbsp;3. Of a higher rank or position; paramount<br>&nbsp;&nbsp;&nbsp;4. Closest to the bow<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. In front<br>&nbsp;&nbsp;&nbsp;2. Prominently forward<br>&nbsp;&nbsp;&nbsp;3. Especially; particularly<br>", "etymology": "before 1000; fore 1 + -most; replacing Middle English, Old English formest, equivalent to form ( a ) first, variant of fruma (compare Latin prīmus ) + -est -est 1", "example": null, "synonym": null}, {"word": "malinger", "definitionA": "to pretend illness, especially in order to shirk one's duty, avoid work, etc.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To feign illness, injury, or incapacitation in order to avoid work, obligation, or perilous risk.<br>&nbsp;&nbsp;&nbsp;2. To self-inflict real injury or infection (to inflict self-harm) in order to avoid work, obligation, or perilous risk.<br>", "etymology": "First recorded in 1810–20; from French malingre “sickly, ailing,” equivalent to mal- “bad, ill” + Old French heingre “haggard” (perhaps from Germanic ); mal-", "example": "It was quick work; but Bowles had a college education—he had been only six hours a cowboy when he learned to malinger on the job.", "synonym": "dodge"}, {"word": "preternatural", "definitionA": "out of the ordinary course of nature; exceptional or abnormal:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Beyond or not conforming to what is natural or according to the regular course of things; strange.<br>&nbsp;&nbsp;&nbsp;2. Having an existence outside of the natural world.<br>", "etymology": "First recorded in 1570–80; from Medieval Latin praeternātūrālis, adjective based on Latin phrase praeter nātūram “beyond nature”; preter-, natural", "example": "An activist conservative and preternatural salesman, he drew national attention for his work on health care and welfare policy.", "synonym": null}, {"word": "preterit", "definitionA": "in English, the simple past, or an instance or form of a specific verb in the simple past, such as ate or walked.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (grammar) The preterite tense, simple past tense: the grammatical tense that determines the specific initiation or termination of an action in the past.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (grammar, of a tense) showing an action at a determined moment in the past.<br>&nbsp;&nbsp;&nbsp;2. Belonging wholly to the past; passed by.<br>", "etymology": "First recorded in 1300–50; Middle English, from Latin praeteritus “past, gone by,” past participle of praeterīre “to go by,” from praeter- preter- + īre “to go”; as tense name, from Latin (tempus) praeteritum “(time) past”", "example": "The passive voice is formed by joining the participle preterit to the substantive verb, as I am loved.", "synonym": null}, {"word": "postnuptial", "definitionA": "subsequent to marriage:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Subsequent to marriage.<br>", "etymology": "First recorded in 1800–10; post- + nuptial", "example": null, "synonym": null}, {"word": "connubial", "definitionA": "of marriage or wedlock; matrimonial; conjugal:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to the state of being married.<br>", "etymology": "First recorded in 1650–60; from Latin cōn(n)ūbiālis, equivalent to cōn(n)ūbi(um) “marriage” + -ālis adjective suffix; co-, nuptial, -al 1", "example": "That this revisionist myth-maker preferred not to copy Homer’s portrait of Penelope as a model of connubial chasteness hints at a larger phenomenon.", "synonym": "conjugal"}, {"word": "antenuptial", "definitionA": "before marriage.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Occurring before marriage; prenuptial.<br>", "etymology": "First recorded in 1810–20; ante- + nuptial", "example": "Antenuptial, an-te-nupsh′al, adj. before nuptials or marriage.", "synonym": null}]