[{"word": "asterisk", "definitionA": "a small starlike symbol (*), used in writing and printing as a reference mark or to indicate omission, doubtful matter, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The symbol *.<br>&nbsp;&nbsp;&nbsp;2. Something in the shape of or resembling the asterisk symbol.<br>&nbsp;&nbsp;&nbsp;3. A blemish in an otherwise outstanding achievement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mark or replace with an asterisk symbol (*); star.<br>", "etymology": "1350–1400; Middle English < Latin asteriscus < Greek asterískos, diminutive of astḗr star none", "example": "Worker unionization in the US rose to a four-year high at the end of 2020, but the statistic comes with an asterisk.", "synonym": null}, {"word": "adapt", "definitionA": "to make suitable to requirements or conditions; adjust or modify fittingly:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make suitable; to make to correspond; to fit or suit<br>&nbsp;&nbsp;&nbsp;2. To fit by alteration; to modify or remodel for a different purpose; to adjust<br>&nbsp;&nbsp;&nbsp;3. To make by altering or fitting something else; to produce by change of form or character<br>&nbsp;&nbsp;&nbsp;4. To make oneself comfortable to a new thing.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Adapted; fit; suited; suitable.<br>", "etymology": "First recorded in 1605–15; from Latin adaptāre “to fit, adjust,” perhaps via French adapter; ad-, apt", "example": "To do this, these insects have evolved, or adapted, to the environment in which their hosts dwell.", "synonym": "change"}, {"word": "adopt", "definitionA": "to choose or take as one's own; make one's own by selection or assent:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take by choice into relationship (a child, heir, friend, citizen, etc.)<br>&nbsp;&nbsp;&nbsp;2. To take or receive as one's own what is not so naturally.<br>&nbsp;&nbsp;&nbsp;3. To select and take or approve.<br>&nbsp;&nbsp;&nbsp;4. To win ten consecutive games against an opponent<br>", "etymology": "First recorded 1490–1500; late Middle English adopten, partly from Middle French adopter, partly from Latin adoptāre, equivalent to ad- verb prefix + optāre “to desire, pray for”; ad-, opt", "example": "The Sense, however, is alone as the first Fitbit to adopt an ECG sensor, bringing it up to speed with the new Apple Watch on that front.", "synonym": "adapt"}, {"word": "illustrious", "definitionA": "highly distinguished; renowned; famous:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Admired, distinguished, respected, or well-known, especially due to past achievements or noble qualities.<br>", "etymology": "1560–70; < Latin illustri ( s ) bright, clear, famous (equivalent to illustr ( āre ) to brighten ( il- 1, luster 1 ) + -is adj. suffix) + -ous", "example": "Now, in the second act of their illustrious careers, Musk and Bezos, who stepped down as Amazon CEO in July but remains its executive chairman, are bound together over a series of ventures that could define their legacies.", "synonym": null}, {"word": "indelible", "definitionA": "making marks that cannot be erased, removed, or washed out:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having the quality of being difficult to delete, remove, wash away, blot out, or efface.<br>&nbsp;&nbsp;&nbsp;2. Incapable of being canceled, lost, or forgotten.<br>&nbsp;&nbsp;&nbsp;3. Incapable of being annulled.<br>", "etymology": "First recorded in 1520–30; from Medieval Latin indēlibilis; replacing indeleble, from Latin indēlēbilis “indestructible”; in- 3, dele, -ble", "example": "That’s going to make sure we remain indelible in our culture and ensuring our survival.", "synonym": null}, {"word": "pique", "definitionA": "to affect with sharp irritation and resentment, especially by some wound to pride:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feeling of enmity; ill-feeling, animosity; a transient feeling of wounded pride.<br>&nbsp;&nbsp;&nbsp;2. A feeling of irritation or resentment, awakened by a social slight or injury; offence, especially taken in an emotional sense with little thought or consideration.<br>&nbsp;&nbsp;&nbsp;3. Keenly felt desire; a longing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wound the pride of; to excite to anger.<br>&nbsp;&nbsp;&nbsp;2. To take pride in; to pride oneself on.<br>&nbsp;&nbsp;&nbsp;3. To stimulate (a feeling, emotion); to offend by slighting; to excite (someone) to action by causing resentment or jealousy.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. In piquet, the right of the elder hand to count thirty in hand, or to play before the adversary counts one.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To score a pique against.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A chigger or jigger, Tunga penetrans.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A durable ribbed fabric made from cotton, rayon, or silk.<br>", "etymology": "First recorded in 1525–35; from Middle French pique (noun), piquer (verb), from Vulgar Latin piccare (unrecorded) “to pick”; pick 1, pike 2", "example": "Their hope is that the resulting products will not only pique consumers’ interest, but keep them healthy and keep them coming back.", "synonym": "blowup"}, {"word": "plenitude", "definitionA": "fullness or adequacy in quantity, measure, or degree; abundance:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Fullness; completeness.<br>&nbsp;&nbsp;&nbsp;2. An abundance; a full supply.<br>&nbsp;&nbsp;&nbsp;3. Fullness (of the moon).<br>", "etymology": "1375–1425; late Middle English, from Latin plēnitūdō. See plenum, -i-, -tude ( def )", "example": "Another people might have taken the stance that each region ought to exist within its own plenitude and limit.", "synonym": "abundance"}, {"word": "plethora", "definitionA": "overabundance; excess:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually followed by of) An excessive amount or number; an abundance.<br>&nbsp;&nbsp;&nbsp;2. An excess of red blood cells or bodily humours.<br>", "etymology": "First recorded in 1535–45; from New Latin, from Greek plēthṓra “fullness,” from plḗthein “to fill, be full”; complete ( def ), full 1", "example": "As a plethora of potential customers is redirected to your website, you’ll reap the benefits of high traffic for your local business.", "synonym": "flood"}, {"word": "plenary", "definitionA": "full; complete; entire; absolute; unqualified:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Plenary session<br>&nbsp;&nbsp;&nbsp;2. (pedagogy) Part of a lesson, usually at or towards the end, designed to review or evaluate the learning that has taken place.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fully attended; for everyone's attendance.<br>&nbsp;&nbsp;&nbsp;2. Complete; full; entire; absolute.<br>", "etymology": "First recorded in 1375–1425; from Late Latin plēnārius ( plenum, -ary ); replacing late Middle English plener, from Anglo-French, from Late Latin plēnāris ( -ar 1 )", "example": "Environments designed by the Miami-based start-up’s team of coders and trained architects include a gold-toned plenary hall, an outdoor amphitheater, and a suite of lobbies to foster chance encounters among participants.", "synonym": null}, {"word": "pleomorphism", "definitionA": "existence of an organism in two or more distinct forms during the life cycle; polymorphism.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The occurrence of multiple structural forms during the life cycle of an organism<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The ability to assume different forms or shapes.<br>&nbsp;&nbsp;&nbsp;2. The coexistence, in the same locality, of two or more distinct forms independent of sex, not connected by intermediate gradations, but produced from common parents.<br>&nbsp;&nbsp;&nbsp;3. The feature pertaining to the dynamic treatment of data elements based on their type, allowing for an instance of a method to have several definitions.<br>&nbsp;&nbsp;&nbsp;4. (type theory) The property of certain typed formal systems of allowing for the use of type variables and binders/quantifiers over those type variables; likewise, the property of certain expressions (within such typed formal systems) of making use of at least one such typed variable.<br>&nbsp;&nbsp;&nbsp;5. The ability of a solid material to exist in more than one form or crystal structure; pleomorphism.<br>&nbsp;&nbsp;&nbsp;6. The regular existence of two or more different genotypes within a given species or population; also, variability of amino acid sequences within a gene's protein.<br>", "etymology": "First recorded in 1860–65; pleo- + -morph + -ism", "example": "He had described this phenomenon in 1888 in a memoir entitled Pleomorphism of Microbes.", "synonym": null}, {"word": "polymorphic", "definitionA": "Biology. (of a species) having more than one form or type as a result of discontinuous variation:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to polymorphism (any sense), able to have several shapes or forms.<br>&nbsp;&nbsp;&nbsp;2. (of a function) Having or relating to the ability to take multiple data types for a single parameter.<br>", "etymology": "poly- ( def ) + -morphic ( def )", "example": "We now understand the process by which a polymorphic race maintains its polymorphism.", "synonym": null}, {"word": "plenipotentiary", "definitionA": "a person, especially a diplomatic agent, invested with full power or authority to transact business on behalf of another.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person invested with full powers, especially as the diplomatic agent of a sovereign state, (originally) charged with handling a certain matter.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Invested with full power.<br>&nbsp;&nbsp;&nbsp;2. Of or relating to a plenipotentiary agent<br>", "etymology": "From the Medieval Latin word plēnipotentiārius, dating back to 1635–45. See plenipotent, -i-, -ary", "example": "There was no American plenipotentiary empowered to make any political compact with the Islanders.", "synonym": "agent"}, {"word": "plebe", "definitionA": "Also  (at the U.S. Military and Naval academies) a member of the freshman class.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually in the plural) A plebeian, a member of the lower class of Roman citizens.<br>&nbsp;&nbsp;&nbsp;2. The plebs, the plebeian class.<br>&nbsp;&nbsp;&nbsp;3. The similar lower class of any area.<br>&nbsp;&nbsp;&nbsp;4. A freshman cadet at a military academy.<br>", "etymology": "First recorded in 1605–15; short for plebeian", "example": "He did well during his plebe year but not spectacularly, earning a class rank of 161st out of more than 800 classmates.", "synonym": "junior"}, {"word": "pleonasm", "definitionA": "the use of more words than are necessary to express an idea; redundancy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Redundancy in wording.<br>&nbsp;&nbsp;&nbsp;2. A phrase involving pleonasm; a phrase containing one or more words which are redundant because their meaning is expressed elsewhere in the phrase.<br>", "etymology": "First recorded in 1580–90; from Late Latin pleonasmus, from Greek pleonasmós “redundancy, surplus,” derivative of pleonázein “to be or have more than enough,” itself derivative of pleíōn “more”; pleo-", "example": "Redundancy or pleonasm is the use of more words than are necessary to express the thought clearly.", "synonym": "circumlocution"}, {"word": "polyamory", "definitionA": "the practice or condition of participating simultaneously in more than one serious romantic or sexual relationship with the knowledge and consent of all partners.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of various practices involving romantic or sexual relationships with multiple partners with the knowledge and consent of all involved.<br>", "etymology": "First recorded in 1990–95; poly- ( def ) + Latin amor “love” ( amorous ( def ) ) + -y 3( def ); patterned after polygamy ( def )", "example": "This group is designed to be a forum for people at all different stages to discuss polyamory and other consensual non-monogamous relationships.", "synonym": null}, {"word": "polyandry", "definitionA": "the practice or condition of having more than one husband at one time. Compare monandry ( def 1 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The having of a plurality of husbands at the same time; usually, the marriage of a woman to more than one man, or the practice of having several husbands, at the same time.<br>&nbsp;&nbsp;&nbsp;2. The mating pattern whereby a female copulates with plural males.<br>&nbsp;&nbsp;&nbsp;3. Sexual relations with multiple males, by a female or a male, human or non-human, within or without marriage.<br>", "etymology": "From the Greek word polyandría, dating back to 1770–80. See poly-, -andry", "example": "They practice polyandry.258 Infanticide was frequent among them until suppressed under the action of Government.", "synonym": "bigamy"}, {"word": "polyclinic", "definitionA": "a clinic or a hospital dealing with various diseases.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A clinic in which diseases of many sorts are treated; especially, an institution in which clinical instruction is given in all kinds of disease.<br>", "etymology": "1885–90; alteration of policlinic by association with poly-", "example": "The cornerstone of the health service is the polyclinic, which provides general and specialized outpatient aid and consultation.", "synonym": null}, {"word": "polydactyl", "definitionA": "having many or several digits.", "definitionB": "No definition found", "etymology": "From the Greek word polydáktylos, dating back to 1860–65. See poly-, -dactyl", "example": "Even in pure-bred polydactyl races, consequently, the character \"extra-toe\" does not uniformly appear in the offspring.", "synonym": null}, {"word": "polygraph", "definitionA": "an instrument for receiving and recording simultaneously tracings of variations in certain body activities.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device which measures and records several physiological variables such as blood pressure, heart rate, respiration and skin conductivity while a series of questions is being asked to a subject, in an attempt to detect lies.<br>&nbsp;&nbsp;&nbsp;2. A mechanical instrument for multiplying copies of a writing, resembling multiple pantographs.<br>&nbsp;&nbsp;&nbsp;3. A collection of different works, either by one or several authors.<br>&nbsp;&nbsp;&nbsp;4. A group of letters that represent a single phoneme.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To administer a polygraph test to.<br>", "etymology": "1795–1805  polygraph fordef 1; 1920–25  polygraph fordef 3; < Greek polýgraphos writing much. See poly-, -graph", "example": "Her mother, Candus Bly, took and passed a polygraph, according to her husband, Donald Wells.", "synonym": null}, {"word": "polyhedron", "definitionA": "a solid figure having many faces.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A solid figure with many flat faces and straight edges.<br>&nbsp;&nbsp;&nbsp;2. A polyscope, or multiplying glass.<br>", "etymology": "1560–70; < Greek polýedron, neuter of polýedros having many bases. See poly-, -hedron", "example": "If we make a polyhedron out of clay, mark the edges with a Sharpie, and roll it into a ball, the faces and edges become curved but their number doesn’t change.", "synonym": null}, {"word": "tetrahedron", "definitionA": "Geometry. a solid contained by four plane faces; a triangular pyramid.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A polyhedron with four faces; the regular tetrahedron, the faces of which are equal equilateral triangles, is one of the Platonic solids.<br>", "etymology": "1560–70; tetra- + -hedron, modeled on Late Greek tetráedron, noun use of neuter of tetráedros four-sided", "example": "Furthermore, in 1980 Hans Debrunner showed that any tetrahedron that tiles space must have a Dehn invariant of 0 — the same as a cube.", "synonym": null}, {"word": "polysemy", "definitionA": "a condition in which a single word, phrase, or concept has more than one meaning or connotation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The property of a word, sign or symbol that can represent multiple similar meanings.<br>", "etymology": "First recorded in 1895–1900; from New Latin polysēmia, equivalent to Late Latin polysēm(us) “with many significations” (from Greek polýsēmos, equivalent to poly- “many” + sêm(a) “sign” + -os adjective suffix) + -ia noun suffix; poly-, -y 3", "example": null, "synonym": "anagram"}, {"word": "replete", "definitionA": "abundantly supplied or provided; filled (usually followed by with ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A honeypot ant.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fill to repletion, or restore something that has been depleted.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abounding.<br>&nbsp;&nbsp;&nbsp;2. Gorged, filled to near the point of bursting, especially with food or drink.<br>", "etymology": "First recorded in 1350–1400; Middle English repleet, from Middle French replet, from Latin replētus, past participle of replēre “to fill up,” equivalent to re- “again, again and again” + plē(re) “to fill” (akin to plēnus “full”) + -tus past participle suffix; re-, full 1", "example": "The new generation of Afghans have grown up with freedom of expression, social media and satellite television replete with Bollywood action movies and female news anchors.", "synonym": "abounding"}, {"word": "polytheism", "definitionA": "the doctrine of or belief in more than one god or in many gods.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The belief in the existence of multiple gods.<br>", "etymology": "1605–15; poly- + theism; compare French polythéisme", "example": "To many outside Christianity, this looks a bit like polytheism!", "synonym": "hagiology"}, {"word": "tamper", "definitionA": "to meddle, especially for the purpose of altering, damaging, or misusing (usually followed by with ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person or thing that tamps.<br>&nbsp;&nbsp;&nbsp;2. A tool used to tamp something down, such as tobacco in a pipe.<br>&nbsp;&nbsp;&nbsp;3. A railway vehicle used to tamp down ballast.<br>&nbsp;&nbsp;&nbsp;4. An envelope of neutron-reflecting material in a nuclear weapon, used to delay the expansion of the reacting material and thus produce a longer-lasting and more energetic explosion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make unauthorized or improper alterations, sometimes causing deliberate damage; to meddle (with something).<br>&nbsp;&nbsp;&nbsp;2. To try to influence someone, usually in an illegal or devious way; to try to deal (with someone).<br>&nbsp;&nbsp;&nbsp;3. To meddle (with something) in order to corrupt or pervert it.<br>&nbsp;&nbsp;&nbsp;4. To involve oneself (in a plot, scheme, etc.).<br>&nbsp;&nbsp;&nbsp;5. To attempt to practise or administer something (especially medicine) without sufficient knowledge or qualifications.<br>&nbsp;&nbsp;&nbsp;6. (in professional sports) To discuss future contracts with a player, against league rules.<br>", "etymology": "First recorded in 1560–70; probably variant of temper (verb)", "example": "There had been problems of a similar nature which were suspected to be tampering or minor mechanical issues.", "synonym": "busybody"}, {"word": "hamstring", "definitionA": "(in humans and other primates) any of the tendons that bound the ham of the knee.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of the great tendons situated in each side of the ham, or space back of the knee, and connected with the muscles of the back of the thigh.<br>&nbsp;&nbsp;&nbsp;2. The biceps femoris, semimembranosus, and semitendinosus muscles.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To lame or disable by cutting the tendons of the ham or knee; to hough.<br>&nbsp;&nbsp;&nbsp;2. To cripple; to incapacitate; to disable.<br>", "etymology": "First recorded in 1555–65; ham 1 + string", "example": "Downward dog also targets multiple muscle groups, including the shoulders, mid-back and hamstrings, Welton says.", "synonym": "cripple"}, {"word": "arthrodia", "definitionA": "a joint, as in the carpal articulations, in which the surfaces glide over each other in movement.", "definitionB": "No definition found", "etymology": "1625–35; < Greek arthrōdía, equivalent to arthrṓd ( ēs ) jointed ( árthr ( on ) joint + -ōdēs -ode 1 ) + -ia -ia", "example": "Gliding joints (Arthrodia), in which the articular surfaces are flat, as in the carpal and tarsal bones.", "synonym": null}, {"word": "arthropod", "definitionA": "any invertebrate of the phylum Arthropoda, having a segmented body, jointed limbs, and usually a chitinous shell that undergoes moltings, including the insects, spiders and other arachnids, crustaceans, and myriapods.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An invertebrate animal of the phylum Arthropoda, characterized by a chitinous exoskeleton and multiple jointed appendages<br>", "etymology": "1875–80; < New Latin Arthropoda; arthro-, -pod", "example": "Scientists find an increase in the overall numbers of arthropods in the Arctic, but a decline in diversity.", "synonym": "arachnid"}, {"word": "arthralgia", "definitionA": "pain in a joint.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Pain in a joint, especially when not caused by arthritis.<br>", "etymology": "First recorded in 1840–50; arthr- + -algia", "example": "Arthralgia—that is, pains in the joints—is also very common; it seldom occurs alone, but in combination with other symptoms.", "synonym": null}, {"word": "arthritis", "definitionA": "acute or chronic inflammation of a joint, often accompanied by pain and structural changes and having diverse causes, as infection, crystal deposition, or injury.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Inflammation of a joint or joints causing pain and/or disability, swelling and stiffness, and due to various causes such as infection, trauma, degenerative changes or metabolic disorders.<br>", "etymology": "First recorded in 1535–45; from New Latin, from Greek: “gout,” from árthr(on) “joint” ( arthro- ) + -ītis -itis", "example": "Exercise science experts can educate chronic disease patients about the ways physical activity can help manage their conditions—from reducing the pain associated with rheumatoid arthritis to increasing insulin sensitivity for diabetics.", "synonym": null}, {"word": "cephalalgia", "definitionA": "headache ( def 1 ).", "definitionB": "No definition found", "etymology": "First recorded in 1540–50; cephal- + -algia", "example": "If you will only call a headache a Cephalalgia, it acquires dignity at once, and a patient becomes rather proud of it.", "synonym": "megrim"}, {"word": "myalgia", "definitionA": "pain in the muscles; muscular rheumatism.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Muscular pain or tenderness.<br>", "etymology": "First recorded in 1855–60; my- + -algia", "example": "Of those breakthrough infections, 79 percent had symptoms, with cough, headache, sore throat, myalgia, and fever being the most common symptoms.", "synonym": null}, {"word": "myology", "definitionA": "the science or branch of anatomy dealing with muscles.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The physiological study of muscles.<br>", "etymology": "From the New Latin word myologia, dating back to 1640–50. See myo-, -logy", "example": "Myology and serology of the Avian Family Fringillidae, a taxonomic study.", "synonym": null}, {"word": "construe", "definitionA": "to give the meaning or intention of; explain; interpret.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A translation.<br>&nbsp;&nbsp;&nbsp;2. An interpretation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To interpret or explain the meaning of something.<br>&nbsp;&nbsp;&nbsp;2. (grammar) To analyze the grammatical structure of a clause or sentence; to parse.<br>&nbsp;&nbsp;&nbsp;3. (grammar) To admit of grammatical analysis.<br>&nbsp;&nbsp;&nbsp;4. To translate.<br>&nbsp;&nbsp;&nbsp;5. To infer.<br>", "etymology": "First recorded in 1325–75; Middle English construen, from Latin construere “to put together, build,” equivalent to con- con- + struere “to pile up, arrange,” perhaps akin to sternere “to spread, scatter”; strew, stratum", "example": "At one of his rallies, Kivalov reportedly gave out packages with food items and money, which investigators construe to be bribes.", "synonym": "analyze"}]