[{"word": "argot", "definitionA": "a specialized idiomatic vocabulary peculiar to a particular class or group of people, especially that of an underworld group, devised for private communication and identification:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A secret language or conventional slang peculiar to thieves, tramps and vagabonds.<br>&nbsp;&nbsp;&nbsp;2. The specialized informal vocabulary and terminology used between people with special skill in a field, such as between doctors, mathematicians or hackers.<br>", "etymology": "1855–60; < French, noun derivative of argoter to quarrel, derivative Latin ergō ergo with v. suffix -oter", "example": "It’s irresponsible — or “extreme” in the colloquial argot of politics these days — to falsely shout, “Fire!” in a crowded theater.", "synonym": "cant"}, {"word": "ergograph", "definitionA": "an instrument that records the amount of work done when a muscle contracts.", "definitionB": "No definition found", "etymology": "First recorded in 1890–95; ergo- 1 + -graph", "example": "The Dubois ergograph is used for the purpose, the object being to trace a fatigue curve.", "synonym": null}, {"word": "deprecate", "definitionA": "to express earnest disapproval of:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To belittle or express disapproval of.<br>&nbsp;&nbsp;&nbsp;2. To declare something obsolescent; to recommend against a function, technique, command, etc. that still works but has been replaced.<br>&nbsp;&nbsp;&nbsp;3. To pray against.<br>&nbsp;&nbsp;&nbsp;4. To regret deeply.<br>", "etymology": "First recorded in 1615–25; from Latin dēprecātus “prayed against, warded off” (past participle of dēprecārī ), equivalent to dē- “away from, out of“ + precārī “to pray” + -ātus past participle suffix; de-, pray, -ate 1", "example": "“It’s so self deprecating without being pandering, you know?”", "synonym": "depreciate"}, {"word": "sublimate", "definitionA": "Psychology. to divert the energy of (a sexual or other biological impulse) from its immediate goal to one of a more acceptable social, moral, or aesthetic nature or use.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A product obtained by sublimation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To change state from a solid to a gas without passing through the liquid state.<br>&nbsp;&nbsp;&nbsp;2. To purify or refine a substance through such a change of state.<br>&nbsp;&nbsp;&nbsp;3. To modify the natural expression of a sexual or primitive instinct in a socially acceptable manner; to divert the energy of such an instinct into some acceptable activity.<br>&nbsp;&nbsp;&nbsp;4. To raise to a place of honor; to refine and exalt.<br>", "etymology": "1425–75; late Middle English: exalted, sublimated < Latin sublīmātus (past participle of sublīmāre to elevate), equivalent to sublīm ( is ) sublime + -ātus -ate 1", "example": "We have to sublimate a lot of emotions into our sports teams because we’re repressed.", "synonym": "clean"}, {"word": "addle", "definitionA": "to make or become confused.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (provincial) To earn, earn by labor; earn money or one's living.<br>&nbsp;&nbsp;&nbsp;2. (provincial) To thrive or grow; to ripen.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A foolish or dull-witted fellow.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Liquid filth; mire.<br>&nbsp;&nbsp;&nbsp;2. (provincial) Lees; dregs.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make addle; to grow addle; to muddle<br>&nbsp;&nbsp;&nbsp;2. To cause fertilised eggs to lose viability, by killing the developing embryo within through shaking, piercing, freezing or oiling, without breaking the shell.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having lost the power of development, and become rotten; putrid.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Unfruitful or confused; muddled.<br>", "etymology": "First recorded before 1000; Middle English adel “rotten,” Old English adela “liquid, filth”; cognate with Middle Low German adele “liquid manure”", "example": "He’s more concerned with the character’s state of mind, which is troubled, addled from drugs and booze, and driven almost mad with yearning.", "synonym": "baffle"}, {"word": "nowhither", "definitionA": "to no place; nowhere:", "definitionB": "No definition found", "etymology": "before 900; Middle English nohwider, Old English nāhwider. See no 1, whither", "example": "\"I know very well, thou cat, that thou goest nowhither where there is trouble, but thou dost ferret out where a fat booty lies hidden, and thou leadest our Spahis on the track of it, wherefore they give thee also a portion of it; so answer me at once whom thou art wont to visit at night, as otherwise I shall open a hole in thy head.\"", "synonym": null}, {"word": "sleigh", "definitionA": "a light vehicle on runners, usually open and generally horse-drawn, used especially for transporting persons over snow or ice.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A vehicle, generally pulled by an animal, which moves over snow or ice on runners, used for transporting persons or goods. (contrast \"sled\", which is smaller)<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ride or drive a sleigh.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sly.<br>", "etymology": "1690–1700, Americanism; < Dutch slee, variant of slede sled; slide", "example": "And there were snowmen made of fluffy cotton and pictures of candles and packages and sleighs.", "synonym": "bobsled"}, {"word": "fray", "definitionA": "a fight, battle, or skirmish.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To (cause to) unravel; used particularly for the edge of something made of cloth, or the end of a rope.<br>&nbsp;&nbsp;&nbsp;2. To cause exhaustion, wear out (a person's mental strength).<br>&nbsp;&nbsp;&nbsp;3. Frighten; alarm<br>&nbsp;&nbsp;&nbsp;4. To bear the expense of; to defray.<br>&nbsp;&nbsp;&nbsp;5. To rub.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fight or argument<br>&nbsp;&nbsp;&nbsp;2. Fright.<br>", "etymology": "First recorded in 1350–1400; Middle English frai; shortening of affray", "example": "\"In my view, this is the best way to avoid dragging the bureau deeper into the fray, while reinforcing the values and principles that are so important to how we do our work,\" Wray said.", "synonym": "affray"}, {"word": "pastiche", "definitionA": "a literary, musical, or artistic piece consisting wholly or chiefly of motifs or techniques borrowed from one or more sources.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A work of art, drama, literature, music, or architecture that imitates the work of a previous artist.<br>&nbsp;&nbsp;&nbsp;2. A musical medley, typically quoting other works.<br>&nbsp;&nbsp;&nbsp;3. An incongruous mixture; a hodgepodge.<br>&nbsp;&nbsp;&nbsp;4. A postmodern playwriting technique that fuses a variety of styles, genres, and story lines to create a new form.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To create or compose in a mixture of styles.<br>", "etymology": "1700–10; < French < Italian pasticcio pasticcio", "example": "For sure, it’s a dreamy pastiche of the era’s moody, existential movies.", "synonym": "assortment"}, {"word": "hodgepodge", "definitionA": "a heterogeneous mixture; jumble.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hotchpotch; a collection containing a variety of miscellaneous things.<br>&nbsp;&nbsp;&nbsp;2. A confused mass of ingredients shaken or mixed together in the same pot.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move or position in an erratic, disorganised manner.<br>", "etymology": "First recorded in 1615–25; variant of hotchpotch", "example": "With the blurry hodgepodge of green, blue, gray, and a spot of pink and white, Choi said he was celebrating sunlight in ways people might not think about.", "synonym": "collection"}, {"word": "brusque", "definitionA": "abrupt in manner; blunt; rough:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Rudely abrupt, unfriendly.<br>", "etymology": "First recorded in 1595–1605; from Middle French, from Italian brusco “rough, tart,” special use of brusco (noun) “butcher's broom,” from Late Latin brūscum, for Latin rūscus, rūscum, perhaps conflated with unattested Vulgar Latin brūcus “heather” ( brier 2 )", "example": "Sumini says the low-key tactics the women use, rather than brusque confrontation, have been effective in getting people to change their habits.", "synonym": null}]