[{"word": "rave", "definitionA": "to talk wildly, as in delirium.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An enthusiastic review (such as of a play).<br>&nbsp;&nbsp;&nbsp;2. An all-night dance party with electronic dance music (techno, trance, drum and bass etc.) and possibly drug use.<br>&nbsp;&nbsp;&nbsp;3. The genres of electronic dance music usually associated with rave parties.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wander in mind or intellect; to be delirious; to talk or act irrationally; to be wild, furious, or raging.<br>&nbsp;&nbsp;&nbsp;2. To speak or write wildly or incoherently.<br>&nbsp;&nbsp;&nbsp;3. To talk with unreasonable enthusiasm or excessive passion or excitement; followed by about, of, or (formerly) on.<br>&nbsp;&nbsp;&nbsp;4. To rush wildly or furiously.<br>&nbsp;&nbsp;&nbsp;5. To attend a rave (dance party).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of the upper side pieces of the frame of a wagon body or a sleigh.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tear apart by force; to rend; to split; to cleave.<br>&nbsp;&nbsp;&nbsp;2. To pierce or cleave with a weapon.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To land.<br>", "etymology": "First recorded in 1325–75; 1915–25  rave 1fordef 2; 1960–65  rave 1fordef 8; 1985–90  rave 1fordef 7; Middle English verb raven, probably from Middle French resver “to wander, be delirious”; further origin uncertain", "example": "\"You can have the best marketing, you can have the best game, you can get rave reviews, but you're still flipping a coin as to whether it's going to blow up,\" Adam says.", "synonym": "bloviate"}, {"word": "spall", "definitionA": "a chip or splinter, as of stone or ore.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A splinter, fragment or chip, especially of stone.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To break into fragments or small pieces.<br>&nbsp;&nbsp;&nbsp;2. To reduce, as irregular blocks of stone, to an approximately level surface by hammering.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The shoulder.<br>", "etymology": "1750–60; origin uncertain; compare late Middle English spalle a chip", "example": "Even if they are not breached, they can spall, and you can have concrete falling down onto the reactor vessel.", "synonym": null}, {"word": "oxymoron", "definitionA": "a figure of speech by which a locution produces an incongruous, seemingly self-contradictory effect, as in “cruel kindness” or “to make haste slowly.”", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A figure of speech in which two words or phrases with opposing meanings are used together intentionally for effect.<br>&nbsp;&nbsp;&nbsp;2. (sometimes proscribed) A contradiction in terms.<br>", "etymology": "First recorded in 1650–60; from Late Latin oxymorum, from presumed Greek oxýmōron (unrecorded), neuter of oxýmōros (unrecorded) “sharp-dull,” equivalent to oxý(s) “sharp” ( oxy- 1 ) + mōrós “dull” ( moron )", "example": "“The phrase ‘homeless veteran’ should be an American oxymoron,” the complaint said.", "synonym": null}, {"word": "marinate", "definitionA": "to steep (food) in a marinade.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To allow a sauce or flavoring mixture to absorb into something; to steep or soak something in a marinade to flavor or prepare it for cooking.<br>", "etymology": "1635–45; probably < Italian marinato, past participle of marinare to pickle. See marine, -ate 1", "example": "Music has always been a passion for Coppola, whose childhood was marinated in opera and whose composer father often contributed to his films.", "synonym": "marinade"}, {"word": "footle", "definitionA": "to act or talk in a foolish or silly way.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense; foolishness.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To waste time; to trifle.<br>&nbsp;&nbsp;&nbsp;2. To talk nonsense.<br>", "etymology": "First recorded in 1890–95; origin uncertain; footy", "example": "About two hours later, it was recognised Arthur was \"an unanticipated footling breech\", the Record of Inquest states.", "synonym": null}, {"word": "cornucopia", "definitionA": "Classical Mythology. a horn containing food, drink, etc., in endless supply, said to have been a horn of the goat Amalthaea.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A goat's horn endlessly overflowing with fruit, flowers and grain; or full of whatever its owner wanted.<br>&nbsp;&nbsp;&nbsp;2. A hollow horn- or cone-shaped object, filled with edible or useful things.<br>&nbsp;&nbsp;&nbsp;3. An abundance or plentiful supply.<br>", "etymology": "First recorded in 1585–95; from Late Latin cornū cōpiae “horn of plenty,” from Latin cornū “horn” + cōpiae (genitive singular of cōpia “abundance”); horn, cornu, copious", "example": "The simple act of saying a sincere thank you, or just counting one’s blessings, can offer a cornucopia of mental and physical benefits.", "synonym": "affluence"}, {"word": "acrimony", "definitionA": "sharpness, harshness, or bitterness of nature, speech, disposition, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sharp and bitter hatred.<br>", "etymology": "First recorded in 1535–45; from Latin ācrimōnia, from ācri-, stem of ācer “sharp, sour” + -mōnia -mony", "example": "Ms Kelly denied that she had created a \"culture of fear\", but accepted there was acrimony between doctors who suspected Letby and nurses who backed her.", "synonym": "acerbity"}, {"word": "acrid", "definitionA": "sharp or biting to the taste or smell; bitterly pungent; irritating to the eyes, nose, etc.:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sharp and harsh, or bitter and not to the taste.<br>&nbsp;&nbsp;&nbsp;2. Causing heat and irritation.<br>&nbsp;&nbsp;&nbsp;3. Caustic; bitter; bitterly irritating.<br>", "etymology": "1705–15; < Latin ācr- (stem of ācer ) sharp, sour + -id 4, perhaps through influence of acid", "example": "In recent years, complaints of acrid odors, fiery accidents, soot and harmful emissions have gained new resonance as public officials become more sensitive to accusations of environmental damage.", "synonym": null}, {"word": "acicular", "definitionA": "shaped like a needle.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Needle-shaped; slender like a needle or bristle.<br>&nbsp;&nbsp;&nbsp;2. Having sharp points like needles.<br>&nbsp;&nbsp;&nbsp;3. Of a leaf, slender and pointed, needle-like.<br>", "etymology": "First recorded in 1785–95; acicul(a) + -ar 1", "example": "In a pair of reports from 1957 and 1958, the lab said the talc contained “from less than 1 percent to about 3 percent of contaminants,” described as mostly fibrous and “acicular” tremolite.", "synonym": null}, {"word": "acuity", "definitionA": "sharpness; acuteness; keenness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Sharpness or acuteness, as of a needle, wit, etc.<br>", "etymology": "First recorded in 1375–1425; late Middle English acuite, from Old French, from Medieval Latin, Late Latin acuitās, equivalent to Latin acu(ere) to sharpen or acū ( tus ) sharpened ( acute ) + -itās -ity", "example": "Harris, riding a wave of enthusiasm from Democrats who had grown concerned about Biden’s age and mental acuity, initially surged in the polls.", "synonym": "acuteness"}, {"word": "allegory", "definitionA": "a representation of an abstract or spiritual meaning through concrete or material forms; figurative treatment of one subject under the guise of another.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The representation of abstract principles by characters or figures.<br>&nbsp;&nbsp;&nbsp;2. A picture, book, or other form of communication using such representation.<br>&nbsp;&nbsp;&nbsp;3. A symbolic representation which can be interpreted to reveal a hidden meaning, usually a moral or political one.<br>&nbsp;&nbsp;&nbsp;4. A category that retains some of the structure of the category of binary relations between sets, representing a high-level generalisation of that category.<br>", "etymology": "First recorded in 1350–1400; Middle English allegorie, from Latin allēgoria, from Greek allēgoría, derivative of allēgoreîn “to speak so as to imply something else; speak allegorically,” equivalent to állos “other, another” + agoreúein “to speak (in an assembly), address, harangue,” a derivative of agorá; allo-, agora 1", "example": "There are Bible verses in it, there's clearly allegories and parallels between the struggles of these characters and Biblical stories.", "synonym": "apologue"}, {"word": "purview", "definitionA": "the range of operation, authority, control, concern, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The enacting part of a statute.<br>&nbsp;&nbsp;&nbsp;2. The scope of a statute.<br>&nbsp;&nbsp;&nbsp;3. Scope or range of interest or control.<br>&nbsp;&nbsp;&nbsp;4. Range of understanding.<br>", "etymology": "First recorded in 1225–75; Middle English purveu, from Anglo-French: past participle of purveier “to furnish or supply”; purvey", "example": "In Trump’s between-terms interregnum, he and Putin seemingly stayed in touch, with at least seven phone conversations that took place outside the purview of U.S. diplomacy, according to journalist and author Bob Woodward.", "synonym": "acumen"}, {"word": "swoop", "definitionA": "to sweep through the air, as a bird or a bat, especially down upon prey.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An instance, or the act of suddenly plunging downward.<br>&nbsp;&nbsp;&nbsp;2. A sudden act of seizing.<br>&nbsp;&nbsp;&nbsp;3. A quick passage from one note to the next.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fly or glide downwards suddenly; to plunge (in the air) or nosedive.<br>&nbsp;&nbsp;&nbsp;2. To move swiftly, as if with a sweeping movement, especially to attack something.<br>&nbsp;&nbsp;&nbsp;3. To fall on at once and seize; to catch while on the wing.<br>&nbsp;&nbsp;&nbsp;4. To seize; to catch up; to take with a sweep.<br>&nbsp;&nbsp;&nbsp;5. To pass with pomp; to sweep.<br>", "etymology": "1535–45; variant (with close ō ) of Middle English swopen, Old English swāpan to sweep 1; cognate with German schweifen", "example": "Soon after he left, a team of agents swooped in to search the store more thoroughly.", "synonym": "fall"}, {"word": "condone", "definitionA": "to disregard or overlook (something illegal, objectionable, or the like):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To forgive, excuse or overlook (something that is considered morally wrong, offensive, or generally disliked).<br>&nbsp;&nbsp;&nbsp;2. To allow, accept or permit (something that is considered morally wrong, offensive, or generally disliked).<br>&nbsp;&nbsp;&nbsp;3. To forgive (marital infidelity or other marital offense).<br>", "etymology": "First recorded in 1615–25, but in general currency from its use in the British Divorce Act of 1857 (see  condone def 5 ); from Latin condōnāre “to absolve, grant pardon,” equivalent to con- “with, together” + dōnāre “to give”; con-, donate", "example": "Obviously, my job is to understand why she does the things that she does, so I’m naturally going to be empathetic, whether or not I condone those actions.", "synonym": "buy"}, {"word": "tomography", "definitionA": "any of a number of techniques used to obtain an X-ray photograph of a selected plane section of the human body or some other solid object", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Imaging by sections or sectioning.<br>", "etymology": "C20: from Greek tomē a cutting + -graphy", "example": "Canadian researchers have developed a new 3D printing method called blurred tomography that can rapidly produce microlenses with commercial-level optical quality.", "synonym": null}, {"word": "tome", "definitionA": "a book, especially a very heavy, large, or learned book.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One in a series of volumes.<br>&nbsp;&nbsp;&nbsp;2. A large or scholarly book.<br>", "etymology": "First recorded in 1510–20; from French, from Latin tomus, from Greek tómos “slice, piece, roll of paper, book,” akin to témnein “to cut”", "example": "In the early 1900s, the conservationist and anthropologist Madison Grant, who helped establish Glacier National Park and the Bronx Zoo, wrote pseudoscientific tomes about the coming extinction of white people.", "synonym": "classic"}, {"word": "tonsorial", "definitionA": "of or relating to a barber or barbering:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to barbers or to shaving.<br>", "etymology": "1805–15; < Latin tōnsōri ( us ) of shaving ( tond ( ēre ) to shave + -tōrius -tory 1, with dt > s ) + -al 1", "example": "There were no hard feelings between the two, and normal tonsorial service resumed when the man got out of the pen.", "synonym": null}, {"word": "entomology", "definitionA": "the branch of zoology dealing with insects.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The scientific study of insects, and (informally) of other arthropods (and occasionally other invertebrates).<br>", "etymology": "First recorded in 1760–70; entomo- + -logy", "example": "He is also a member of an entomology association in Modena, a city in the north of Italy.", "synonym": null}, {"word": "necrotomy", "definitionA": "Surgery. the excision of necrosed bone.", "definitionB": "No definition found", "etymology": "First recorded in 1895–1900; necro- + -tomy", "example": "Associated words: cadaverous, cadaveric, necrophilism, necrophilous, carrion, necrophobia, necrogenic, necrogenous, necrotomy, necropsy, coffin, bier, catafalque, vespillo, cremate, cremation, crematory, crematorium, embalm, embalming. correct, a. accurate, right, exact, precise.", "synonym": null}, {"word": "entomophagous", "definitionA": "feeding on insects: applied especially to species used for biological control, such as some insects, fungi, or nematodes. Compare insectivorous ( def ).", "definitionB": "No definition found", "etymology": "First recorded in 1830–40; entomo- + -phagous", "example": "Entomophagous: feeding upon insects: specifically applied to those wasps that feed their young with larvae, etc.", "synonym": null}, {"word": "tonsure", "definitionA": "the act of cutting the hair or shaving the head.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ritual shaving of this kind.<br>&nbsp;&nbsp;&nbsp;2. The bald patch resulting from being tonsured.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shave the crown of the head as a sign of humility and religious vocation.<br>", "etymology": "1350–1400; Middle English < Latin tōnsūra a shearing, equivalent to tōns ( us ) (past participle of tondēre to shear, clip, shave) + -ūra -ure", "example": "Its detailed design includes a crowned Virgin Mary holding the Christ child and kneeling to her right is a monk looking up at her, identified by his tonsure.", "synonym": null}, {"word": "obfuscate", "definitionA": "to make unclear or hard to understand, especially deliberately:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make dark; overshadow<br>&nbsp;&nbsp;&nbsp;2. To deliberately make more confusing in order to conceal the truth.<br>&nbsp;&nbsp;&nbsp;3. To alter code while preserving its behavior but concealing its structure and intent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Obfuscated; darkened; obscured.<br>", "etymology": "First recorded in 1525–35; from Late Latin obfuscātus “darkened,” past participle of obfuscāre “to darken,” from Latin ob- ob- + fusc(us) “dark” + -āre, infinitive suffix", "example": "But the most frustrating thing for Mwape is that his second-oldest son is never explicit about what drugs he is taking, how he gets hold of them - and often obfuscates when asked a question.", "synonym": "baffle"}, {"word": "frugal", "definitionA": "economical in use or expenditure; prudently saving or sparing; not wasteful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Avoiding unnecessary expenditure either of money or of anything else which is to be used or consumed; avoiding waste.<br>", "etymology": "First recorded in 1590–1600; from Latin frūgālis “economical,” derivative of the indeclinable adjective frūgī (dative singular of frūx “produce, fruit”) + -ālis adjective suffix; fruit, -al 1", "example": "It’s not hard to see how a frugal mindset reinforced by years of poverty and shaming by our culture could yield the same mindset around money.", "synonym": null}, {"word": "scintilla", "definitionA": "a minute particle; spark; trace:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small spark or flash.<br>&nbsp;&nbsp;&nbsp;2. A small or trace amount.<br>", "etymology": "1685–95; < Latin: spark", "example": "In sentencing Armstrong, Mr Justice McAlinden said that he had not shown \"one scintilla of remorse or regret\" for his actions.", "synonym": "atom"}, {"word": "dichotomy", "definitionA": "division into two parts, kinds, etc.; subdivision into halves or pairs.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A separation or division into two; a distinction that results in such a division.<br>&nbsp;&nbsp;&nbsp;2. Such a division involving apparently incompatible or opposite principles; a duality.<br>&nbsp;&nbsp;&nbsp;3. The division of a class into two disjoint subclasses that are together comprehensive, as the division of man into white and not white.<br>&nbsp;&nbsp;&nbsp;4. The division of a genus into two species; a division into two subordinate parts.<br>&nbsp;&nbsp;&nbsp;5. A phase of the moon when it appears half lit and half dark, as at the quadratures.<br>&nbsp;&nbsp;&nbsp;6. Division and subdivision; bifurcation, as of a stem of a plant or a vein of the body into two parts as it proceeds from its origin; often successive.<br>", "etymology": "First recorded in 1580–90; from Late Latin dichotomia, from Greek dichotomía “dividing in two (of the quarters of the moon), point of a bisection, division into two parts”; dicho-, -tomy", "example": "Perhaps nowhere confronts a bleaker election-related dichotomy than Ukraine, soon to enter a third year of trying to fight off a full-scale invasion by Russian President Vladimir Putin’s military.", "synonym": "difference"}, {"word": "excision", "definitionA": "the act of removal; an excising. excise.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The deletion of some text during editing.<br>&nbsp;&nbsp;&nbsp;2. The removal of a tumor, etc., by cutting.<br>&nbsp;&nbsp;&nbsp;3. The removal of a gene from a section of genetic material.<br>&nbsp;&nbsp;&nbsp;4. The fact that, under certain hypotheses, the homology of a space relative to a subspace is unchanged by the identification of a subspace of the latter to a point.<br>", "etymology": "1480–90; < Latin excīsiōn- (stem of excīsiō ) a cutting out. See excise 2, -ion", "example": "Because of the complexities of her case, Emily would need an endometriosis specialist to carry out the hysterectomy as it would also involve excision of the endometriosis.", "synonym": "ablation"}, {"word": "appendectomy", "definitionA": "excision of the vermiform appendix.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The surgical procedure for the removal of the vermiform appendix.<br>", "etymology": "First recorded in 1890–95; append(ix) + -ectomy", "example": "Gibson missed the start of the season after undergoing emergency appendectomy surgery in September.", "synonym": null}, {"word": "gastrectomy", "definitionA": "partial or total excision of the stomach.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Removal or partial removal of the stomach<br>", "etymology": "First recorded in 1885–90; gastr- + -ectomy", "example": "It was especially helpful to hear Rodriguez explain the procedure, called a sleeve gastrectomy, and describe the experiences of other teenagers who had been through it.", "synonym": null}, {"word": "nephrectomy", "definitionA": "excision of a kidney.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The surgical removal of a kidney.<br>", "etymology": "First recorded in 1875–80; nephr- + -ectomy", "example": "He decided to document his journey, filming the highs and lows, which included a nephrectomy - the removal of a kidney.", "synonym": null}, {"word": "nephrolith", "definitionA": "a renal calculus; kidney stone.", "definitionB": "No definition found", "etymology": "nephro- + -lith", "example": null, "synonym": null}]