[{"word": "grifter", "definitionA": "a person who operates a side show at a circus, fair, etc., especially a gambling attraction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A con artist; someone who pulls confidence games.<br>", "etymology": "First recorded in 1910–15; grift + -er 1", "example": "A lack of gatekeepers is broadly a good thing, but it also leaves the door open to grifters.", "synonym": "fraud"}, {"word": "grog", "definitionA": "a mixture of rum and water, often flavored with lemon, sugar, and spices and sometimes served hot.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (original meaning) An alcoholic beverage made with rum and water, especially that once issued to sailors of the Royal Navy.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Any alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;3. A glass or serving of an alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;4. An alcoholic beverage made with hot water or tea, sugar and rum, sometimes also with lemon or lime juice and spices, particularly cinnamon.<br>&nbsp;&nbsp;&nbsp;5. A type of pre-fired clay that has been ground and screened to a specific particle size.<br>", "etymology": "1760–70; from Old Grog (alluding to his grogram cloak), the nickname of Edward Vernon (died 1757), British admiral, who in 1740 ordered the alcoholic mixture to be served, instead of pure spirits, to sailors.", "example": "Herschbach recalls attending one party with a fire blazing in a courtyard and plenty of grog to go round.", "synonym": "alcohol"}, {"word": "groggy", "definitionA": "staggering, as from exhaustion or blows:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Slowed or weakened, as by drink, sleepiness, etc.<br>&nbsp;&nbsp;&nbsp;2. Of a horse: bearing wholly on its heels when trotting.<br>", "etymology": "First recorded in 1760–70; grog + -y 1", "example": "The animals were photographed and given names chosen by the local community before they were released, groggy and confused, back into the wild.", "synonym": null}, {"word": "snuff", "definitionA": "to draw in through the nose by inhaling.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Finely ground or pulverized tobacco intended for use by being sniffed or snorted into the nose.<br>&nbsp;&nbsp;&nbsp;2. Fine-ground or minced tobacco, dry or moistened, intended for use by placing a pinch behind the lip or beneath the tongue; see also snus.<br>&nbsp;&nbsp;&nbsp;3. A snort or sniff of fine-ground, powdered, or pulverized tobacco.<br>&nbsp;&nbsp;&nbsp;4. The act of briskly inhaling by the nose; a sniff, a snort.<br>&nbsp;&nbsp;&nbsp;5. Resentment or skepticism expressed by quickly drawing air through the nose; snuffling; sniffling.<br>&nbsp;&nbsp;&nbsp;6. Snot, mucus.<br>&nbsp;&nbsp;&nbsp;7. Smell, scent, odour.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To inhale through the nose.<br>&nbsp;&nbsp;&nbsp;2. To turn up the nose and inhale air, as an expression of contempt; hence, to take offence.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The burning part of a candle wick, or the black, burnt remains of a wick (which must be periodically removed).<br>&nbsp;&nbsp;&nbsp;2. Leavings in a glass after drinking; heeltaps.<br>&nbsp;&nbsp;&nbsp;3. A murder.<br>&nbsp;&nbsp;&nbsp;4. A form of pornographic film which involves someone actually being murdered.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To extinguish a candle or oil-lamp flame by covering the burning end of the wick until the flame is suffocated.<br>&nbsp;&nbsp;&nbsp;2. To trim the burnt part of a candle wick.<br>&nbsp;&nbsp;&nbsp;3. To kill a person; to snuff out.<br>", "etymology": "First recorded in 1520–30; probably from Middle Dutch snuffen, snoffen", "example": "He could imagine himself an Islamist avenger like that masked monster in black who appears in the ISIS snuff videos.", "synonym": "detect"}, {"word": "sniff", "definitionA": "to draw air through the nose in short, audible inhalations.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An instance of sniffing.<br>&nbsp;&nbsp;&nbsp;2. A quantity of something that is inhaled through the nose<br>&nbsp;&nbsp;&nbsp;3. A brief perception, or tiny amount.<br>&nbsp;&nbsp;&nbsp;4. Cocaine.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a short, audible inhalation, through the nose, as when smelling something.<br>&nbsp;&nbsp;&nbsp;2. To say something while sniffing, for example in case of illness or unhappiness, or in contempt.<br>&nbsp;&nbsp;&nbsp;3. To perceive vaguely<br>&nbsp;&nbsp;&nbsp;4. To be dismissive or contemptuous of something.<br>&nbsp;&nbsp;&nbsp;5. To intercept and analyse packets of data being transmitted over a network.<br>&nbsp;&nbsp;&nbsp;6. To inhale drugs in powder form (usually cocaine) through the nose.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. A short inhalation sound, sometimes associated with crying.<br>", "etymology": "1300–50; Middle English; back formation from snivel", "example": "So you have to position your business so that you have measurable audience reach that can survive the sniff test of very sophisticated marketers.", "synonym": "inspire"}, {"word": "douse", "definitionA": "to plunge into water or the like; drench:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sudden plunging into water.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To plunge suddenly into water; to duck; to immerse.<br>&nbsp;&nbsp;&nbsp;2. To fall suddenly into water.<br>&nbsp;&nbsp;&nbsp;3. To put out; to extinguish.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A blow or stroke, especially to the face.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To strike, beat, or thrash.<br>&nbsp;&nbsp;&nbsp;2. To strike or lower in haste; to slacken suddenly<br>", "etymology": "First recorded in 1590–1600; origin uncertain", "example": "Another douse of fuel on the fire was the Council president vote, which happened in December after the new City Council was sworn in.", "synonym": "duck"}, {"word": "stash", "definitionA": "to put by or away as for safekeeping or future use, usually in a secret place (usually followed by away ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection, sometimes hidden; a reserve.<br>&nbsp;&nbsp;&nbsp;2. A place where drugs are stored.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hide or store away for later use.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mustache<br>", "etymology": "1775–85; blend of stow and cache", "example": "LeBron James had his hands all over the Los Angeles Lakers’ decision to move a stash of assets for Anthony Davis.", "synonym": "abundance"}, {"word": "douce", "definitionA": "sedate; modest; quiet.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sweet; nice; pleasant.<br>&nbsp;&nbsp;&nbsp;2. Serious and quiet; steady, not flighty or casual; sober.<br>", "etymology": "1275–1325; Middle English < Middle French (feminine) < Latin dulcis sweet; dulcet", "example": "Mr. Douce thinks the custom of choosing valentines was a survival from the Roman feast of the Lupercalia.", "synonym": null}, {"word": "pediatrics", "definitionA": "the branch of medicine concerned with the development, care, and diseases of babies and children.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The branch of medicine that deals with the treatment of children.<br>", "etymology": "First recorded in 1880–85; ped- 1, + -iatrics", "example": "“The states made the right decisions, but the optics are awful in appearing to go rogue and undermining the federal agencies,” said Peter Hotez, a professor of pediatrics and molecular virology and microbiology at Baylor College of Medicine.", "synonym": null}, {"word": "aspersion", "definitionA": "a damaging or derogatory remark or criticism; slander:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An attack on somebody's reputation or good name, often in the phrase to cast aspersions upon….<br>&nbsp;&nbsp;&nbsp;2. A sprinkling, especially of holy water.<br>&nbsp;&nbsp;&nbsp;3. (in plural) slander, calumny<br>", "etymology": "First recorded in 1570–80; from Latin aspersiōn- (stem of aspersiō ) “a sprinkling”; asperse, -ion", "example": "He is frequently brash and interruptive, peppering dire warnings about vaccines with veiled aspersions toward Anthony Fauci and vague references to influential people who agree with him in private but cannot speak publicly.", "synonym": "abuse"}, {"word": "dulce", "definitionA": "a female given name: from the Latin word meaning “sweet.”", "definitionB": "No definition found", "etymology": null, "example": "Then unzip another layer to make room for the Saigon cinnamon doughnuts with dulce de leche.", "synonym": null}, {"word": "fastidious", "definitionA": "excessively particular, critical, or demanding; hard to please:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Excessively particular, demanding, or fussy about details, especially about tidiness and cleanliness.<br>&nbsp;&nbsp;&nbsp;2. Overly concerned about tidiness and cleanliness.<br>&nbsp;&nbsp;&nbsp;3. Difficult to please; quick to find fault.<br>", "etymology": "First recorded in 1375–1425; late Middle English, from Latin fastīdiōsus “squeamish,” from fastīdi(um) “lack of appetite, disgust” (perhaps from fastu(s) “pride, conceit” + -tīdium, combining form of taedium tedium ) + -ōsus -ous", "example": "She vacuums my carpet, and I asked her why she was so fastidious about vacuuming every nook and cranny in the house.", "synonym": null}, {"word": "squeamish", "definitionA": "fastidious or dainty.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Easily bothered or upset; tending to be nauseated or nervous; oversensitive<br>&nbsp;&nbsp;&nbsp;2. Averse or reluctant<br>", "etymology": "First recorded in 1450–1500; late Middle English squaymysch, squaimish(e), alteration of squemes, squaymes, squaimous, squaymous “easily nauseated, nauseating, fastidious,” from Anglo-French escoimus, escoymous; further origin uncertain", "example": "As a former vegetarian, I’m still squeamish about eating living things.", "synonym": null}, {"word": "nauseating", "definitionA": "causing sickness of the stomach; nauseous.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Causing disgust, revulsion or loathing<br>&nbsp;&nbsp;&nbsp;2. Causing nausea<br>", "etymology": "First recorded in 1635–45; nauseat(e) + -ing 2", "example": "Some complainants called state or local authorities about the nauseating scent, describing itchy eyes or chest tightness, complaint records show.", "synonym": "disgusting"}, {"word": "hullabaloo", "definitionA": "a clamorous noise or disturbance; uproar.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A clamour, a commotion; a fuss or uproar.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a commotion or uproar.<br>", "etymology": "1750–60; apparently variant of haloobaloo, rhyming compound based on Scots baloo lullaby", "example": "You may recall the hullabaloo in 2017 over some Facebook chatbots that “invented their own language.”", "synonym": "bedlam"}, {"word": "zonk", "definitionA": "to become unconscious from alcohol or narcotic drugs; pass out.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An unfavorable card or token, or undesirable or worthless item used as a prize in a contest or game show (such as Let's Make a Deal).<br>&nbsp;&nbsp;&nbsp;2. A feeling of a drug taking hold.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hit hard .<br>&nbsp;&nbsp;&nbsp;2. To make (someone) sleepy or delirious, to put into a stupor .<br>&nbsp;&nbsp;&nbsp;3. (usually followed by “out”) To become exhausted, sleepy or delirious.<br>", "etymology": "First recorded in 1945–50; of expressive origin; -onk perhaps copies conk 2", "example": null, "synonym": null}, {"word": "motif", "definitionA": "a recurring subject, theme, idea, etc., especially in a literary, artistic, or musical work.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A recurring or dominant element; a theme.<br>&nbsp;&nbsp;&nbsp;2. A short melodic passage that is repeated in several parts of a work.<br>&nbsp;&nbsp;&nbsp;3. A decorative figure that is repeated in a design or pattern.<br>&nbsp;&nbsp;&nbsp;4. A decorative appliqué design or figure, as of lace or velvet, used in trimming.<br>&nbsp;&nbsp;&nbsp;5. The physical object or objects repeated at each point of a lattice. Usually atoms or molecules.<br>&nbsp;&nbsp;&nbsp;6. A basic element of a move in terms of why the piece moves and how it supports the fulfilment of a stipulation.<br>&nbsp;&nbsp;&nbsp;7. In a nucleotide or amino-acid sequence, pattern that is widespread and has, or is conjectured to have, a biological significance.<br>", "etymology": "First recorded in 1840–50; from French; motive", "example": "Dorothy Draper, the mother of American interior design, was a master at mixing patterns, with her liberal use of motifs and colors.", "synonym": "design"}, {"word": "salubrious", "definitionA": "favorable to or promoting health; healthful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Promoting health or well-being; wholesome, especially as related to air.<br>", "etymology": "1540–50; from Latin salūbr(is) “promoting health” (akin to salūs “health”) + -ious", "example": "How much time it takes to see salubrious effects of plant-based diets is different from one symptom to another and from person to person.", "synonym": null}, {"word": "blaspheme", "definitionA": "to speak impiously or irreverently of (God or sacred things).", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To commit blasphemy; to speak against God or religious doctrine.<br>&nbsp;&nbsp;&nbsp;2. To speak of, or address, with impious irreverence; to revile impiously (anything sacred).<br>&nbsp;&nbsp;&nbsp;3. To calumniate; to revile; to abuse.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of irreverence or contempt toward a god or toward something considered sacred; an impious act, utterance, view, etc.<br>&nbsp;&nbsp;&nbsp;2. (by extension) An act of irreverence towards anything considered inviolable; the act of disregarding a convention.<br>", "etymology": "First recorded in 1300–50; Middle English, from Anglo-French, Late Latin blasphēmāre, from Greek blasphēmeîn “to speak profanely,” derivative of blásphēmos blasphemous", "example": "Her new single, “Pieta,” is something you can worship and blaspheme at the same time.", "synonym": "cuss"}, {"word": "neophyte", "definitionA": "a beginner or novice:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A beginner; a person who is new to a subject, skill, or belief.<br>&nbsp;&nbsp;&nbsp;2. A novice (recent convert); a new convert or proselyte; a new monk.<br>&nbsp;&nbsp;&nbsp;3. A name given by the early Christians, and still given by the Roman Catholics, to those who have recently embraced the Christian faith, and been admitted to baptism, especially those converts from heathenism or Judaism.<br>&nbsp;&nbsp;&nbsp;4. A plant species recently introduced to an area (in contrast to archaeophyte, a long-established introduced species).<br>", "etymology": "First recorded in 1540–50; from Late Latin neophytus “newly planted,” from Greek neóphytos; neo-, -phyte", "example": "At Hu’s direction, the neophyte spies started building a network.", "synonym": "abecedarian"}, {"word": "billet", "definitionA": "lodging for a soldier, student, etc., as in a private home or nonmilitary public building.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short informal letter.<br>&nbsp;&nbsp;&nbsp;2. A written order to quarter soldiers.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A place where a soldier is assigned to lodge.<br>&nbsp;&nbsp;&nbsp;2. An allocated space or berth in a boat or ship.<br>&nbsp;&nbsp;&nbsp;3. Berth; position.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a householder etc.) To lodge soldiers, or guests, usually by order.<br>&nbsp;&nbsp;&nbsp;2. (of a soldier) To lodge, or be quartered, in a private house.<br>&nbsp;&nbsp;&nbsp;3. To direct, by a ticket or note, where to lodge.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A semi-finished length of metal.<br>&nbsp;&nbsp;&nbsp;2. A short piece of wood, especially one used as firewood.<br>&nbsp;&nbsp;&nbsp;3. A short cutting of sugar cane produced by a harvester or used for planting.<br>&nbsp;&nbsp;&nbsp;4. A rectangle used as a charge on an escutcheon.<br>&nbsp;&nbsp;&nbsp;5. An ornament in Norman work, resembling a billet of wood, either square or round.<br>&nbsp;&nbsp;&nbsp;6. (saddlery) A strap that enters a buckle.<br>&nbsp;&nbsp;&nbsp;7. A loop that receives the end of a buckled strap.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An English fish, allied to the cod; the coalfish.<br>", "etymology": "First recorded in 1250–1300; Middle English billet, bylet “official register; record,” from Anglo-French, Old French billette, variant of Old French bullette, equivalent to bulle bill 1 + -ette -ette", "example": "My office still has no billet and no funding, this year and the next.", "synonym": "berth"}]