[{"word": "scupper", "definitionA": "Nautical.  a drain at the edge of a deck exposed to the weather, for allowing accumulated water to drain away into the sea or into the bilges. Compare freeing port.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A drainage hole on the deck of a ship.<br>&nbsp;&nbsp;&nbsp;2. A similar opening in a wall or parapet that allows water to drain from a roof.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Thwart or destroy, especially something belonging or pertaining to another; compare scuttle.<br>", "etymology": "First recorded in 1475–85; Middle English skopor, scopper; further origin uncertain", "example": "That action has scuppered some of the IAB-backed group’s plans.", "synonym": null}, {"word": "venation", "definitionA": "the arrangement of veins, as in a leaf or in the wing of an insect.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The hunting of wild animals.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The arrangement of veins in a leaf, wing, or similar structure.<br>", "etymology": "1640–50; < Latin vēn ( a ) vein + -ation", "example": "The venation is peculiar, and the disposition of the sori depends mainly on the peculiarities of the venation.", "synonym": "capillary"}, {"word": "deflower", "definitionA": "to deprive (a woman) of virginity.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take the virginity of (somebody), especially a woman or girl.<br>&nbsp;&nbsp;&nbsp;2. To deprive of flowers.<br>&nbsp;&nbsp;&nbsp;3. To deprive of grace and beauty.<br>", "etymology": "1350–1400; Middle English deflouren < Old French desflorer < Latin dēflōrāre, equivalent to dē- de- + flōr-, stem of flōs flower + -āre infinitive suffix", "example": "Individual inspiration was a sacred thing, which reality with its rules and prejudices could only spoil and deflower.", "synonym": "assault"}, {"word": "venery", "definitionA": "the gratification of sexual desire.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The hunting of wild animals.<br>&nbsp;&nbsp;&nbsp;2. Game animals.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The pursuit of sexual pleasure or indulgence.<br>", "etymology": "1490–1500; < Latin vener- (stem of venus; Venus ) + -y 3; compare Latin venera amours", "example": "The venery was a little further off, drawing toward the park.", "synonym": "hunting"}, {"word": "aulic", "definitionA": "of or relating to a royal court.", "definitionB": "No definition found", "etymology": "1695–1705; < Latin aulicus < Greek aulikós courtly, equivalent to aul ( ḗ ) hall, court + -ikos -ic", "example": "He had to go; and occupy himself complaining, soliciting Aulic-Councils and the like, for therest of his life.", "synonym": null}, {"word": "venerate", "definitionA": "to regard or treat with reverence; revere.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To treat with great respect and deference.<br>&nbsp;&nbsp;&nbsp;2. To revere or hold in awe.<br>", "etymology": "1615–25; < Latin venerātus, past participle of venerārī to solicit the goodwill of (a god), worship, revere, verbal derivative of vener-, stem of venus, presumably in its original sense “desire”; Venus )", "example": "The coach, a guest, venerates the stranger, who’s presumably a member, saying how he’d like to teach Howard golfers as much about the game that the older man has already forgotten.", "synonym": "admire"}, {"word": "venereal", "definitionA": "arising from, connected with, or transmitted through sexual intercourse, as an infection.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to the genitals or sexual intercourse.<br>&nbsp;&nbsp;&nbsp;2. Of a disease: sexually transmitted; of or relating to, or adapted to the cure of, a venereal disease.<br>&nbsp;&nbsp;&nbsp;3. Pertaining to the astrological influence of the planet Venus; lascivious, lustful.<br>&nbsp;&nbsp;&nbsp;4. Of or relating to copper (formerly called Venus by alchemists).<br>", "etymology": "1400–50; late Middle English < Latin venere ( us ) of sexual love ( vener-, stem of venus sexual charm ( Venus ) + -eus adj. suffix) + -al 1", "example": "Conservatives on Twitter howl derisively at these polls as if their purveyors are offering alchemical cures for venereal disease.", "synonym": "aphrodisiac"}, {"word": "venial", "definitionA": "able to be forgiven or pardoned; not seriously wrong, as a sin ( mortal ).", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pardonable; able to be forgiven.<br>&nbsp;&nbsp;&nbsp;2. Excusable; trifling<br>", "etymology": "1250–1300; Middle English < Medieval Latin veniālis, equivalent to Latin veni ( a ) grace, favor, indulgence (akin to venus; venerate, Venus ) + -ālis -al 1", "example": "Conventionality is the most venial of all moviemaking sins, if it’s a sin at all.", "synonym": null}, {"word": "ween", "definitionA": "to think; suppose.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Doubt; conjecture.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To suppose, imagine; to think, believe.<br>&nbsp;&nbsp;&nbsp;2. To expect, hope or wish.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To weep or cry.<br>&nbsp;&nbsp;&nbsp;2. To lament.<br>", "etymology": "before 900; Middle English wenen, Old English wēnan to expect; cognate with German wähnen to imagine, Old Norse væna, Gothic wēnjan to hope, expect", "example": "The use of ween is limited; and the third person, singular and plural, is generally indicated by the sign, O.", "synonym": null}, {"word": "wynn", "definitionA": "a character (ƿ) representing the sound (w) in Old English and early Middle English manuscripts, based on a rune with the same phonetic value.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A letter of the Old English alphabet, borrowed from the futhark and used to represent the sound of w; replaced in Middle English times by the digraph uu, which later developed into the letter w.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A kind of timber truck, or carriage.<br>", "etymology": "before 1100; Middle English wen, Old English wyn ( n ), special use of wyn ( n ) joy ( winsome, wish )", "example": "“No, the Second Amendment is exceptional not because it is uniquely oppressed or imperiled, but rather because it is singularly capable of causing harm,” wrote Wynn, a nominee of President Barack Obama.", "synonym": null}, {"word": "wont", "definitionA": "accustomed; used (usually followed by an infinitive):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One's habitual way of doing things; custom, habit, practice.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make (someone) used to; to accustom.<br>&nbsp;&nbsp;&nbsp;2. To be accustomed (to something), to be in the habit (of doing something).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Accustomed or used (to or with a thing), accustomed or apt (to do something).<br>", "etymology": "irst recorded in 1300–50; (adjective) Middle English wont, woned, Old English gewunod, past participle of gewunian “to be used to” ( won 2 ); cognate with German gewöhnt; (verb) Middle English, back formation from wonted or wont (past participle); (noun) apparently from conflation of wont (past participle) with obsolete wone “wish” in certain stereotyped phrases", "example": "Forgive my candor, though such is my wont, but much like that moose on a spit, Bernie is dead.", "synonym": "given"}]