[{"word": "paroxysm", "definitionA": "any sudden, uncontrollable outburst; a fit of emotion or action: a paroxysm of laughter; The war unleashed a paroxysm of violence.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A random or sudden outburst (of activity).<br>&nbsp;&nbsp;&nbsp;2. An explosive event during a volcanic eruption.<br>&nbsp;&nbsp;&nbsp;3. A sudden recurrence of a disease, such as a seizure or a coughing fit.<br>", "etymology": "First recorded in 1570–80; earlier paroxismos, from Greek paroxysmós “irritation,” derivative of paroxýnein “to irritate.” See par-, oxy- 1, -ism", "example": "\"The idea that you could have a Christian nationalist position would have just set Jefferson into paroxysms of rage,\" John said.", "synonym": "agitation"}, {"word": "patrician", "definitionA": "a person of noble or high rank; aristocrat.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (antiquity) A member of any of the families constituting the populus Romanus, or body of Roman citizens, before the development of the plebeian order; later, one who, by right of birth or by special privilege conferred, belonged to the senior class of Romans, who, with certain property, had by right a seat in the Roman Senate.<br>&nbsp;&nbsp;&nbsp;2. A person of high birth; a nobleman.<br>&nbsp;&nbsp;&nbsp;3. One familiar with the works of the Christian Fathers; one versed in patristic lore or life.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to the Roman patres (\"fathers\") or senators, or patricians.<br>&nbsp;&nbsp;&nbsp;2. Of, pertaining to, or appropriate to, a person of high birth; noble; not plebeian.<br>", "etymology": "First recorded in 1400–50; from Latin patrīci(us) “having the rank of patrician, noble,” (equivalent to patr-, stem of pater “father” + -īcius adjective suffix) + -an; replacing late Middle English patricion, from Old French patricien; patr- ( def ), -itious ( def ), -an ( def )", "example": "He’s one of those sci-fi characters whose normal Earthman name distinguishes him as a plebe among patricians.", "synonym": "grand"}, {"word": "vicarious", "definitionA": "performed, exercised, received, or suffered in place of another:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Delegated.<br>&nbsp;&nbsp;&nbsp;2. Experienced or gained by taking in another person’s experience, rather than through first-hand experience, such as through watching or reading.<br>&nbsp;&nbsp;&nbsp;3. On behalf of others.<br>", "etymology": "First recorded in 1630–40; from Latin vicārius “substituting,” equivalent to vic(is) (genitive) “interchange, alternation” ( vice 3 ) + -ārius -ary; -ous", "example": "Harrods has accepted vicarious liability for some of the claims, a legal term meaning it accepts ultimate responsibility for Al Fayed's alleged actions.", "synonym": null}, {"word": "saturnine", "definitionA": "sluggish in temperament; gloomy; taciturn.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a person: having a tendency to be cold, bitter, gloomy, sarcastic, and slow to change and react.<br>&nbsp;&nbsp;&nbsp;2. Of a setting: depressing, dull, gloomy.<br>&nbsp;&nbsp;&nbsp;3. Of, pertaining to, or containing lead (which was symbolically associated with the planet Saturn by alchemists).<br>&nbsp;&nbsp;&nbsp;4. Of a disease: caused by lead poisoning (saturnism); of a person: affected by lead poisoning.<br>&nbsp;&nbsp;&nbsp;5. Pertaining to the astrological influence of the planet Saturn; having the characteristics of a person under such influence (see sense 1).<br>", "etymology": "1400–50; late Middle English < Medieval Latin sāturnīnus ( Saturn, -ine 1 )", "example": "Cool-kid chefs turning local bounty into Michelin-worthy dishes, an artisan whisky boom and a clutch of stylish hotels have helped Scotland shrug off its saturnine image and rebrand as a misty, moody mecca.", "synonym": null}, {"word": "calcimine", "definitionA": "a white or tinted wash for walls, ceilings, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A form of whitewash (inexpensive white paint) made from calcium carbonate, glue and water, used to coat wooden or plaster surfaces.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To coat with this substance.<br>", "etymology": "First recorded in 1860–65; calci- + (kalso)mine", "example": "“He’s always getting paint and calcimine all over his clothes,” said Bill.", "synonym": null}, {"word": "admonish", "definitionA": "to caution, advise, or counsel against something.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To warn or notify of a fault; to reprove gently or kindly, but seriously; to exhort.<br>&nbsp;&nbsp;&nbsp;2. To counsel against wrong practices; to caution or advise; to warn against danger or an offense; — followed by of, against, or a subordinate clause.<br>&nbsp;&nbsp;&nbsp;3. To instruct or direct; to inform; to notify.<br>", "etymology": "First recorded in 1275–1325; late Middle English admonish, amonesche, admonesse, amoness, Middle English a(d)monest (with -t later taken as past participle suffix), from Anglo-French, Old French amonester, from Vulgar Latin admonestāre (unrecorded), apparently derivative of Latin admonēre “to remind, give advice to” (source of -est- is uncertain), equivalent to ad- ad- ( def ) + monēre “to remind, warn”; monitor ( def )", "example": "Maybe she yielded to the far left, which admonished her for stigmatizing felons.", "synonym": "check"}, {"word": "munificent", "definitionA": "extremely liberal in giving; very generous.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a person or group) Very liberal in giving or bestowing.<br>&nbsp;&nbsp;&nbsp;2. (of a gift, donation, etc.) Very generous; lavish.<br>", "etymology": "First recorded in 1565–75; back formation from munificence or from Latin mūnificentia “generosity, bountifulness,” equivalent to mūnific(us) “generous, bountiful” ( muni-, combining form of mūnus “service, duty, gift” + -ficus -fic ) + -entia -ence", "example": "Next to world food programs, it’s hard to think of a more munificent humanitarian contribution.", "synonym": null}, {"word": "trachea", "definitionA": "Anatomy, Zoology. the tube in humans and other air-breathing vertebrates extending from the larynx to the bronchi, serving as the principal passage for conveying air to and from the lungs; the windpipe.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin-walled, cartilaginous tube connecting the larynx to the bronchi; the windpipe.<br>&nbsp;&nbsp;&nbsp;2. Xylem vessel.<br>&nbsp;&nbsp;&nbsp;3. One of the cuticle-lined primary tubes in the respiratory system of an insect, which extend throughout its body.<br>", "etymology": "1350–1400; Middle English trache < Medieval Latin trāchēa, for Late Latin trāchīa < Greek trācheîa, short for artēría trācheîa rough artery, i.e., windpipe", "example": "The researchers discovered high levels of virus in the animals' nasal passages, trachea and lungs and moderate-to-low virus levels in other organs, consistent with H5N1 infections found in other mammals.", "synonym": "fauces"}, {"word": "belated", "definitionA": "coming or being after the customary, useful, or expected time:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To retard; cause something to be late; delay; benight.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Later in relation to the proper time something should have happened.<br>", "etymology": "First recorded in 1610–20; belate “to delay” ( be- + late ) + -ed 2", "example": "Director Ridley Scott returns to the site of one of his greatest triumphs with a belated sequel that follows the same beats, giving Denzel Washington a forum to scheme.", "synonym": null}, {"word": "negligible", "definitionA": "so small, trifling, or unimportant that it may safely be neglected or disregarded:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able to be neglected, ignored or excluded from consideration; too small or unimportant to be of concern.<br>", "etymology": "1820–30; < Latin neglig ( ere ) to neglect + -ible", "example": "\"The effect on me is negligible but these poor people have come up here,\" he said.", "synonym": null}, {"word": "thug", "definitionA": "a violent, lawless, or vicious person, especially one who commits a crime such as assault, robbery, or murder:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire.<br>&nbsp;&nbsp;&nbsp;2. One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her.<br>&nbsp;&nbsp;&nbsp;3. In gardening, an over-vigorous plant that spreads and dominates the flowerbed.<br>&nbsp;&nbsp;&nbsp;4. A punk; a hoodlum; a hooligan.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To commit acts of thuggery, to live the life of a thug, or to dress and act in a manner reminiscent of someone who does.<br>", "etymology": "First recorded in 1800–10; from Hindi, Marathi ṭhag “swindler, cheat, rogue,” perhaps from Sanskrit sthaga- “a cheat,” from sthagati “he conceals”", "example": "On the campaign trail, Trump repeatedly parroted propaganda used in Nazi Germany when pledging to “root out the communists, Marxists, fascists and the radical-left thugs that live like vermin within the confines of our country.”", "synonym": "delinquent"}, {"word": "misandrist", "definitionA": "someone, especially a woman, who hates, dislikes, or mistrusts men:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who professes misandry; a hater of men.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Exhibiting or pertaining to misandry: hating or prejudiced against men.<br>", "etymology": "First recorded in 1950–55; misandr(y) ( def ) + -ist ( def )", "example": "For a film about misandrist revolutionaries, “Mayday” lacks the courage of its convictions — it sets up boogeymen as targets only to shoot them point blank, in broad daylight.", "synonym": "misanthrope"}, {"word": "larva", "definitionA": "Entomology. the immature, wingless, feeding stage of an insect that undergoes complete metamorphosis.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An early stage of growth for some insects and amphibians, in which after hatching from their egg, insects are wingless and resemble a caterpillar or grub, and amphibians lack limbs and resemble fish.<br>&nbsp;&nbsp;&nbsp;2. An animal in the aforementioned stage.<br>&nbsp;&nbsp;&nbsp;3. A form of a recently born or hatched animal that is quite different from its adult stage.<br>", "etymology": "First recorded in 1645–55; from New Latin; special use of Latin larva “a ghost, specter, mask, skeleton”; akin to Lares", "example": "To examine this, experiments were carried out in mice and insect larvae.", "synonym": "butterfly"}, {"word": "parry", "definitionA": "to ward off (a thrust, stroke, weapon, etc.), as in fencing; avert.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A defensive or deflective action; an act of parrying.<br>&nbsp;&nbsp;&nbsp;2. A simple defensive action designed to deflect an attack, performed with the forte of the blade.<br>&nbsp;&nbsp;&nbsp;3. (combat sports and martial arts) A defensive move intended to change the direction of an incoming strike to make it miss its intended target, rather than block and absorb it; and typically performed with an open hand in a downward or sideways slapping motion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To avoid, deflect, or ward off (an attack, a blow, an argument, etc.).<br>", "etymology": "1665–75; < French parez, imperative of parer to ward off, set off < Latin parāre to set. See parade", "example": "Unlike commercial antibiotics, phages evolve alongside their bacterial hosts, dodging and parrying the bacterial response so that for every pathogen, there’s likely a bacteriophage, somewhere, that eats it.", "synonym": "anticipate"}, {"word": "chime", "definitionA": "an apparatus for striking a bell so as to produce a musical sound, as one at the front door of a house by which visitors announce their presence.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A musical instrument producing a sound when struck, similar to a bell (e.g. a tubular metal bar) or actually a bell. Often used in the plural to refer to the set: the chimes.<br>&nbsp;&nbsp;&nbsp;2. An individual ringing component of such a set.<br>&nbsp;&nbsp;&nbsp;3. A small bell or other ringing or tone-making device as a component of some other device.<br>&nbsp;&nbsp;&nbsp;4. The sound of such an instrument or device.<br>&nbsp;&nbsp;&nbsp;5. A small hammer or other device used to strike a bell.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make the sound of a chime.<br>&nbsp;&nbsp;&nbsp;2. To cause to sound in harmony; to play a tune, as upon a set of bells; to move or strike in harmony.<br>&nbsp;&nbsp;&nbsp;3. To utter harmoniously; to recite rhythmically.<br>&nbsp;&nbsp;&nbsp;4. To agree; to correspond.<br>&nbsp;&nbsp;&nbsp;5. To make a rude correspondence of sounds; to jingle, as in rhyming.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The top of a ridge.<br>&nbsp;&nbsp;&nbsp;2. The spine of an animal.<br>&nbsp;&nbsp;&nbsp;3. A piece of the backbone of an animal, with the adjoining parts, cut for cooking.<br>&nbsp;&nbsp;&nbsp;4. A sharp angle in the cross section of a hull.<br>&nbsp;&nbsp;&nbsp;5. A hollowed or bevelled channel in the waterway of a ship's deck.<br>&nbsp;&nbsp;&nbsp;6. The edge or rim of a cask, etc., formed by the projecting ends of the staves; the chamfered end of a stave.<br>&nbsp;&nbsp;&nbsp;7. The back of the blade on a scythe.<br>", "etymology": "First recorded in 1250–1300; Middle English chymbe belle “cymbal, chime,” literally, “chime bell,” by false analysis of chimbel, chimble, from Old English cimbal, cimbala, or from Old French chimbe, variant of cimbe, cimble cymbal", "example": "“This is my adopted campaign,” Krell said amid the chimes of slot machines, wearing a hot pink blazer and matching tennis shoes at a makeshift volunteer headquarters inside a Reno casino last month.", "synonym": "bell"}, {"word": "eddy", "definitionA": "a current at variance with the main current in a stream of liquid or gas, especially one having a rotary or whirling motion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A current of air or water running back, or in an opposite direction to the main current.<br>&nbsp;&nbsp;&nbsp;2. A circular current; a whirlpool.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To form an eddy; to move in, or as if in, an eddy; to move in a circle.<br>", "etymology": "1425–75; late Middle English; Old English ed- turning + ēa water; akin to Old Norse itha", "example": "Understanding how fish swim in eddies could also aid in habitat restoration, the team says, helping conservationists engineer more efficient fish passages through dams.", "synonym": "swirl"}, {"word": "bequest", "definitionA": "a disposition in a will.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of bequeathing or leaving by will.<br>&nbsp;&nbsp;&nbsp;2. The transfer of property upon the owner's death according to the will of the deceased.<br>&nbsp;&nbsp;&nbsp;3. That which is left by will; a legacy.<br>&nbsp;&nbsp;&nbsp;4. That which has been handed down or transmitted.<br>&nbsp;&nbsp;&nbsp;5. A person's inheritance; an amount of property given by will.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give as a bequest; bequeath.<br>", "etymology": "1250–1300; Middle English biqueste, biquyste, equivalent to bi- be- + quiste will, bequest, Old English -cwis ( se ) (with excrescent t, as in behest ), noun derivative of cwethan to say; on the model of bequethen bequeath", "example": "But for the Orlando Museum of Art, which recently received a $1.8 million bequest from the estate of Margaret Young, that gift couldn’t have come at a better time.", "synonym": "bestowal"}, {"word": "behest", "definitionA": "a command or directive.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A command, bidding; sometimes also, an authoritative request; now usually in the phrase at the behest of.<br>&nbsp;&nbsp;&nbsp;2. A vow; a promise.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To promise; vow.<br>", "etymology": "before 1000; Middle English bihest ( e ), Old English behǣs promise. See be-, hest", "example": "With only weeks to go before election day, both newspapers declined to endorse either candidate in the presidential race at the behest of their owners.", "synonym": "bidding"}, {"word": "quoth", "definitionA": "said (used with nouns, and with first- and third-person pronouns, and always placed before the subject):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To say or declare.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (defective, modal, auxiliary) to say<br>", "etymology": "First recorded in 1150–1200; preterit of quethe (otherwise obsolete), Middle English quethen, Old English cwethan “to say.” bequeath", "example": "“Nameless here for evermore. . . Darkness there and nothing more. . . Merely this and nothing more. . . Quoth the Raven ‘Nevermore.’”", "synonym": null}]