[{"word": "iconoclast", "definitionA": "a person who attacks cherished beliefs, traditional institutions, etc., as being based on error or superstition.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who destroys religious images or icons, especially an opponent of the Orthodox Church in the 8th and 9th centuries, or a Puritan during the European Reformation.<br>&nbsp;&nbsp;&nbsp;2. One who opposes orthodoxy and religion; one who adheres to the doctrine of iconoclasm.<br>&nbsp;&nbsp;&nbsp;3. (by extension) One who attacks cherished beliefs.<br>", "etymology": "1590–1600; < Medieval Latin īconoclastēs < Medieval Greek eikonoklástēs, equivalent to Greek eikono- icono- + -klastēs breaker, equivalent to klas- (variant stem of klân to break) + -tēs agent noun suffix", "example": "He is both icon and iconoclast, one of the most expressive athletes in one of the most stylish sports.", "synonym": "critic"}, {"word": "nebula", "definitionA": "Astronomy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cloud in outer space consisting of gas or dust (e.g. a cloud formed after a star explodes).<br>&nbsp;&nbsp;&nbsp;2. A white spot or slight opacity of the cornea.<br>&nbsp;&nbsp;&nbsp;3. A cloudy appearance in the urine<br>", "etymology": "First recorded in 1655–65; from Latin: “cloud, mist, vapor”; akin to German Nebel “fog, haze,” Greek nephélē “cloud,” Sanskrit nábha- “cloud, vapor”", "example": "The top notes are listed as cosmic dust and antimatter particles, the heart of the fragrance is described as starlight, the scent of Supernova, and the base notes are atmospheric vapour, and dark nebulae.", "synonym": "galaxy"}, {"word": "abominable", "definitionA": "repugnantly hateful; detestable; loathsome:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Worthy of, or causing, abhorrence, as a thing of evil omen; odious in the utmost degree; very hateful; detestable; loathsome; execrable.<br>&nbsp;&nbsp;&nbsp;2. Excessive, large (used as an intensifier).<br>&nbsp;&nbsp;&nbsp;3. Very bad or inferior.<br>&nbsp;&nbsp;&nbsp;4. Disagreeable or unpleasant.<br>", "etymology": "1325–75; Middle English < Latin abōminābilis, equivalent to abōminā ( rī ) to pray to avert an eventuality, despise as a bad omen, abhor ( ab-, omen ) + -bilis -ble", "example": "An ethical case can be made for dropping an abominable turd in of their Type-A track, just for humbling.", "synonym": null}, {"word": "grapple", "definitionA": "to hold or make fast to something, as with a grapple.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A close hand-to-hand struggle; the act of grappling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To seize something and hold it firmly.<br>&nbsp;&nbsp;&nbsp;2. To wrestle or tussle.<br>&nbsp;&nbsp;&nbsp;3. (with with) To ponder and intensely evaluate a problem.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tool with claws or hooks which is used to catch or hold something.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fasten, as with a grapple; (by extension) to fix; to join indissolubly.<br>&nbsp;&nbsp;&nbsp;2. To climb (whether by means of a grapple and rope, or by hand, etc).<br>&nbsp;&nbsp;&nbsp;3. To use a grapple (for example to attempt to find, hook, and raise a net or cable).<br>&nbsp;&nbsp;&nbsp;4. To hook and raise with a grapple.<br>", "etymology": "1520–30; apparently a frequentative of Old English gegrǣppian to seize; associated with grapnel", "example": "Those two lines cross, and slide up one another, and then there’s a grapple and capture.", "synonym": "attack"}, {"word": "gyrate", "definitionA": "to move in a circle or spiral, or around a fixed point; whirl.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To revolve round a central point; to move spirally about an axis, as a tornado; to revolve.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having coils or convolutions<br>", "etymology": "First recorded in 1820–30, gyrate is from the Latin word gȳrātus (past participle of gȳrāre to turn around). See gyr-, -ate 1", "example": "The tiny particles create the glow in radio light as they gyrate in a magnetic field.", "synonym": "circle"}, {"word": "gyre", "definitionA": "a ring or circle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A swirling vortex.<br>&nbsp;&nbsp;&nbsp;2. A circular current, especially a large-scale ocean current.<br>&nbsp;&nbsp;&nbsp;3. A circular motion, or a circle described by a moving body; a turn or revolution; a circuit.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To whirl<br>", "etymology": "1560–70; < Latin gȳrus < Greek gŷros ring, circle", "example": "The gyre, which lies between Hawaii and California, is formed by rotating ocean currents and has, over the past 50 plus years, become a reservoir for plastic litter of all sizes.", "synonym": "aureole"}, {"word": "demiurge", "definitionA": "Philosophy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The (usually benevolent) being that created the universe out of primal matter.<br>&nbsp;&nbsp;&nbsp;2. A (usually jealous or outright malevolent) being who is inferior to the supreme being, and sometimes seen as the creator of evil.<br>&nbsp;&nbsp;&nbsp;3. Something (such as an idea, individual or institution) conceived as an autonomous creative force or decisive power.<br>&nbsp;&nbsp;&nbsp;4. The title of a magistrate in a number of states of Ancient Greece, and in the city states (poleis) of the Achaean League.<br>", "etymology": "First recorded in 1590–1600; from Greek dēmiourgós “a worker for the people, public worker, skilled worker,” equivalent to dḗmio(s) “of the people, public” + -ergos “a worker,” derivative of érgon work ( none )", "example": "It was one of the forms symbolic of the Demiurge or Maker of our universe.", "synonym": null}, {"word": "lethargy", "definitionA": "the quality or state of being drowsy and dull, listless and unenergetic, or indifferent and lazy; apathetic or sluggish inactivity.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A condition characterized by extreme fatigue or drowsiness, or prolonged sleep patterns.<br>&nbsp;&nbsp;&nbsp;2. A state of extreme torpor or apathy, especially with lack of emotion or interest; loosely, sluggishness, laziness.<br>", "etymology": "First recorded in 1325–75; from Late Latin lēthargia, from Greek lēthargía, equivalent to lḗtharg(os) “drowsy” + -ia -y 3 ( Lethe, -algia ); replacing Middle English litargie, from Medieval Latin litargīa, from Late Greek, Greek, as above", "example": "The EU for all its lethargy, faults and fetishization of bureaucracy, is, ultimately, a good idea.", "synonym": "coma"}, {"word": "dally", "definitionA": "to waste time; loiter; delay.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To waste time in trivial activities, or in idleness; to trifle.<br>&nbsp;&nbsp;&nbsp;2. To caress, especially of a sexual nature; to fondle or pet<br>&nbsp;&nbsp;&nbsp;3. To delay unnecessarily; to while away.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Several wraps of rope around the saddle horn, used to stop animals in roping.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wind the lasso rope (ie throw-rope) around the saddle horn (the saddle horn is attached to the pommel of a western style saddle) after the roping of an animal<br>", "etymology": "First recorded in 1250–1300; Middle English dalien from Anglo-French dalier “to chat,” of uncertain origin", "example": "Still, DAC’s gardens remind him that nature’s seasons never dally.", "synonym": "boondoggle"}, {"word": "catawampus", "definitionA": "askew; awry.", "definitionB": "No definition found", "etymology": "First recorded in 1830–40 for earlier sense “utterly”; cata- diagonally ( cater-cornered ) + -wampus, perhaps akin to wampish", "example": "Whenever the barometer goes up two points Catawampus must be remembered.", "synonym": "bowed"}, {"word": "askew", "definitionA": "to one side; out of line; in a crooked position; awry:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Turned or twisted to one side.<br>&nbsp;&nbsp;&nbsp;2. Untoward, unfavourable.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Tilted to one side.<br>", "etymology": "First recorded in 1565–75; a- 1 + skew", "example": "One popular theory holds that Jupiter and Saturn shifted in their orbits billions of years ago, a reshuffling that knocked the orbits of distant comets askew and send them careening into the inner solar system.", "synonym": null}, {"word": "awry", "definitionA": "with a turn or twist to one side; askew:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Turned or twisted toward one side; crooked, distorted, out of place; wry.<br>&nbsp;&nbsp;&nbsp;2. Wrong or distorted; perverse, amiss.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Obliquely, crookedly; askew.<br>&nbsp;&nbsp;&nbsp;2. Perversely, improperly.<br>", "etymology": "First recorded in 1325–75, awry is from Middle English on wry. See a- 1, wry", "example": "Even with these advances, positioning signals encounter interference and other conditions that can make them go awry.", "synonym": "twisted"}]