[{"word": "labefaction", "definitionA": "a shaking or weakening; overthrow or downfall.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of shaking or weakening or the resulting state; overthrow, ruination.<br>", "etymology": "1610–20; < Late Latin labefactiōn- (stem of labefactiō ), equivalent to labefact ( us ) (past participle of labefacere to loosen) + -iōn- -ion", "example": null, "synonym": null}, {"word": "nauseous", "definitionA": "affected with nausea; nauseated:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Causing nausea; sickening or disgusting.<br>&nbsp;&nbsp;&nbsp;2. (sometimes proscribed) Afflicted with nausea; sick.<br>", "etymology": "First recorded in 1595–1605; from Latin nauseōsus; nausea, -ous", "example": "Further, four out of 10 women taking the drug reported that it made them nauseous.", "synonym": null}, {"word": "labile", "definitionA": "apt or likely to change:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Liable to slip, err, fall, or apostatize.<br>&nbsp;&nbsp;&nbsp;2. Apt or likely to change.<br>&nbsp;&nbsp;&nbsp;3. (of a compound or bond) Kinetically unstable; rapidly cleaved (and possibly reformed).<br>&nbsp;&nbsp;&nbsp;4. (of a verb) Able to change valency without changing its form; especially, able to be used both transitively and intransitively without changing its form.<br>", "etymology": "First recorded in 1400–50; late Middle English labil “(of the mind) wandering, forgetful,” from Latin lābilis “sliding, slipping, (of verse) smooth-flowing,” equivalent to Latin lāb(ī) “to slip” + -ilis -ile", "example": "“People with a history of trauma and mental illness tend to be emotionally labile,” Kupers added.", "synonym": null}, {"word": "labiodental", "definitionA": "articulated with the lower lip touching the upper front teeth, as f or v, or, rarely, with the upper lip touching the lower front teeth.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A speech sound articulated with the lower lip and upper teeth.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Articulated with the lower lip and upper teeth<br>", "etymology": "First recorded in 1660–70; labio- + dental", "example": null, "synonym": null}, {"word": "tart", "definitionA": "sharp to the taste; sour or acid:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sharp to the taste; acid; sour.<br>&nbsp;&nbsp;&nbsp;2. (of wine) high or too high in acidity.<br>&nbsp;&nbsp;&nbsp;3. Sharp; keen; severe.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A type of small open pie, or piece of pastry, containing jelly or conserve; a sort of fruit pie.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A prostitute.<br>&nbsp;&nbsp;&nbsp;2. By extension, any woman with loose sexual morals.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To practice prostitution<br>&nbsp;&nbsp;&nbsp;2. To practice promiscuous sex<br>&nbsp;&nbsp;&nbsp;3. To dress garishly, ostentatiously, whorishly, or sluttily<br>", "etymology": "First recorded before 1000; Middle English; Old English teart “sharp, rough”; akin to Dutch tarten “to defy,” Middle High German traz “defiance”", "example": "These unique cookies are slightly chewy, with a deep, earthy flavor from the rye — and then you get a burst of fresh tart fruit that makes you want to take another bite.", "synonym": "acid"}, {"word": "taciturn", "definitionA": "inclined to silence; reserved in speech; reluctant to join in conversation.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Silent; temperamentally untalkative; disinclined to speak.<br>", "etymology": "First recorded in 1765–75; from Latin taciturnus, “quiet, maintaining silence,” equivalent to tacit(us) “silent” ( tacit ) + -urnus adjective suffix of time", "example": "Justin, as I would soon learn, is a large and taciturn man, but he was eager to talk, and urged me to come to New Mexico to learn more about what Kooper and his friends had been through.", "synonym": null}, {"word": "rendition", "definitionA": "the act of rendering.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The surrender (of a city, fortress etc.).<br>&nbsp;&nbsp;&nbsp;2. The handing over of a person or thing.<br>&nbsp;&nbsp;&nbsp;3. Translation between languages, or between forms of a language; a translated text or work.<br>&nbsp;&nbsp;&nbsp;4. Formal deliverance of a verdict.<br>&nbsp;&nbsp;&nbsp;5. The handing-over of someone wanted for justice who has fled a given jurisdiction; extradition.<br>&nbsp;&nbsp;&nbsp;6. An interpretation or performance of an artwork, especially a musical score or musical work.<br>&nbsp;&nbsp;&nbsp;7. A given visual reproduction of something.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To surrender or hand over (a person or thing); especially, for one jurisdiction to do so to another.<br>", "etymology": "1595–1605; < Middle French, alteration of reddition (< Middle English reddicion ) < Late Latin redditiōn- (stem of redditiō ), equivalent to Latin reddit ( us ) (past participle of reddere; render 1 ) + -iōn- -ion", "example": "For example, while Southern enslavers emphasized their summary right of recaption of fugitives, abolitionists emphasized states’ authority to require due process in renditions.", "synonym": "arrangement"}, {"word": "pemmican", "definitionA": "dried meat pounded into a powder and mixed with hot fat and dried fruits or berries, pressed into a loaf or into small cakes, originally prepared by North American Indians.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A food made from meat which has been dried and beaten into a paste, mixed with berries and rendered fat, and shaped into little patties.<br>&nbsp;&nbsp;&nbsp;2. A speech or piece of writing that is very condensed, conveying a lot of thought or information in few words.<br>", "etymology": "1735–45; < Cree pimihka·n, derivative of pimihke·w he makes pemmican (mixing together the grease and other ingredients), he makes grease < Proto-Algonquian *pemihke·wa, equivalent to *pemy- grease + *-ehke· make", "example": "At the worst, an abstract ideal is pemmican to carry the voyager through the long nights until the ice begins to break.", "synonym": null}, {"word": "despondent", "definitionA": "feeling or showing profound hopelessness, dejection, discouragement, or gloom:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. In low spirits from loss of hope or courage.<br>", "etymology": "First recorded in 1690–1700; from Latin dēspondent-, stem of dēspondēns “giving up,” present participle of dēspondēre “to give up, lose heart, promise”; despond", "example": "His campaign was ready to sue over “anything suspicious,” and “a lot of things have been suspicious so far,” but he wouldn't let his voters get despondent.", "synonym": null}, {"word": "sclerodermatous", "definitionA": "Zoology. covered with a hardened tissue, as scales.", "definitionB": "No definition found", "etymology": "First recorded in 1895–1900; sclero- + -dermatous", "example": null, "synonym": null}]