[{"word": "purge", "definitionA": "to rid of whatever is impure or undesirable; cleanse; purify:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of purging.<br>&nbsp;&nbsp;&nbsp;2. An evacuation of the bowels or a vomiting.<br>&nbsp;&nbsp;&nbsp;3. A cleansing of pipes.<br>&nbsp;&nbsp;&nbsp;4. A forcible removal of people, for example, from political activity.<br>&nbsp;&nbsp;&nbsp;5. That which purges; especially, a medicine that evacuates the intestines; a cathartic.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To clean thoroughly; to cleanse; to rid of impurities.<br>&nbsp;&nbsp;&nbsp;2. To free from sin, guilt, or the burden or responsibility of misdeeds<br>&nbsp;&nbsp;&nbsp;3. To remove by cleansing; to wash away.<br>&nbsp;&nbsp;&nbsp;4. To void or evacuate (the bowels or the stomach); to defecate or vomit.<br>&nbsp;&nbsp;&nbsp;5. To cause someone to purge, operate on (somebody) as or with a cathartic or emetic, or in a similar manner.<br>&nbsp;&nbsp;&nbsp;6. To clear of a charge, suspicion, or imputation<br>&nbsp;&nbsp;&nbsp;7. To clarify; to clear the dregs from (liquor).<br>&nbsp;&nbsp;&nbsp;8. To become pure, as by clarification.<br>&nbsp;&nbsp;&nbsp;9. To have or produce frequent evacuations from the intestines, as by means of a cathartic.<br>&nbsp;&nbsp;&nbsp;10. To trim, dress or prune.<br>", "etymology": "First recorded in 1250–1300; (verb) Middle English purgen, from Old French purg(i)er, from Latin pūrgāre “to cleanse”; (noun) Middle English, from Old French, derivative of the verb", "example": "The members alleged an ideological purge of the party, given most of them were aligned with the tea party.", "synonym": "abolition"}, {"word": "binge", "definitionA": "a period or bout, usually brief, of excessive indulgence, as in eating, drinking alcoholic beverages, etc.; spree.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short period of excessive consumption, especially of food, alcohol, narcotics, etc.<br>&nbsp;&nbsp;&nbsp;2. (by extension) A short period of an activity done in excess, such as watching a television show.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To engage in a short period of excessive consumption, especially of excessive alcohol consumption.<br>", "etymology": "First recorded in 1850–55; dialectal (Lincolnshire) binge “to soak”; further origin unknown", "example": "Of course, those nightly Internet binges were not without misdirection.", "synonym": "bacchanal"}, {"word": "anorexia", "definitionA": "Psychiatry. anorexia nervosa.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Loss of appetite, especially as a result of disease.<br>&nbsp;&nbsp;&nbsp;2. Anorexia nervosa.<br>", "etymology": "First recorded in 1590–1600; from New Latin, from Greek, from an- an- 1 + órex(is) “appetite, desire, longing” (from orég(ein) “to reach, stretch” + -sis -sis ) + -ia -ia", "example": "Gender is also a factor in eating disorders such as anorexia nervosa, which is three times as prevalent among women as men.", "synonym": "atrophy"}, {"word": "reify", "definitionA": "to convert into or regard as a concrete thing:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To regard something abstract as if it were a concrete material thing<br>", "etymology": "First recorded in 1850–55; from Latin rē(s) “thing” + -ify", "example": "It would reify the division between Israelis living within the Green Line and those living beyond it.", "synonym": "actualize"}, {"word": "arrogate", "definitionA": "to claim unwarrantably or presumptuously; assume or appropriate to oneself without right:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To appropriate or lay claim to something for oneself without right.<br>", "etymology": "1530–40; < Latin arrogātus appropriated, assumed, questioned (past participle of arrogāre ), equivalent to arrog- ( ar- ar- + rog ( āre ) to ask, propose) + -ātus -ate 1", "example": "And so they try to arrogate my medical authority for their cause.", "synonym": "appropriate"}, {"word": "orectic", "definitionA": "of or relating to desire; appetitive.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to desire or appetite<br>", "etymology": "1665–75; < Greek orektikós appetitive, equivalent to orekt(ós) stretched out, longed for (derivative of orégein to grasp for, desire) + -ikos -ic", "example": "Associated words: desiderative, desideratum, orectic, optative.", "synonym": null}, {"word": "rectify", "definitionA": "to make, put, or set right; remedy; correct:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To heal (an organ or part of the body).<br>&nbsp;&nbsp;&nbsp;2. To restore (someone or something) to its proper condition; to straighten out, to set right.<br>&nbsp;&nbsp;&nbsp;3. To remedy or fix (an undesirable state of affairs, situation etc.).<br>&nbsp;&nbsp;&nbsp;4. To purify or refine (a substance) by distillation.<br>&nbsp;&nbsp;&nbsp;5. To correct or amend (a mistake, defect etc.).<br>&nbsp;&nbsp;&nbsp;6. To correct (someone who is mistaken).<br>&nbsp;&nbsp;&nbsp;7. (geodesy) To adjust (a globe or sundial) to prepare for the solution of a proposed problem.<br>&nbsp;&nbsp;&nbsp;8. To convert (alternating current) into direct current.<br>&nbsp;&nbsp;&nbsp;9. To determine the length of a curve included between two limits.<br>&nbsp;&nbsp;&nbsp;10. To produce (as factitious gin or brandy) by redistilling bad wines or strong spirits (whisky, rum, etc.) with flavourings.<br>", "etymology": "First recorded in 1350–1400; Middle English rectifien, from Middle French rectifier, from Medieval Latin rēctificāre, from Latin rēct(us) “right, straight” + -ificāre -ify; right", "example": "City real estate professionals moved on this year amid the controversy, and city taxpayers will continue to be on the hook for the millions of dollars associated with rectifying them.", "synonym": "adjust"}, {"word": "rectilinear", "definitionA": "forming a straight line.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. In a straight line.<br>&nbsp;&nbsp;&nbsp;2. Formed from straight lines.<br>", "etymology": "1650–60; < Late Latin rēctilīne ( us ) ( rēcti- recti- + līne ( a ) line 1 + -us adj. suffix) + -ar 1", "example": "It shows a boy, not looking where he’s going, head in a book, as he travels from a mostly rectilinear and geometric landscape to a riot of twisted and abstract forms, reminiscent of seas and forest floors and other worlds.", "synonym": "equilateral"}, {"word": "rectitude", "definitionA": "rightness of principle or conduct; moral virtue:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Straightness; the state or quality of having a constant direction and not being crooked or bent.<br>&nbsp;&nbsp;&nbsp;2. The fact or quality of being right or correct; correctness of opinion or judgement.<br>&nbsp;&nbsp;&nbsp;3. Conformity to the rules prescribed for moral conduct; (moral) uprightness, virtue.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Middle French rectitude, “honesty,” from Late Latin rēctitūdin- (stem of rēctitūdō “straightness, upright posture, honesty, justice”), equivalent to Latin rēct(us) right + -tūdin- -tude", "example": "That was true most dramatically for New York City in the 1970s, though other cities such as Detroit and Chicago were hardly models of fiscal rectitude.", "synonym": "goodness"}, {"word": "prerogative", "definitionA": "an exclusive right, privilege, etc., exercised by virtue of rank, office, or the like:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hereditary or official right or privilege.<br>&nbsp;&nbsp;&nbsp;2. A right, or power that is exclusive to a monarch etc, especially such a power to make a decision or judgement.<br>&nbsp;&nbsp;&nbsp;3. A right, especially when due to one's position or role.<br>&nbsp;&nbsp;&nbsp;4. A property, attribute or ability which gives one a superiority or advantage over others; an inherent advantage or privilege; a talent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a hereditary or official right or privilege.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin praerogātīvus (adjective) “voting first,” praerogātīva (noun use of feminine of adjective) “tribe or century with right to vote first.” See pre-, interrogative", "example": "There’s got to be a better way for the city to register community engagement, even while duly elected representatives retain their voting prerogative.", "synonym": "advantage"}, {"word": "interrogate", "definitionA": "to ask questions of (a person), sometimes to seek answers or information that the person questioned considers personal or secret.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To question or quiz, especially in a thorough and/or aggressive manner<br>&nbsp;&nbsp;&nbsp;2. To query; to request information from.<br>&nbsp;&nbsp;&nbsp;3. To examine critically.<br>", "etymology": "First recorded in 1475–85; from Latin interrogātus, past participle of interrogāre “to question, examine,” equivalent to inter- “between, among, together” + rogā(re) “to ask” + -tus past participle suffix; inter-", "example": "People love the creative storytelling aspect of the game and the strategy behind sounding believable or interrogating someone for the truth.", "synonym": "catechize"}, {"word": "derogate", "definitionA": "to detract, as from authority, estimation, etc. (usually followed by from ).", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To partially repeal (a law etc.).<br>&nbsp;&nbsp;&nbsp;2. To detract from (something); to disparage, belittle.<br>&nbsp;&nbsp;&nbsp;3. To take away (something from something else) in a way which leaves it lessened.<br>&nbsp;&nbsp;&nbsp;4. To remove a part, to detract from (a quality of excellence, authority etc.).<br>&nbsp;&nbsp;&nbsp;5. To act in a manner below oneself; to debase oneself.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Debased<br>", "etymology": "First recorded in 1375–1425; late Middle English from Latin dērogātus “repealed, restricted” (past participle of dērogāre ), equivalent to dē- de- + rog(āre) “to ask” + -ātus -ate 1", "example": "Bulgaria cannot rely on its national and constitutional identity and public order to derogate from the fundamental rights of EU citizens.", "synonym": "denigrate"}, {"word": "compost", "definitionA": "a mixture of various decaying organic substances, as dead leaves or manure, used for fertilizing soil.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The decayed remains of organic matter that has rotted into a natural fertilizer.<br>&nbsp;&nbsp;&nbsp;2. A mixture; a compound.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To produce compost, let organic matter decay into fertilizer.<br>", "etymology": "1350–1400; Middle English < Anglo-French, Middle French < Latin compositum, noun use of neuter of compositus composite; compote", "example": "She’s been tracking the amount of carbon her farm retains if she adds compost and rarely tills the land.", "synonym": "humus"}, {"word": "mulch", "definitionA": "a covering, as of straw, compost, or plastic sheeting, spread on the ground around plants to prevent excessive evaporation or erosion, enrich the soil, inhibit weed growth, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any material used to cover the top layer of soil to protect, insulate, or decorate it, or to discourage weeds or retain moisture.<br>&nbsp;&nbsp;&nbsp;2. A material used as mulch, as a decorative redwood bark mulch.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To apply mulch.<br>&nbsp;&nbsp;&nbsp;2. To turn into mulch.<br>", "etymology": "1650–60; noun use of obsolete mulch (adj.), Middle English molsh soft, Old English myl ( i ) sc mellow; cognate with dialectal German molsch soft, overripe", "example": "I focused on the sound of the forest mulch crunching beneath my feet.", "synonym": "litter"}, {"word": "guano", "definitionA": "a natural manure composed chiefly of the excrement of sea birds, found especially on islands near the Peruvian coast.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Dung from a sea bird or from a bat.<br>&nbsp;&nbsp;&nbsp;2. A variety of seabird.<br>", "etymology": "First recorded in 1595–1605; from Spanish: “fertilizer, dung”; Latin American Spanish huano “dung,” from Quechua wanu “dung for fuel, fertilizer”", "example": "By taking thousands of samples from guano, fecal swabs, and bat tissue, and searching those samples for genetic sequences similar to SARS, Shi’s team began to discover many closely related viruses.", "synonym": "crap"}]
