[{"word": "gloat", "definitionA": "to look at or think about with great or excessive, often smug or malicious, satisfaction:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act or instance of gloating.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To exhibit a conspicuous (sometimes malevolent) pleasure or sense of self-satisfaction, often at an adversary's misfortune.<br>&nbsp;&nbsp;&nbsp;2. To triumph, crow, relish, glory, revel.<br>", "etymology": "1565–75; perhaps akin to Old Norse glotta “to smile scornfully”; compare German glotzen “to stare”", "example": "Ysabel Jurado had every reason to gloat when I caught up with her earlier this week at the Highland Park home she shares with her father and teenage daughter.", "synonym": "celebrate"}, {"word": "pun", "definitionA": "the humorous use of a word or phrase so as to emphasize or suggest its different meanings or applications, or the use of words that are alike or nearly alike in sound but different in meaning; a play on words.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A joke or type of wordplay in which similar definitions or sounds of two words or phrases, or different definitions of the same word, are deliberately confused.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beat; strike with force; to ram; to pound, as in a mortar; reduce to powder, to pulverize.<br>&nbsp;&nbsp;&nbsp;2. To make or tell a pun; to make a play on words.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A Korean unit of length equivalent to about 0.3 cm.<br>", "etymology": "First recorded in 1655–65; perhaps special use of pun, variant (now dialectal) of pound 1, in the sense “to mistreat (words)”", "example": "He also mentioned “attacking food prices by going after some of these anti-competitive mergers ... attacking climate change by continuing our investment in renewable energy, and also really diving into the water issue. No pun intended.”", "synonym": "ambiguity"}, {"word": "bevy", "definitionA": "a group of birds, as larks or quail, or animals, as roebuck, in close association.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (collective) A group of animals, in particular quail.<br>&nbsp;&nbsp;&nbsp;2. (collective) A group of women.<br>&nbsp;&nbsp;&nbsp;3. (collective) A large group or collection.<br>", "etymology": "First recorded in 1400–50; late Middle English bevey, of obscure origin", "example": "Since the “mansion tax” took effect last April, a bevy of groups have aired their grievances.", "synonym": "assembly"}, {"word": "consuetude", "definitionA": "custom, especially as having legal force.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Custom, familiarity.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Old French consuetude, a learned borrowing or Latinism from Latin consuētūd(o), “custom, habit, usage, social intercourse, illicit affair,” equivalent to con- con- + suē- (root of suēscere “to accustom, become accustomed,” akin to suus “one's own”) + -tūdō -tude", "example": "It is right that we should look before we leap, but it is gross misconduct to neglect duty to conform to the consuetudes of the hour.", "synonym": "familiarity"}, {"word": "anon", "definitionA": "in a short time; soon.", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Straight away; at once.<br>&nbsp;&nbsp;&nbsp;2. Soon; in a little while.<br>&nbsp;&nbsp;&nbsp;3. At another time; then; again.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An anonymous person, especially an author.<br>&nbsp;&nbsp;&nbsp;2. A work with an unknown author.<br>&nbsp;&nbsp;&nbsp;3. A work without a title.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Anonymous<br>", "etymology": "before 1000; Middle English anon, anoon, Old English on āne in one (course), i.e., straightaway", "example": "In the 4chan thread that led to the fake images of Ms. Swift, several users received compliments — “beautiful gen anon,” one wrote — and were asked to share the prompt language used to create the images.", "synonym": null}, {"word": "plebiscite", "definitionA": "a direct vote of the qualified voters of a state in regard to some important public question.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A referendum, especially one that concerns changes in sovereignty<br>", "etymology": "1525–35; < French < Latin plēbīscītum decree of the plebs, equivalent to plēbī (for plēbis, plēbēī genitive singular of plēbs, plēbēs plebs ) + scītum resolution, decree, noun use of neuter of scītus, past participle of scīscere to enact, decree, originally, to seek to know, learn, inchoative of scīre to know", "example": "It had all the hallmarks of an authoritarian Potemkin plebiscite.", "synonym": "franchise"}, {"word": "alliaceous", "definitionA": "Botany.  belonging to the genus Allium (formerly the family Alliaceae). Compare allium.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Smelling or tasting of garlic or onion.<br>", "etymology": "1785–95; < Latin alli ( um ) garlic + -aceous", "example": "In spring, the bulbs send up long, straplike leaves resembling those of lily of the valley, but with a characteristic alliaceous odor.", "synonym": null}, {"word": "hyponym", "definitionA": "a term that denotes a subcategory of a more general class: Compare superordinate ( def 4 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A more specific term; a subordinate grouping word or phrase.<br>", "etymology": "1960–65; hyp- + -onym, or as back formation from hyponymy", "example": null, "synonym": null}, {"word": "vinaceous", "definitionA": "of, relating to, or resembling wine or grapes.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Containing wine<br>&nbsp;&nbsp;&nbsp;2. Of the colour of red wine<br>", "etymology": "From the Latin word vīnāceus, dating back to 1680–90. See wine, -aceous", "example": "Description.—Above pale brown; wings and tail black; bend of wing white; wing-coverts like the back: beneath pale vinaceous; bill and feet black: whole length 8·0 inches, wing 5·0, tail 3·5.", "synonym": null}, {"word": "valorous", "definitionA": "having valor; courageous; valiant; brave.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having or displaying valour.<br>", "etymology": "First recorded in 1470–80; from Medieval Latin valorōsus “valiant,” from Latin valor “worth, honor” + -ōsus adjective suffix; valor, -ous", "example": "Much of the event on Wednesday was focused on Anderson’s valorous sacrifice, and rightly so.", "synonym": null}, {"word": "asyndeton", "definitionA": "Rhetoric. the omission of conjunctions, as in “He has provided people with jobs, with opportunity, with self-respect.”", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stylistic scheme in which conjunctions are deliberately omitted from a series of words, phrases, clauses.<br>", "etymology": "First recorded in 1580–90; from Late Latin, from Greek, noun use of neuter of asýndetos “unlinked, loose” (equivalent to a- a- 6 + syndé(ein) “to tie together, bind” + -tos verbal adjective suffix)", "example": "The asyndeton in this distich is odd, given the preceding series of connectives.", "synonym": null}, {"word": "ramiform", "definitionA": "having the form of a branch; branchlike.", "definitionB": "No definition found", "etymology": "1815–25; < Latin rām ( us ) branch ( ramus ) + -i- + -form", "example": "In a Rolling Stone review from the time, writer Nick Tosches described the song as “a laid-back, seedy pullulator … about various New York notables and their ramiform homo adventures, punctuated eerily by the phrases ‘walk on the wild side’ and ‘and the colored girls go ‘toot-ta-doo, toot-ta-doo.’", "synonym": null}, {"word": "sleuth", "definitionA": "a detective.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A detective.<br>&nbsp;&nbsp;&nbsp;2. A sleuth-hound; a bloodhound.<br>&nbsp;&nbsp;&nbsp;3. An animal’s trail or track.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act as a detective; to try to discover who committed a crime, or, more generally, to solve a mystery.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Slowness; laziness, sloth.<br>&nbsp;&nbsp;&nbsp;2. A collective term for a group of bears.<br>", "etymology": "First recorded in 1875–80; short for sleuthhound", "example": "But the piecemeal allegations leveled in the criminal and civil cases stopped short of answering an essential question that’s been hinted at by attorneys, investigators and internet sleuths: Who else was involved?", "synonym": "agent"}, {"word": "stratosphere", "definitionA": "the region of the upper atmosphere extending upward from the tropopause to about 30 miles (50 km) above the earth, characterized by little vertical change in temperature.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Collectively, those layers of the Earth’s crust which primarily comprise stratified deposits.<br>&nbsp;&nbsp;&nbsp;2. The region of the uppermost atmosphere where temperature increases along with the altitude due to the absorption of solar ultraviolet radiation by ozone. The stratosphere extends from the tropopause (10–15 kilometers) to approximately 50 kilometers, where it is succeeded by the mesosphere.<br>", "etymology": "First recorded in 1905–10; strat(um) + -o- + sphere", "example": "Suddenly, Jackson’s career was kicked into the stratosphere and Jones was regarded as the high priest of pop music.", "synonym": "blast"}, {"word": "quixotic", "definitionA": "extravagantly chivalrous or romantic; visionary, impractical, or impracticable.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Possessing or acting with the desire to do noble and romantic deeds, without thought of realism and practicality; exceedingly idealistic.<br>&nbsp;&nbsp;&nbsp;2. Impulsive.<br>&nbsp;&nbsp;&nbsp;3. Like Don Quixote; romantic to extravagance; absurdly chivalric; apt to be deluded.<br>", "etymology": "First recorded in 1805–15; (Don) Quixote + -ic", "example": "At 65, Farrell is the elder statesman of the bunch, yet energetic and full of oddball quixotic charm.", "synonym": null}, {"word": "gross", "definitionA": "without deductions; total, as the amount of sales, salary, profit, etc., before taking deductions for expenses, taxes, or the like ( net ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Twelve dozen = 144.<br>&nbsp;&nbsp;&nbsp;2. The total nominal earnings or amount, before taxes, expenses, exceptions or similar are deducted. That which remains after all deductions is called net.<br>&nbsp;&nbsp;&nbsp;3. The bulk, the mass, the masses.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To earn money, not including expenses.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of behaviour considered to be wrong) Highly or conspicuously offensive.<br>&nbsp;&nbsp;&nbsp;2. (of an amount) Excluding any deductions; including all associated amounts.<br>&nbsp;&nbsp;&nbsp;3. Seen without a microscope (usually for a tissue or an organ); at a large scale; not detailed.<br>&nbsp;&nbsp;&nbsp;4. Causing disgust.<br>&nbsp;&nbsp;&nbsp;5. Lacking refinement in behaviour or manner; offending a standard of morality.<br>&nbsp;&nbsp;&nbsp;6. (of a product) Lacking refinement; not of high quality.<br>&nbsp;&nbsp;&nbsp;7. (of a person) Heavy in proportion to one's height; having a lot of excess flesh.<br>&nbsp;&nbsp;&nbsp;8. Not sensitive in perception or feeling.<br>&nbsp;&nbsp;&nbsp;9. Difficult or impossible to see through.<br>&nbsp;&nbsp;&nbsp;10. Easy to perceive.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Old French gros “large” (as noun, grosse “twelve dozen”), from Late Latin gross(us) “thick, coarse”", "example": "This summer’s “Twisters,” released by Universal Pictures, grossed nearly $371 million worldwide and is the sixth highest grossing film domestically so far this year, according to film performance tracker Box Office Mojo.", "synonym": "complete"}, {"word": "baffle", "definitionA": "to confuse, bewilder, or perplex:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device used to dampen the effects of such things as sound, light, or fluid. Specifically, a baffle is a surface which is placed inside an open area to inhibit direct motion from one part to another, without preventing motion altogether.<br>&nbsp;&nbsp;&nbsp;2. An architectural feature designed to confuse enemies or make them vulnerable.<br>&nbsp;&nbsp;&nbsp;3. (coal mining) A lever for operating the throttle valve of a winding engine.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To publicly disgrace, especially of a recreant knight.<br>&nbsp;&nbsp;&nbsp;2. To hoodwink or deceive (someone).<br>&nbsp;&nbsp;&nbsp;3. To bewilder completely; to confuse or perplex.<br>&nbsp;&nbsp;&nbsp;4. To foil; to thwart.<br>&nbsp;&nbsp;&nbsp;5. To struggle in vain.<br>", "etymology": "First recorded in 1540–50; 1910–15  baffle fordef 8; perhaps from Scots bauchle “to disgrace, treat with contempt,” equivalent to bauch ( baff ) + -le", "example": "Mike Tyson spoke just a few words, Jake Paul made crude references and Briton Tony Bellew was escorted out of the arena by security at a baffling news conference in Texas.", "synonym": "addle"}, {"word": "despondency", "definitionA": "state of being despondent; depression of spirits from loss of courage or hope; dejection.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The loss of hope or confidence; despair or dejection.<br>&nbsp;&nbsp;&nbsp;2. A feeling of depression or disheartenment.<br>", "etymology": "First recorded in 1645–55; despond + -ency", "example": "In the east that all combines with a despondency and frustration that’s been brewing for years, even decades – about the results of German reunification.", "synonym": "depression"}]