[{"word": "intransigent", "definitionA": "refusing to agree or compromise; uncompromising; inflexible.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who is intransigent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to compromise or moderate a position; unreasonable<br>", "etymology": "1875–80; < Spanish intransigente, equivalent to in- in- 3 + transigente (present participle of transigir to compromise) < Latin trānsigent- (stem of trānsigēns, present participle of trānsigere to come to an agreement); transact", "example": "The tide was turning but the intransigent faction needed a few more kicks.", "synonym": null}, {"word": "hilt", "definitionA": "the handle of a sword or dagger.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The handle of a sword, consisting of grip, guard, and pommel, designed to facilitate use of the blade and afford protection to the hand.<br>&nbsp;&nbsp;&nbsp;2. The base of the penis.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To provide with a hilt.<br>&nbsp;&nbsp;&nbsp;2. To insert (a bodily extremity) as far as it can go into a sexual orifice so that it is impeded by the wider base to which it is attached (finger until palm, penis until pelvis).<br>", "etymology": "First recorded before 900; Middle English, Old English hilt(e); cognate with Middle Dutch hilt(e), Old Norse hjalt, Old High German helza “handle of a sword”", "example": "The film merely reaffirms that he’s an ambitious entrepreneur who saw a financial opportunity and exploited it to the hilt, and then doubled-down when calls for his head rang out.", "synonym": "base"}, {"word": "foible", "definitionA": "a minor weakness or failing of character; slight flaw or defect:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quirk, idiosyncrasy, or mannerism; unusual habit or way (usage is typically plural), that is slightly strange or silly.<br>&nbsp;&nbsp;&nbsp;2. A weakness or failing of character.<br>&nbsp;&nbsp;&nbsp;3. Part of a sword between the middle and the point, weaker than the forte.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Weak; feeble.<br>", "etymology": "First recorded in 1640–50; from French, obsolete form of faible feeble", "example": "Human foibles have never been more readily apparent, or more easily exposed.", "synonym": "characteristic"}, {"word": "reverence", "definitionA": "a feeling or attitude of deep respect tinged with awe; veneration.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Veneration; profound awe and respect, normally in a sacred context.<br>&nbsp;&nbsp;&nbsp;2. An act of showing respect, such as a bow.<br>&nbsp;&nbsp;&nbsp;3. The state of being revered.<br>&nbsp;&nbsp;&nbsp;4. A form of address for some members of the clergy.<br>&nbsp;&nbsp;&nbsp;5. That which deserves or exacts manifestations of reverence; reverend character; dignity; state.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To show or feel reverence to.<br>", "etymology": "First recorded in 1250–1300; Middle English, from Latin reverentia “respect, fear, awe”; equivalent to revere 1 + -ence", "example": "That stance had nothing to do with my reverence for the theatrical experience — a darkened auditorium surrounded by strangers will always be the best way to watch a film created toward that end.", "synonym": "apotheosis"}, {"word": "quibble", "definitionA": "an instance of the use of ambiguous, prevaricating, or irrelevant language or arguments to evade a point at issue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pun.<br>&nbsp;&nbsp;&nbsp;2. An objection or argument based on an ambiguity of wording or similar trivial circumstance; a minor complaint.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To complain or argue in a trivial or petty manner.<br>", "etymology": "1605–15; perhaps derivative ( -le ) of quib gibe, apparently akin to quip", "example": "Even with minor quibbles like the lack of an SD card slot and having to buy one or two necessary accessories, the Galaxy S21 Ultra is the most well-rounded flagship Android phone, making it the best choice for most people.", "synonym": "artifice"}, {"word": "dearth", "definitionA": "an inadequate supply; scarcity; lack:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A period or condition when food is rare and hence expensive; famine.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Scarcity; a lack or short supply.<br>&nbsp;&nbsp;&nbsp;3. Dearness; the quality of being rare or costly.<br>", "etymology": "First recorded in 1200–50, dearth is from the Middle English word derthe. See dear 1, -th 1", "example": "While the national team has a wealth of attacking players, many of whom are performing at high levels in Europe, there is a dearth of strikers.", "synonym": "default"}, {"word": "nonplus", "definitionA": "to render utterly perplexed by something unexpected; puzzle completely:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A state of perplexity or bewilderment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To perplex or bewilder someone; to confound or flummox<br>", "etymology": "First recorded in 1575–85; (noun) from Latin nōn plūs literally, “not more, no further,” that is, a state in which nothing more can be done", "example": "\"I know of many,\" he answered, with a smile, an answer which by its simplicity seemed to nonplus the Duke.", "synonym": "balk"}, {"word": "amiable", "definitionA": "having or showing pleasant, good-natured personal qualities; affable:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Friendly; kind; sweet; gracious<br>&nbsp;&nbsp;&nbsp;2. Of a pleasant and likeable nature; kind-hearted; easy to like<br>", "etymology": "First recorded in 1300–50; Middle English, from Middle French, from Late Latin amīcābilis amicable", "example": "In these scenes the film is fully in joke mode, poking amiable fun at the cheesy Quebecois-ness of the Dion family, here rechristened Dieu.", "synonym": null}, {"word": "frabjous", "definitionA": "wonderful, elegant, superb, or delicious.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fabulous, joyous; great, wonderful.<br>", "etymology": "1872; coined by Lewis Carroll in Through the Looking-Glass; perhaps meant to suggest fabulous or joyous", "example": "Then we sat down and prepared to enjoy ourselves something frabjous.", "synonym": null}, {"word": "timbre", "definitionA": "Acoustics, Phonetics. the characteristic quality of a sound, independent of pitch and loudness, from which its source or manner of production can be inferred. Timbre depends on the relative strengths of the components of different frequencies, which are determined by resonance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality of a sound independent of its pitch and volume.<br>&nbsp;&nbsp;&nbsp;2. The pitch of a sound as heard by the ear, described relative to its absolute pitch.<br>&nbsp;&nbsp;&nbsp;3. The crest on a coat of arms.<br>", "etymology": "First recorded in 1325–75; Middle English tymbre, from Middle French “clapperless bell, bell rung by a hammer,” from Old French “small drum, drum,” from Latin tympanum “timbrel, drum,” from Greek týmpanon “timbrel, kettledrum, drum”", "example": "Squint hard and some of her melodies and timbres start to resemble those of Vashti Bunyan, or Elliott Smith, or Hope Sandoval, but each of those impressions tend to vanish faster than they form.", "synonym": "beat"}]