[{"word": "apathetic", "definitionA": "having or showing little or no emotion:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Void of feeling; not susceptible of deep emotion<br>&nbsp;&nbsp;&nbsp;2. Of, or pertaining to apatheism.<br>", "etymology": "First recorded in 1735–45; apath(y) + (path)etic", "example": "Both were victims because they were too apathetic to find a better place to leave their equipment.", "synonym": null}, {"word": "pock", "definitionA": "a pustule on the body in an eruptive disease, as smallpox.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pus-filled swelling on the surface on the skin caused by an eruptive disease.<br>&nbsp;&nbsp;&nbsp;2. Any pit, especially one formed as a scar<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To scar or mark with pits<br>", "etymology": "before 1000; Middle English pokke, Old English poc; cognate with German Pocke; perhaps akin to Old English pocca. See poke 2", "example": "The pock-marked ridges in the distance are covered with the advancing waves of field-grey forms.", "synonym": "blemish"}, {"word": "invigorate", "definitionA": "to give vigor to; fill with life and energy; energize.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To impart vigor, strength, or vitality to.<br>&nbsp;&nbsp;&nbsp;2. To heighten or intensify.<br>&nbsp;&nbsp;&nbsp;3. To give life or energy to.<br>&nbsp;&nbsp;&nbsp;4. To make lively.<br>", "etymology": "First recorded in 1640–50; in- 2 + obsolete vigorate “invigorated”; vigor, -ate 1", "example": "It has been invigorating and fun to be active again, and increased my confidence.", "synonym": "activate"}, {"word": "disapprobation", "definitionA": "disapproval; condemnation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act or expression of condemnation or disapproval, especially on moral grounds.<br>", "etymology": "First recorded in 1640–50; dis- 1 + approbation", "example": "He did this to signalise his disapprobation of royalty, and his preference for democratic equality.", "synonym": "blame"}, {"word": "logophile", "definitionA": "a lover of words.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who loves words; a word buff.<br>", "etymology": "logo- + -phile", "example": null, "synonym": null}, {"word": "bivouac", "definitionA": "a military encampment made with tents or improvised shelters, usually without shelter or protection from enemy fire.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An encampment for the night, usually without tents or covering.<br>&nbsp;&nbsp;&nbsp;2. Any temporary encampment.<br>&nbsp;&nbsp;&nbsp;3. A temporary shelter constructed generally for a few nights.<br>&nbsp;&nbsp;&nbsp;4. The watch of a whole army by night, when in danger of surprise or attack.<br>&nbsp;&nbsp;&nbsp;5. A structure formed by migratory ants out of their own bodies to protect the queen and larvae.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To set up camp.<br>&nbsp;&nbsp;&nbsp;2. To watch at night or be on guard, as a whole army.<br>&nbsp;&nbsp;&nbsp;3. To encamp for the night without tents or covering.<br>", "etymology": "1700–10; < French < Swiss German bīwacht auxiliary patrol, equivalent to bī- by- + wacht patrol, watch", "example": "Our airy bivouac, our fourth on the mountain, didn’t have an additional centimeter of space on any side.", "synonym": "billet"}, {"word": "invigilate", "definitionA": "to keep watch.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To oversee a test or exam.<br>", "etymology": "1545–55; < Latin invigilātus (past participle of invigilāre to keep watch, stay up late), equivalent to in- in- 2 + vigilā- (stem of vigilāre to watch; vigil ) + -tus past participle suffix", "example": "A judicial inquiry, however, has power to gather evidence, to summon the trio, and invigilate them properly and professionally.", "synonym": null}, {"word": "reveille", "definitionA": "a signal, as of a drum or bugle, sounded early in the morning to awaken military personnel and to alert them for assembly.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sounding of a bugle or drum early in the morning to awaken soldiers.<br>", "etymology": "1635–45; < French réveillez, plural imperative of réveiller to awaken, equivalent to r ( e ) - re- + éveiller, Old French esveillier ≪ Latin ēvigilāre to watch, be vigilant ( ē- e- 1 + vigilāre to watch; vigil )", "example": "The school is currently on Reveille VIII, and all iterations have been female.", "synonym": null}, {"word": "waft", "definitionA": "to carry lightly and smoothly through the air or over water:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A light breeze.<br>&nbsp;&nbsp;&nbsp;2. Something (such as an odor or scent like a perfume) that is carried through the air.<br>&nbsp;&nbsp;&nbsp;3. A flag used to indicate wind direction or, with a knot tied in the center, as a signal; a waif, a wheft.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To (cause to) float easily or gently through the air.<br>&nbsp;&nbsp;&nbsp;2. To be moved, or to pass, on a buoyant medium; to float.<br>&nbsp;&nbsp;&nbsp;3. To give notice to by waving something; to wave the hand to; to beckon.<br>", "etymology": "1535–45; back formation from late Middle English waughter armed escort vessel < Dutch or Low German wachter watchman; in some senses confused with waff", "example": "In dark pockets of the universe, molecular clouds full of tiny dust particles host a veritable smorgasbord of odors, from wafts of sweet sugar to the rotten-egg stench of sulfur.", "synonym": "bear"}, {"word": "waffle", "definitionA": "a batter cake with a pattern of deep indentations on each side, formed by the gridlike design on each of the two hinged parts of the metal appliance waffle iron in which the cake is baked.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A flat pastry pressed with a grid pattern.<br>&nbsp;&nbsp;&nbsp;2. A potato waffle, a savoury flat potato cake with the same kind of grid pattern.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To smash.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Speech or writing that is vague, pretentious or evasive.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of birds) To move in a side-to-side motion and descend (lose altitude) before landing. Cf wiffle, whiffle.<br>&nbsp;&nbsp;&nbsp;2. To speak or write vaguely and evasively.<br>&nbsp;&nbsp;&nbsp;3. To speak or write at length without any clear point or aim.<br>&nbsp;&nbsp;&nbsp;4. To vacillate.<br>&nbsp;&nbsp;&nbsp;5. To rotate (one's hand) back and forth in a gesture of vacillation or ambivalence.<br>", "etymology": "First recorded in 1735–45; from Dutch wafel; wafer ( def )", "example": "It’s designed to look as no-nonsense as it performs, and it makes hefty 4-slice Belgian waffles with adjustable browning controls to ensure you get the precise mix of crispy and spongy.", "synonym": "change"}, {"word": "herring", "definitionA": "an important food fish, Clupea harengus harengus, found in enormous shoals in the North Atlantic.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A type of small, oily fish of the genus Clupea, often used as food.<br>&nbsp;&nbsp;&nbsp;2. Fish in the family Clupeidae.<br>&nbsp;&nbsp;&nbsp;3. Fish similar to those in genus Clupea, many of those in the order Clupeiformes.<br>", "etymology": "before 900; Middle English hering, Old English hǣring; cognate with German Häring", "example": "With the red herring out of the way, XENONnT researchers are now combing through their data for nuclear recoils, in hopes of detecting the real deal.", "synonym": null}, {"word": "felonious", "definitionA": "Law. pertaining to, of the nature of, or involving a felony:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, relating to, being, or having the quality of felony<br>&nbsp;&nbsp;&nbsp;2. Done with intent to commit a crime.<br>", "etymology": "1375–1425; felony + -ous; replacing late Middle English felonous < Anglo-French, Old French", "example": "Miettinen has an arrest record that includes 13 prior offenses, including felonious assault with a deadly weapon, aggravated assault, reckless driving, and disobeying a police officer.", "synonym": null}, {"word": "ferhoodle", "definitionA": "to confuse or mix up:", "definitionB": "No definition found", "etymology": "From Pennsylvania Dutch verhuddle “to tangle, confuse”; compare German verhudeln “to bungle, botch”", "example": null, "synonym": null}, {"word": "rarefy", "definitionA": "to make rare or rarer; make less dense:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make rare, thin, porous, or less dense<br>&nbsp;&nbsp;&nbsp;2. To expand or enlarge without adding any new portion of matter to.<br>", "etymology": "First recorded in 1350–1400; Middle English rarefien, from Middle French rarefier, from Medieval Latin rārificāre, from Latin rārēfacere, equivalent to rārē-, irregular, unexplained combining form of rārus + facere “to make”; rare 1, -fy", "example": "Would an atmosphere perfumed by these Eastern woods clarify and rarefy our denser Occidental minds?", "synonym": "cook"}, {"word": "countermand", "definitionA": null, "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An order to the contrary of a previous one.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To revoke (a former command); to cancel or rescind by giving an order contrary to one previously given.<br>&nbsp;&nbsp;&nbsp;2. To recall a person or unit with such an order.<br>&nbsp;&nbsp;&nbsp;3. To prohibit.<br>&nbsp;&nbsp;&nbsp;4. To oppose; to revoke the command of.<br>", "etymology": null, "example": null, "synonym": "override"}, {"word": "palimpsest", "definitionA": "a parchment or the like from which writing has been partially or completely erased to make room for another text.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A manuscript or document that has been erased or scraped clean, for reuse of the paper, parchment, vellum, or other medium on which it was written.<br>&nbsp;&nbsp;&nbsp;2. Monumental brasses that have been reused by engraving of the blank back side.<br>&nbsp;&nbsp;&nbsp;3. Circular features believed to be lunar craters that have been obliterated by later volcanic activity.<br>&nbsp;&nbsp;&nbsp;4. Geological features thought to be related to features or effects below the surface.<br>&nbsp;&nbsp;&nbsp;5. Memory that has been erased and re-written.<br>&nbsp;&nbsp;&nbsp;6. (cultural studies) The partial erasure of or superimposition on an older society or culture by a newer one.<br>&nbsp;&nbsp;&nbsp;7. Something bearing the traces of an earlier, erased form.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To scrape clean, as in parchment, for reuse.<br>&nbsp;&nbsp;&nbsp;2. On paper: to reuse, often by erasure or change of pen direction or color. Especially fueled by Earth Day.<br>", "etymology": "First recorded in 1655–65; from Latin palimpsēstus, from Greek palímpsēstos “rubbed again” ( pálin “again” + psēstós “scraped, rubbed,” past participle of psân “to rub smooth”)", "example": "Can you talk about how the palimpsest informs the structure of your novel?", "synonym": "composition"}, {"word": "apposite", "definitionA": "suitable; well-adapted; pertinent; relevant; apt:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. That which is apposite; something suitable.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Strikingly appropriate or relevant; well suited to the circumstance or in relation to something.<br>&nbsp;&nbsp;&nbsp;2. Positioned at rest in respect to another, be it side-to-side, front-to-front, back-to-back, or even three-dimensionally: in apposition.<br>&nbsp;&nbsp;&nbsp;3. Related, homologous.<br>", "etymology": "1615–25; < Latin appositus added to, put near (past participle of appōnere ), equivalent to ap- ap- 1 + positus placed ( posi- place + -tus past participle suffix)", "example": "These remarks, as will appear in the sequel, are apposite to the parties which I am about to introduce to the reader.", "synonym": null}, {"word": "disparage", "definitionA": "to speak of or treat slightingly; depreciate; belittle:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Inequality in marriage; marriage with an inferior.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To match unequally; to degrade or dishonor.<br>&nbsp;&nbsp;&nbsp;2. To dishonor by a comparison with what is inferior; to lower in rank or estimation by actions or words; to speak slightingly of; to depreciate; to undervalue.<br>&nbsp;&nbsp;&nbsp;3. To ridicule, mock, discredit.<br>", "etymology": "First recorded in 1250–1300; Middle English, from Anglo-French, Old French desparag(i)er “to match unequally,” from des- dis- 1 + -parag(i)er, verb derivative of parage “equal rank,” also “high birth, noble descent” ( peerage )", "example": "The company has also held ongoing mandatory meetings for workers on company time, so-called captive-audience sessions, to show videos and run through PowerPoint presentations that disparage unionization.", "synonym": "abuse"}, {"word": "lacuna", "definitionA": "a gap or missing part, as in a manuscript, series, or logical argument; hiatus.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small opening; a small pit or depression.<br>&nbsp;&nbsp;&nbsp;2. A small blank space; a gap or vacancy; a hiatus.<br>&nbsp;&nbsp;&nbsp;3. An absent part, especially in a book or other piece of writing, often referring to an ancient manuscript or similar.<br>&nbsp;&nbsp;&nbsp;4. Any gap, break, hole, or lack in a set of things; something missing.<br>&nbsp;&nbsp;&nbsp;5. A space visible between cells, allowing free passage of light.<br>&nbsp;&nbsp;&nbsp;6. A language gap, which occurs when there is no direct translation in the target language for a lexical term found in the source language.<br>", "etymology": "First recorded in 1655–65; from Latin lacūna “ditch, pit, hole, gap, deficiency,” akin to lacus “basin, tub, vat, lake”; lake 1. lagoon", "example": "It doesn’t seriously examine the role of scholarship at the Met, and that is a telling lacuna.", "synonym": "break"}, {"word": "disburse", "definitionA": "to pay out (money), especially for expenses; expend.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pay out, expend; usually from a public fund or treasury.<br>", "etymology": "First recorded in 1520–30; from Middle French desbourser, Old French desborser, equivalent to des- dis- 1 + -borser, derivative of borse purse, from Late Latin bursa “bag”", "example": "It has already raised and disbursed several hundreds of thousands of dollars in grants to groups it has vetted.", "synonym": "acquit"}]