[{"word": "reminisce", "definitionA": "to recall past experiences, events, etc.; indulge in reminiscence.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of reminiscence.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To recall the past in a private moment, often fondly or nostalgically.<br>&nbsp;&nbsp;&nbsp;2. To talk or write about memories of the past, especially pleasant memories.<br>&nbsp;&nbsp;&nbsp;3. To remember fondly; to reminisce about.<br>", "etymology": "First recorded in 1820–30; back formation from reminiscence", "example": null, "synonym": "bethink"}, {"word": "mercurial", "definitionA": "changeable; volatile; fickle; flighty; erratic:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of the plants known as mercury, especially the annual mercury or French mercury (Mercurialis annua).<br>&nbsp;&nbsp;&nbsp;2. A person born under the influence of the planet Mercury; hence, a person having an animated, lively, quick-witted or volatile character.<br>&nbsp;&nbsp;&nbsp;3. A chemical compound containing mercury.<br>&nbsp;&nbsp;&nbsp;4. A preparation of mercury, especially as a treatment for syphilis.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a lively or volatile character; animated, changeable, quick-witted.<br>&nbsp;&nbsp;&nbsp;2. Pertaining to the astrological influence of the planet Mercury; having the characteristics of a person under such influence (see adjective sense 1).<br>&nbsp;&nbsp;&nbsp;3. Pertaining to the planet Mercury.<br>&nbsp;&nbsp;&nbsp;4. Of or pertaining to the element mercury or quicksilver; containing mercury.<br>&nbsp;&nbsp;&nbsp;5. Caused by the action of mercury or a mercury compound.<br>&nbsp;&nbsp;&nbsp;6. Pertaining to Mercury, the Roman god of, among other things, commerce, financial gain, communication, and thieves and trickery; hence , money-making; crafty.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin mercuriālis “of or pertaining to the god or planet Mercury”; mercury, -al 1", "example": null, "synonym": null}, {"word": "saturnine", "definitionA": "sluggish in temperament; gloomy; taciturn.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a person: having a tendency to be cold, bitter, gloomy, sarcastic, and slow to change and react.<br>&nbsp;&nbsp;&nbsp;2. Of a setting: depressing, dull, gloomy.<br>&nbsp;&nbsp;&nbsp;3. Of, pertaining to, or containing lead (which was symbolically associated with the planet Saturn by alchemists).<br>&nbsp;&nbsp;&nbsp;4. Of a disease: caused by lead poisoning (saturnism); of a person: affected by lead poisoning.<br>&nbsp;&nbsp;&nbsp;5. Pertaining to the astrological influence of the planet Saturn; having the characteristics of a person under such influence (see sense 1).<br>", "etymology": "1400–50; late Middle English < Medieval Latin sāturnīnus ( Saturn, -ine 1 )", "example": null, "synonym": null}, {"word": "shibboleth", "definitionA": "a peculiarity of pronunciation, behavior, mode of dress, etc., that distinguishes a particular class or set of persons.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A word, especially seen as a test, to distinguish someone as belonging to a particular nation, class, profession etc.<br>&nbsp;&nbsp;&nbsp;2. A common or longstanding belief, custom, or catchphrase associated with a particular group, especially one with little current meaning or truth.<br>", "etymology": "From Hebrew shibbōleth literally, “freshet,” a word used by the Gileadites as a test to detect the fleeing Ephraimites, who could not pronounce the sound sh (Judges 12:4–6)", "example": null, "synonym": "catchword"}, {"word": "inimitable", "definitionA": "incapable of being imitated or copied; surpassing imitation; matchless.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Beyond imitation, surpassing all others, matchless.<br>", "etymology": "From the Latin word inimitābilis, dating back to 1525–35. See in- 3, imitable", "example": null, "synonym": null}, {"word": "parapet", "definitionA": "Fortification.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low protective wall.<br>&nbsp;&nbsp;&nbsp;2. Part of a perimeter that extends above the roof.<br>&nbsp;&nbsp;&nbsp;3. A fortification consisting of a wall.<br>", "etymology": "1575–85; < Italian parapetto, equivalent to para- para- 2 + petto chest, breast < Latin pectus", "example": null, "synonym": "barricade"}, {"word": "mollify", "definitionA": "to soften in feeling or temper, as a person; pacify; appease.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ease a burden, particularly worry; make less painful; to comfort.<br>&nbsp;&nbsp;&nbsp;2. To appease (anger), pacify, gain the good will of.<br>&nbsp;&nbsp;&nbsp;3. To soften; to make tender<br>", "etymology": "First recorded in 1350–1400; Middle English, from Middle French mollifier, from Late Latin mollificāre, equivalent to Latin molli(s) “soft” + -ficāre -fy", "example": "Bezos rejected claims that he declined an endorsement to Harris in hopes of mollifying Trump, although he acknowledged that his web of business interests would always present appearances of potential conflicts of interest.", "synonym": "abate"}, {"word": "affront", "definitionA": "a personally offensive act or word; deliberate act or display of disrespect; intentional slight; insult:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An open or intentional offense, slight, or insult.<br>&nbsp;&nbsp;&nbsp;2. A hostile encounter or meeting.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To insult intentionally, especially openly.<br>&nbsp;&nbsp;&nbsp;2. To meet defiantly; to confront.<br>&nbsp;&nbsp;&nbsp;3. To meet or encounter face to face.<br>", "etymology": "First recorded in 1300–50; Middle English afrounten, from Middle French af(f)ronter “to strike in the face,” from unattested Vulgar Latin affrontāre, derivative of Latin phrase ad frontem “at or toward the forehead” (as the seat of one's feelings or dignity). See ad-, front", "example": null, "synonym": "abuse"}, {"word": "gourmand", "definitionA": "a person who is fond of good eating, often indiscriminatingly and to excess.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person given to excess in the consumption of food and drink; a greedy or ravenous eater.<br>&nbsp;&nbsp;&nbsp;2. A person who appreciates good food.<br>", "etymology": "1400–50; late Middle English gourmaunt < Old French gormant a glutton", "example": null, "synonym": "connoisseur"}, {"word": "inexorable", "definitionA": "unyielding; unalterable:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Impossible to prevent or stop; inevitable.<br>&nbsp;&nbsp;&nbsp;2. Unable to be persuaded; relentless; unrelenting.<br>&nbsp;&nbsp;&nbsp;3. Adamant; severe.<br>", "etymology": "From the Latin word inexōrābilis, dating back to 1545–55. See in- 3, exorable", "example": "Manville has the rare opportunity as an actor to make something spectacular out of sheer, inexorable somberness.", "synonym": null}, {"word": "forlorn", "definitionA": "desolate or dreary; unhappy or miserable, as in feeling, condition, or appearance.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To abandon, forsake.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A forlorn hope.<br>&nbsp;&nbsp;&nbsp;2. A member of a forlorn hope.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abandoned, deserted, left behind.<br>&nbsp;&nbsp;&nbsp;2. Miserable, as when lonely after being abandoned.<br>&nbsp;&nbsp;&nbsp;3. Unlikely to succeed; hopeless.<br>", "etymology": "First recorded before 1150; Middle English foreloren “lost completely,” past participle of forlesen “to lose completely,” Old English forlēosan; cognate with Old High German firliosan ( German verlieren ), Gothic fraliusan; equivalent to for- + lorn", "example": null, "synonym": null}, {"word": "flagging", "definitionA": "becoming smaller or weaker; dwindling.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To furnish or deck out with flags.<br>&nbsp;&nbsp;&nbsp;2. To mark with a flag, especially to indicate the importance of something.<br>&nbsp;&nbsp;&nbsp;3. (often with down) To signal to, especially to stop a passing vehicle etc.<br>&nbsp;&nbsp;&nbsp;4. To convey (a message) by means of flag signals.<br>&nbsp;&nbsp;&nbsp;5. (often with up) To note, mark or point out for attention.<br>&nbsp;&nbsp;&nbsp;6. To signal (an event).<br>&nbsp;&nbsp;&nbsp;7. To set a program variable to true.<br>&nbsp;&nbsp;&nbsp;8. To decoy (game) by waving a flag, handkerchief, etc. to arouse the animal's curiosity.<br>&nbsp;&nbsp;&nbsp;9. To penalize for an infraction.<br>&nbsp;&nbsp;&nbsp;10. To defeat (an opponent) on time, especially in a blitz game.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To weaken, become feeble.<br>&nbsp;&nbsp;&nbsp;2. To hang loose without stiffness; to bend down, as flexible bodies; to be loose, yielding, limp.<br>&nbsp;&nbsp;&nbsp;3. To let droop; to suffer to fall, or let fall, into feebleness.<br>&nbsp;&nbsp;&nbsp;4. To enervate; to exhaust the vigour or elasticity of.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pave with flagstones.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pavement or sidewalk of flagstones; flagstones, collectively.<br>&nbsp;&nbsp;&nbsp;2. The process by which something flags or tires.<br>", "etymology": "First recorded in 1535–45; flag 3 + -ing 2", "example": null, "synonym": "drooping"}, {"word": "bedraggled", "definitionA": "limp and soiled, as with rain or dirt.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make (something) wet and limp, especially by dragging it along the ground.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Wet and limp; unkempt.<br>&nbsp;&nbsp;&nbsp;2. Decaying, decrepit or dilapidated.<br>", "etymology": "bedraggle + -ed 2", "example": null, "synonym": "dilapidated"}, {"word": "cahoot", "definitionA": "go cahoots,  to share equally; become partners: Also go in cahoot with, go in cahoots.", "definitionB": "No definition found", "etymology": "1820–30, Americanism; perhaps < French cahute cabin, hut, equivalent to ca ( bane ) cabin + hutte hut", "example": "Is he going home at night feeling guilty and wondering, “Am I in cahoots with criminals? I guess I am.”", "synonym": "alliance"}, {"word": "chaplain", "definitionA": "an ecclesiastic attached to the chapel of a royal court, college, etc., or to a military unit.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A member of a religious body (often, but not always, of the clergy) officially assigned to give pastoral care at an institution, group, private chapel, etc.<br>&nbsp;&nbsp;&nbsp;2. A person without religious affiliation who carries out similar duties in a secular context.<br>", "etymology": "before 1100; Middle English chapelain < Middle French < Late Latin cappellānus custodian of St. Martin's cloak ( chapel, -an ); replacing Old English capellan < Late Latin, as above", "example": null, "synonym": null}, {"word": "ecumenical", "definitionA": "general; universal.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to the universal Church, representing the entire Christian world; interdenominational; sometimes by extension, interreligious.<br>&nbsp;&nbsp;&nbsp;2. General, universal, worldwide.<br>", "etymology": "1835–45; < Late Latin oecumenicus belonging to the whole inhabited world (< Greek oikoumenikós, equivalent to oikoumen- (stem of passive present participle of oikeîn to inhabit) + -ikos -ic ) + -al 1", "example": "In 1431, the ecumenical Council of Basel ordered the deans and rectors of churches to expel \"frivolities\" and \"profane abuses\" from holy buildings, but implicitly allowed them to take place in the squares outside.", "synonym": null}, {"word": "delitescent", "definitionA": "concealed; hidden; latent.", "definitionB": "No definition found", "etymology": "1675–85; < Latin dēlitēscent- (stem of dēlitēscēns ), present participle of dēlitēscere to hide away < dē- de- + latēscēre, inceptive of latēre to hide; latent ( def )", "example": "Mrs. Balfame had never given expression to this desire for a delitescent bedroom, being a woman who thought silently, spoke guardedly, and, both patient and philosophical, rarely permitted what she called her imagination to wander, or bitterness to enter her soul.", "synonym": null}, {"word": "discombobulate", "definitionA": "Informal. to confuse or disconcert; confound; bewilder:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To throw into a state of confusion; to befuddle or perplex.<br>", "etymology": "An Americanism first recorded in 1825–35; fanciful alteration of discompose or discomfort", "example": null, "synonym": "addle"}, {"word": "tabular", "definitionA": "of, relating to, or arranged in a table or systematic arrangement by columns, rows, etc., as statistics.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a flat, plane surface<br>&nbsp;&nbsp;&nbsp;2. Organized as a table or list<br>&nbsp;&nbsp;&nbsp;3. Calculated by means of a table<br>&nbsp;&nbsp;&nbsp;4. Tending to split into thin flat pieces, such as slate<br>", "etymology": "First recorded in 1650–60, tabular is from the Latin word tabulāris pertaining to a board or tablet. See table, -ar 1", "example": null, "synonym": "even"}, {"word": "snag", "definitionA": "a tree or part of a tree held fast in the bottom of a river, lake, etc., and forming an impediment or danger to navigation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stump or base of a branch that has been lopped off; a short branch, or a sharp or rough branch.<br>&nbsp;&nbsp;&nbsp;2. A dead tree that remains standing.<br>&nbsp;&nbsp;&nbsp;3. A tree, or a branch of a tree, fixed in the bottom of a river or other navigable water, and rising nearly or quite to the surface, by which boats are sometimes pierced and sunk.<br>&nbsp;&nbsp;&nbsp;4. (by extension) Any sharp protuberant part of an object, which may catch, scratch, or tear other objects brought into contact with it.<br>&nbsp;&nbsp;&nbsp;5. A tooth projecting beyond the others; a broken or decayed tooth.<br>&nbsp;&nbsp;&nbsp;6. A problem or difficulty with something.<br>&nbsp;&nbsp;&nbsp;7. A pulled thread or yarn, as in cloth.<br>&nbsp;&nbsp;&nbsp;8. One of the secondary branches of an antler.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To catch or tear (e.g. fabric) upon a rough surface or projection.<br>&nbsp;&nbsp;&nbsp;2. To damage or sink (a vessel) by collision; said of a tree or branch fixed to the bottom of a navigable body of water and partially submerged or rising to just beneath the surface.<br>&nbsp;&nbsp;&nbsp;3. To fish by means of dragging a large hook or hooks on a line, intending to impale the body (rather than the mouth) of the target.<br>&nbsp;&nbsp;&nbsp;4. To obtain or pick up (something).<br>&nbsp;&nbsp;&nbsp;5. To stealthily steal with legerdemain prowess (something).<br>&nbsp;&nbsp;&nbsp;6. To cut the snags or branches from, as the stem of a tree; to hew roughly.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A light meal.<br>&nbsp;&nbsp;&nbsp;2. A sausage.<br>&nbsp;&nbsp;&nbsp;3. A goal.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A misnaged, an opponent to Chassidic Judaism (more likely modern, for cultural reasons).<br>", "etymology": "First recorded in 1570–80, snag is from the Old Norse word snagi point, projection", "example": null, "synonym": "bar"}, {"word": "expend", "definitionA": "to use up:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To consume, exhaust (some resource)<br>&nbsp;&nbsp;&nbsp;2. (of money) to spend, disburse<br>", "etymology": "1400–50; late Middle English, from Latin expendere “to weigh out, lay out, pay”", "example": null, "synonym": "blow"}, {"word": "compilation", "definitionA": "the act of compiling:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act or process of compiling or gathering together from various sources.<br>&nbsp;&nbsp;&nbsp;2. That which is compiled; especially, a book or document composed of materials gathering from other books or documents.<br>&nbsp;&nbsp;&nbsp;3. Translation of source code into object code by a compiler.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Latin compīlatiōn-, stem of compīlātiō; equivalent to compile + -ation", "example": null, "synonym": "accumulation"}, {"word": "presbyter", "definitionA": "(in the early Christian church) an office bearer who exercised teaching, priestly, and administrative functions.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A priest or minister in various churches.<br>&nbsp;&nbsp;&nbsp;2. An elder of the Presbyterian church.<br>&nbsp;&nbsp;&nbsp;3. An elder of the congregation in early Christianity.<br>", "etymology": "1590–1600; < Late Latin, noun use of the adj.: older < Greek presbýteros, equivalent to présby ( s ) old + -teros comparative suffix", "example": null, "synonym": null}, {"word": "decennium", "definitionA": "a period of ten years; a decade.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A period of ten years.<br>", "etymology": "From Latin, dating back to 1675–85; decennial", "example": null, "synonym": "decade"}]