[{"word": "stag", "definitionA": "an adult male deer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An adult male deer.<br>&nbsp;&nbsp;&nbsp;2. A colt, or filly.<br>&nbsp;&nbsp;&nbsp;3. (by extension) A romping girl; a tomboy.<br>&nbsp;&nbsp;&nbsp;4. An improperly or late castrated bull or ram – also called a bull seg (see note under ox).<br>&nbsp;&nbsp;&nbsp;5. An outside irregular dealer in stocks, who is not a member of the exchange.<br>&nbsp;&nbsp;&nbsp;6. One who applies for the allotment of shares in new projects, with a view to sell immediately at a premium, and not to hold the stock.<br>&nbsp;&nbsp;&nbsp;7. The Eurasian wren, Troglodytes troglodytes.<br>&nbsp;&nbsp;&nbsp;8. (usually attributive) An unmarried male, a bachelor; a male not accompanying a female at a social event.<br>&nbsp;&nbsp;&nbsp;9. A social event for males held in honor of a groom on the eve of his wedding, attended by male friends of the groom, sometimes a fund-raiser.<br>&nbsp;&nbsp;&nbsp;10. A stag beetle (family Lucanidae).<br>&nbsp;&nbsp;&nbsp;11. Guard duty.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act as a \"stag\", an irregular dealer in stocks.<br>&nbsp;&nbsp;&nbsp;2. To watch; to dog, or keep track of.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a man, attending a formal social function without a date.<br>", "etymology": "First recorded in 1150–1200; Middle English stagge; akin to Old Norse steggi, steggr “male bird” (giving rise to northern English dialect steg “gander”), Icelandic steggur “male fox, tomcat”", "example": "It’s hard to drag your thoughts away from Mahomes’s pure physicality, the strange combination of brawn and lithe movement, the supple slinging throws, the dodging stag legs.", "synonym": "solo"}, {"word": "proprietor", "definitionA": "the owner of a business establishment, a hotel, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An owner.<br>&nbsp;&nbsp;&nbsp;2. A sole owner of an unincorporated business, also called a sole proprietor.<br>&nbsp;&nbsp;&nbsp;3. One of the owners of an unincorporated business, a partner.<br>&nbsp;&nbsp;&nbsp;4. (history) One or more persons to whom a colonial territory is assigned, like a fief, including its administration.<br>", "etymology": "First recorded in 1630–40; propriet(ary) + -or 2", "example": "Even small proprietors will need smartphone and tech knowledge that they may not wish to obtain.", "synonym": "freeholder"}, {"word": "cypress", "definitionA": "any of several evergreen coniferous trees constituting the genus Cupressus, having dark-green, scalelike, overlapping leaves.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An evergreen coniferous tree with flattened shoots bearing small scale-like leaves, whose dark foliage is sometimes associated with mourning, in family Cupressaceae, especially the genera Cupressus and Chamaecyparis.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin, translucent, usually black fabric, a kind of crape.<br>", "etymology": "before 1000; Middle English, Old English cypresse < Late Latin cypressus, apparently blend of Latin cupressus and cyparissus < Greek kypárissos; replacing Middle English cipres < Anglo-French, Old French < Late Latin, as above", "example": "Tom Sliter changes the subject to wood with a shot of Cypress shavings, whose curved petals segue to Eric Johnson’s photo of two red roses.", "synonym": null}, {"word": "amalgamate", "definitionA": "to mix or merge so as to make a combination; blend; unite; combine:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To merge, to combine, to blend, to join.<br>&nbsp;&nbsp;&nbsp;2. To make an alloy of a metal and mercury.<br>&nbsp;&nbsp;&nbsp;3. To combine (free groups) by identifying respective isomorphic subgroups.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Coalesced; united; combined.<br>", "etymology": "1635–45 amalgam + -ate 1( def )", "example": "Producers are amalgamating two productions with harrowingly topical stories for a run on alternating nights at the Lyceum Theatre.", "synonym": "admix"}, {"word": "sorghum", "definitionA": "a cereal grass, Sorghum bicolor (or S. vulgare ), having broad, cornlike leaves and a tall, pithy stem bearing the grain in a dense terminal cluster.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cereal, Sorghum bicolor (syn. Sorghum vulgare) the grains of which are used to make flour and as cattle feed.<br>&nbsp;&nbsp;&nbsp;2. Sorghum syrup.<br>", "etymology": "1590–1600; < New Latin < Italian sorgo ( sorgo )", "example": "Topping it, however, are see-through slices of stone fruit — plums one visit, peaches another — along with the everywhere garnish, Fresno chile, and nutty puffed sorghum.", "synonym": "glucose"}, {"word": "millet", "definitionA": "a cereal grass, Setaria italica, extensively cultivated in the East and in southern Europe for its small seed, or grain, used as food for humans and fowls, but in the U.S. grown chiefly for fodder.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of a group of various types of grass or its grains used as food, widely cultivated in the developing world.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A semi-autonomous confessional community under the Ottoman Empire, especially a non-Muslim one.<br>", "etymology": "1375–1425; late Middle English milet < Middle French, equivalent to mil (< Latin milium millet) + -et -et", "example": "Pilot projects in the collaborative are identifying the safest public spaces for women in Mexico City and mapping communities producing the most millet in Niger.", "synonym": null}, {"word": "rue", "definitionA": "to feel sorrow over; repent of; regret bitterly:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Sorrow; repentance; regret.<br>&nbsp;&nbsp;&nbsp;2. Pity; compassion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cause to repent of sin or regret some past action.<br>&nbsp;&nbsp;&nbsp;2. To cause to feel sorrow or pity.<br>&nbsp;&nbsp;&nbsp;3. To repent of or regret (some past action or event); to wish that a past action or event had not taken place.<br>&nbsp;&nbsp;&nbsp;4. To feel compassion or pity.<br>&nbsp;&nbsp;&nbsp;5. To feel sorrow or regret.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of various perennial shrubs of the genus Ruta, especially the herb Ruta graveolens (common rue), formerly used in medicines.<br>", "etymology": "before 900; (v.) Middle English ruen, rewen, Old English hrēowan; cognate with Dutch rouwen, German reuen; (noun) Middle English rewe, reowe, Old English hrēow; cognate with Dutch rouw, German Reue; ruth", "example": "Rue takes many different types of drugs throughout the show—from marijuana to Xanax—but she most commonly uses opioids.", "synonym": "apologize"}, {"word": "contingent", "definitionA": "dependent for existence, occurrence, character, etc., on something not yet certain; conditional (often followed by on or upon ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An event which may or may not happen; that which is unforeseen, undetermined, or dependent on something future.<br>&nbsp;&nbsp;&nbsp;2. That which falls to one in a division or apportionment among a number; a suitable share.<br>&nbsp;&nbsp;&nbsp;3. A quota of troops.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Possible or liable, but not certain to occur.<br>&nbsp;&nbsp;&nbsp;2. (with upon or on) Dependent on something that is undetermined or unknown.<br>&nbsp;&nbsp;&nbsp;3. Dependent on something that may or may not occur.<br>&nbsp;&nbsp;&nbsp;4. Not logically necessarily true or false.<br>&nbsp;&nbsp;&nbsp;5. Temporary.<br>", "etymology": "First recorded in 1350–1400; late Middle English, from Middle French, from Latin contingent-, stem of contingēns “touching together,” present participle of contingere “to touch together, come into contact with,” equivalent to con- con- + -tingere, variant stem of tangere “to touch”", "example": "The problem is that ethical truths are necessarily true, and you can’t account for necessary truths without in some way going beyond the contingent states of the physical world.", "synonym": "accidental"}, {"word": "vie", "definitionA": "to strive in competition or rivalry with another; contend for superiority:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A contest.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fight for superiority; to contend; to compete eagerly so as to gain something.<br>&nbsp;&nbsp;&nbsp;2. To rival (something), etc.<br>&nbsp;&nbsp;&nbsp;3. To do or produce in emulation, competition, or rivalry; to put in competition; to bandy.<br>&nbsp;&nbsp;&nbsp;4. To stake; to wager.<br>&nbsp;&nbsp;&nbsp;5. To stake a sum of money upon a hand of cards, as in the old game of gleek. See revie.<br>", "etymology": "First recorded in 1525–35; by shortening of Middle French envier “to raise the stake (at cards),” Old French: “to challenge, provoke,” from Latin invītāre “to entertain, treat, invite”", "example": "He also could land with the under-23 squad vying for an Olympic berth.", "synonym": "buck"}, {"word": "diminution", "definitionA": "the act, fact, or process of diminishing; lessening; reduction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lessening, decrease or reduction.<br>&nbsp;&nbsp;&nbsp;2. The act or process of making diminutive.<br>&nbsp;&nbsp;&nbsp;3. A compositional technique where the composer shortens the melody by shortening its note values.<br>", "etymology": "1275–1325; Middle English diminucion < Anglo-French diminuciun < Latin dīminūtiōn- (stem of dīminūtiō ), for dēminūtiōn- (stem of dēminūtiō ) (by influence of dīmunuere; diminish ), equivalent to dēminūt ( us ) (past participle of dēminuere, equivalent to dē- de- + minuere to lessen) + -iōn- -ion", "example": "“It could be that any improvement in the wellbeing of women produces a corresponding reduction in satisfaction among men, as if quality of life is a zero-sum game in which improvement for some means a diminution for others,” they concede.", "synonym": "abatement"}, {"word": "tootle", "definitionA": "to toot gently or repeatedly on a flute or the like.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A soft toot sound.<br>&nbsp;&nbsp;&nbsp;2. A trip or excursion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a soft toot sound.<br>&nbsp;&nbsp;&nbsp;2. To play (a musical instrument) making such a sound.<br>&nbsp;&nbsp;&nbsp;3. To go (somewhere); to amble aimlessly.<br>&nbsp;&nbsp;&nbsp;4. To transport (someone somewhere).<br>", "etymology": "First recorded in 1810–20; toot 1 + -le", "example": "Grandfather Tootle, the bassoon, spends his time in dozing: all you can hear from him is an occasional snore.", "synonym": "blast"}, {"word": "ordinance", "definitionA": "an authoritative rule or law; a decree or command.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A local law<br>&nbsp;&nbsp;&nbsp;2. An edict or decree, authoritative order.<br>&nbsp;&nbsp;&nbsp;3. A religious practice or ritual prescribed by the church.<br>", "etymology": "1275–1325; Middle English ordinaunce (< Old French ordenance ) < Medieval Latin ordinantia, derivative of Latin ordinant- (stem of ordināns ), present participle of ordināre to arrange. See ordination, -ance", "example": "Since then, the Louisville Metro Council unanimously voted to pass “Breonna’s Law,” an ordinance that bans the use of no-knock warrants.", "synonym": "authorization"}, {"word": "auxiliary", "definitionA": "additional; supplementary; reserve:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person or group that acts in an auxiliary manner.<br>&nbsp;&nbsp;&nbsp;2. A sailing vessel equipped with an engine.<br>&nbsp;&nbsp;&nbsp;3. (grammar) An auxiliary verb.<br>&nbsp;&nbsp;&nbsp;4. A marching band colorguard.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Helping; giving assistance or support.<br>&nbsp;&nbsp;&nbsp;2. Supplementary or subsidiary.<br>&nbsp;&nbsp;&nbsp;3. Held in reserve for exceptional circumstances.<br>&nbsp;&nbsp;&nbsp;4. Of a ship, having both sails and an engine.<br>&nbsp;&nbsp;&nbsp;5. (grammar) Relating to an auxiliary verb.<br>", "etymology": "1595–1605; < Latin auxiliārius assisting, aiding, helping, equivalent to auxili ( um ) aid, help ( aux ( us ) increased, augmented (past participle of augēre: aug- increase + -sus, variant of -tus past participle suffix) + -ilium noun suffix) + -ārius -ary", "example": "Yet their ability to create layups and open threes in transition helps keep auxiliary scoring options involved, and both are capable of drawing double teams and finding the open man.", "synonym": "accessory"}, {"word": "toot", "definitionA": "(of a horn or whistle) to give forth its characteristic sound.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The noise of a horn or whistle.<br>&nbsp;&nbsp;&nbsp;2. (by extension) A fart; flatus.<br>&nbsp;&nbsp;&nbsp;3. Cocaine.<br>&nbsp;&nbsp;&nbsp;4. A portion of cocaine that a person snorts.<br>&nbsp;&nbsp;&nbsp;5. A spree of drunkness.<br>&nbsp;&nbsp;&nbsp;6. (pronounced /tʊt/) Rubbish; tat.<br>&nbsp;&nbsp;&nbsp;7. A message on the social networking software Mastodon.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stand out, or be prominent.<br>&nbsp;&nbsp;&nbsp;2. To peep; to look narrowly.<br>&nbsp;&nbsp;&nbsp;3. To see; to spy.<br>&nbsp;&nbsp;&nbsp;4. To flatulate.<br>&nbsp;&nbsp;&nbsp;5. To make the sound of a horn or whistle.<br>&nbsp;&nbsp;&nbsp;6. To cause a horn or whistle to make its sound.<br>&nbsp;&nbsp;&nbsp;7. To go on a drinking binge.<br>&nbsp;&nbsp;&nbsp;8. To snort (a recreational drug).<br>&nbsp;&nbsp;&nbsp;9. To post a message on a Mastodon instance (a self-hosted version of the networking software).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A toilet.<br>", "etymology": "First recorded in 1500–10; akin to Low German, German tuten, Dutch toeten, Swedish tuta in the same sense; imitative of the sound; 1975–80 toot 1fordef 7", "example": "“I’m getting more horn toots, and waves and smiles and thumbs ups,” Higa said.", "synonym": "blow"}, {"word": "ruth", "definitionA": "a Moabite woman who married Boaz and became an ancestor of David: the daughter-in-law of Naomi.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Sorrow for the misery of another; pity, compassion; mercy.<br>&nbsp;&nbsp;&nbsp;2. Repentance; regret; remorse.<br>&nbsp;&nbsp;&nbsp;3. Sorrow; misery; distress.<br>&nbsp;&nbsp;&nbsp;4. Something which causes regret or sorrow; a pitiful sight.<br>", "etymology": "First recorded in 1200–50; Middle English ruthe, reuthe; rue 1, -th 1", "example": "Now Attorney General, Ruth is creating an FBI task force to investigate serial violent and sexual crimes.", "synonym": "grief"}, {"word": "anacrusis", "definitionA": "Prosody. an unstressed syllable or syllable group that begins a line of verse but is not counted as part of the first foot.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An unstressed syllable at the start of a verse.<br>&nbsp;&nbsp;&nbsp;2. An unstressed note or notes before the first strong beat (or downbeat) of a phrase.<br>", "etymology": "1825–35; < Latin < Greek anákrousis, equivalent to anakroú(ein ) to strike up, push back ( ana- ana- + kroúein to strike, push) + -sis -sis", "example": "Whether the half-line be first or second, it is usually of the A type without anacrusis.", "synonym": null}, {"word": "recrudesce", "definitionA": "to break out afresh, as a sore, a disease, or anything else that has been quiescent.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To recur, or break out anew after a dormant period.<br>", "etymology": "1880–85; < Latin recrūdēscere to become raw again, equivalent to re- re- + crūdēscere to grow harsh, worse ( crūd ( us ) bloody ( crude ) + -ēscere inchoative suffix)", "example": "It was noticeable that in these rambling soliloquies his English seemed to recrudesce into better construction and phraseology.", "synonym": "react"}, {"word": "ecru", "definitionA": "very light brown in color, as raw silk, unbleached linen, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A beige colour.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a beige colour.<br>", "etymology": "1865–70; < French, equivalent to é- completely (< Latin ex- ex- 1 ) + cru raw (< Latin crūdus; crude )", "example": "She wore a couture ecru-colored coat, slim-fitting pants and, best of all: a sleek, shiny new hairstyle.", "synonym": "beige"}, {"word": "deodorant", "definitionA": "an agent for destroying odors.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any agent acting to eliminate, reduce, mask, or control odor.<br>&nbsp;&nbsp;&nbsp;2. An odor-controlling substance applied to the underarm to counteract odor from perspiration.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Acting or including an agent to eliminate, reduce, mask, or control odor<br>", "etymology": "First recorded in 1865–70; de- + odor + -ant", "example": "Aluminum-free deodorants are one way to cut down on exposure to potentially harmful substances.", "synonym": "antiperspirant"}]