[{"word": "consuetude", "definitionA": "custom, especially as having legal force.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Custom, familiarity.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Old French consuetude, a learned borrowing or Latinism from Latin consuētūd(o), “custom, habit, usage, social intercourse, illicit affair,” equivalent to con- con- + suē- (root of suēscere “to accustom, become accustomed,” akin to suus “one's own”) + -tūdō -tude", "example": "It is right that we should look before we leap, but it is gross misconduct to neglect duty to conform to the consuetudes of the hour.", "synonym": "familiarity"}, {"word": "booze", "definitionA": "any alcoholic beverage; whiskey.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;2. A session of drinking alcohol; a drinking party.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drink alcohol.<br>", "etymology": "1610–20; respelling of bouse 2, reflecting one of its pronunciation variants", "example": "Aside from the scheduled sailings, the crew would voluntarily give up their time to put on several special \"booze cruises\" to raise money for island charities.", "synonym": "cocktail"}, {"word": "moot", "definitionA": "open to discussion or debate; debatable; doubtful:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A moot court.<br>&nbsp;&nbsp;&nbsp;2. A system of arbitration in many areas of Africa in which the primary goal is to settle a dispute and reintegrate adversaries into society rather than assess penalties.<br>&nbsp;&nbsp;&nbsp;3. A gathering of Rovers, usually in the form of a camp lasting 2 weeks.<br>&nbsp;&nbsp;&nbsp;4. A social gathering of pagans, normally held in a public house.<br>&nbsp;&nbsp;&nbsp;5. An assembly (usually for decision-making in a locality).<br>&nbsp;&nbsp;&nbsp;6. A ring for gauging wooden pins.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Subject to discussion (originally at a moot); arguable, debatable, unsolved or impossible to solve.<br>&nbsp;&nbsp;&nbsp;2. Being an exercise of thought; academic.<br>&nbsp;&nbsp;&nbsp;3. Having no practical impact or relevance.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A whisper, or an insinuation, also gossip or rumors.<br>&nbsp;&nbsp;&nbsp;2. (rural) Talk.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bring up as a subject for debate, to propose.<br>&nbsp;&nbsp;&nbsp;2. To discuss or debate.<br>&nbsp;&nbsp;&nbsp;3. To make or declare irrelevant.<br>&nbsp;&nbsp;&nbsp;4. To argue or plead in a supposed case.<br>&nbsp;&nbsp;&nbsp;5. To talk or speak.<br>&nbsp;&nbsp;&nbsp;6. To say, utter, also insinuate.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Vagina.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The stump of a tree; the roots and bottom end of a felled tree.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take root and begin to grow.<br>&nbsp;&nbsp;&nbsp;2. To turn up soil or dig up roots, especially an animal with the snout.<br>", "etymology": "First recorded before 900; Middle English noun mot(e) “meeting, assembly,” Old English gemōt; cognate with Old Norse mōt, Dutch gemoet “meeting”; meet 1none", "example": "At times, Putin has mooted the possibility of using nuclear weapons, too.", "synonym": "open"}, {"word": "pomaceous", "definitionA": "of, relating to, or of the nature of pomes.", "definitionB": "No definition found", "etymology": "From the New Latin word pōmāceus, dating back to 1700–10. See pome, -aceous", "example": "Some aren’t even made from apples, but pears or other pomaceous fruit.", "synonym": null}, {"word": "pomegranate", "definitionA": "a chambered, many-seeded, globose fruit, having a tough, usually red rind and surmounted by a crown of calyx lobes, the edible portion consisting of pleasantly acid flesh developed from the outer seed coat.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fruit-bearing shrub or small tree, Punica granatum.<br>&nbsp;&nbsp;&nbsp;2. The fruit of Punica granatum, about the size of an orange and having a red pulp containing many seeds and enclosed in a thick, hard, reddish skin.<br>&nbsp;&nbsp;&nbsp;3. A dark red colour, like that of a pomegranate.<br>", "etymology": "1275–1325; Middle English poumgarnet, pomegarnade (< Old French pome grenate, pome gernete ), representing Medieval Latin pōmum grānātum literally, seedy apple. See pome, grenade", "example": "Earlier on Monday, Harris commemorated those killed or taken hostage on 7 October by planting a pomegranate tree at the vice-president’s residence in Washington.", "synonym": "amethyst"}, {"word": "hoedown", "definitionA": "a community dancing party typically featuring folk and square dances accompanied by lively hillbilly tunes played on the fiddle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A type of American folk or square dance.<br>&nbsp;&nbsp;&nbsp;2. The type of music typically played for such a dance<br>&nbsp;&nbsp;&nbsp;3. A gathering at which such dances take place.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dance a hoedown dance<br>", "etymology": "An Americanism dating back to 1835–45; hoe + down 1", "example": "Perhaps you’ll be asked to act in a moving-picture show, participate in a mustache contest, take a drawing class, help a gang rob a bank or inspire a bashful Calico resident to ask a lady to the afternoon hoedown.", "synonym": "hop"}, {"word": "snivel", "definitionA": "to weep or cry with sniffling.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of snivelling.<br>&nbsp;&nbsp;&nbsp;2. Nasal mucus; snot.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To breathe heavily through the nose while it is congested with nasal mucus.<br>&nbsp;&nbsp;&nbsp;2. To cry while sniffling; to whine or complain while crying.<br>&nbsp;&nbsp;&nbsp;3. To say (something) while sniffling or crying.<br>", "etymology": "First recorded in 1275–1325; Middle English snyvele; compare Old English snyflung “sniveling,” derivative of snofl “mucus”; cognate with Low German snüfeln", "example": "Ignoring the candidates, he just sniveled about the “stolen” election and how Republicans’ votes did not count in Georgia.", "synonym": "gripe"}, {"word": "abrogate", "definitionA": "to abolish by formal or official means; annul by an authoritative act; repeal:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To annul by an authoritative act; to abolish by the authority of the maker or her or his successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc.<br>&nbsp;&nbsp;&nbsp;2. To put an end to; to do away with.<br>&nbsp;&nbsp;&nbsp;3. To block a process or function.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abrogated; abolished.<br>", "etymology": "1520–30; < Latin abrogātus repealed (past participle of abrogāre ). See ab-, rogation, -ate 1", "example": "Among crucial steps, it’s long past time to restore three treaties that the United States abrogated — ABM, Intermediate-Range Nuclear Forces and Open Skies.", "synonym": "abate"}, {"word": "farrow", "definitionA": "a litter of pigs.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A litter of piglets.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give birth to a (litter of piglets).<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of cows) Not pregnant; not producing young (not calving) in a given season or year; barren.<br>", "etymology": "First recorded before 900; Middle English farwen “to give birth to a litter of pigs,” derivative of Old English fearh “pig” (cognate with Latin porcus ); akin to German Ferkel “young pig”", "example": "About 80 sows and 1,000 piglets were in a farrowing house on the farm.", "synonym": "anteater"}, {"word": "gelid", "definitionA": "very cold; icy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Very cold; icy or frosty.<br>", "etymology": "1600–10; < Latin gelidus icy cold, equivalent to gel ( um ) frost, cold + -idus -id 4", "example": "But the Kuiper Belt, a torus-shaped ring of gelid objects, including the dwarf planet Pluto, will have its portrait taken by VRO in considerable detail.", "synonym": null}, {"word": "prehensile", "definitionA": "adapted for seizing, grasping, or taking hold of something:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able to take hold of and clasp objects; adapted for grasping especially by wrapping around an object.<br>", "etymology": "1781–85; < French préhensile (coined by Buffon), equivalent to Latin prehens ( us ) ( prehension ) + French -ile -ile", "example": "Many also have long, prehensile tails capable of bearing their weight, which they use while climbing and reaching for fruit.", "synonym": "wishful"}, {"word": "dungaree", "definitionA": "dungarees,", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Heavy denim fabric, often blue; blue jean material.<br>&nbsp;&nbsp;&nbsp;2. Pants or overalls made from such fabric.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Heavy denim pants or trousers, usually with bib and braces, worn especially as work clothing.<br>", "etymology": "First recorded in 1605–15, dungaree is from the Hindi word dungrī kind of coarse cloth", "example": "\"She was the kindest and happiest person you could ever meet and could rock a pair of dungarees like no other. We love and miss you Sarah x.\"", "synonym": null}, {"word": "kennel", "definitionA": "a house or shelter for a dog or a cat.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A house or shelter for a dog.<br>&nbsp;&nbsp;&nbsp;2. A facility at which dogs are reared or boarded.<br>&nbsp;&nbsp;&nbsp;3. (collective) The dogs kept at such a facility; a pack of hounds.<br>&nbsp;&nbsp;&nbsp;4. The hole of a fox or other animal.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To house or board a dog (or less commonly another animal).<br>&nbsp;&nbsp;&nbsp;2. To lie or lodge; to dwell, as a dog or a fox.<br>&nbsp;&nbsp;&nbsp;3. To drive (a fox) to covert in its hole.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The gutter at the edge of a street; a surface drain.<br>&nbsp;&nbsp;&nbsp;2. A puddle.<br>", "etymology": "First recorded in 1300–50; Middle English kenel, from unattested Anglo-French kenil ( French chenil) from unattested Vulgar Latin canīle ( Latin can(is) “dog” + -īle suffix of place)", "example": "The dog was seized and remains in police kennels.", "synonym": "den"}, {"word": "stag", "definitionA": "an adult male deer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An adult male deer.<br>&nbsp;&nbsp;&nbsp;2. A colt, or filly.<br>&nbsp;&nbsp;&nbsp;3. (by extension) A romping girl; a tomboy.<br>&nbsp;&nbsp;&nbsp;4. An improperly or late castrated bull or ram – also called a bull seg (see note under ox).<br>&nbsp;&nbsp;&nbsp;5. An outside irregular dealer in stocks, who is not a member of the exchange.<br>&nbsp;&nbsp;&nbsp;6. One who applies for the allotment of shares in new projects, with a view to sell immediately at a premium, and not to hold the stock.<br>&nbsp;&nbsp;&nbsp;7. The Eurasian wren, Troglodytes troglodytes.<br>&nbsp;&nbsp;&nbsp;8. (usually attributive) An unmarried male, a bachelor; a male not accompanying a female at a social event.<br>&nbsp;&nbsp;&nbsp;9. A social event for males held in honor of a groom on the eve of his wedding, attended by male friends of the groom, sometimes a fund-raiser.<br>&nbsp;&nbsp;&nbsp;10. A stag beetle (family Lucanidae).<br>&nbsp;&nbsp;&nbsp;11. Guard duty.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act as a \"stag\", an irregular dealer in stocks.<br>&nbsp;&nbsp;&nbsp;2. To watch; to dog, or keep track of.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Of a man, attending a formal social function without a date.<br>", "etymology": "First recorded in 1150–1200; Middle English stagge; akin to Old Norse steggi, steggr “male bird” (giving rise to northern English dialect steg “gander”), Icelandic steggur “male fox, tomcat”", "example": "And in Hebden Bridge, Yorkshire, some locals last month complained of an uptick in stag and hen parties after the town was popularised by BBC crime series Happy Valley.", "synonym": "solo"}]