[{"word": "bipolar", "definitionA": "having two poles, as the earth.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bipolar cell.<br>&nbsp;&nbsp;&nbsp;2. Short for bipolar disorder and bipolarity.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Involving or having both extremes or poles at the same time.<br>&nbsp;&nbsp;&nbsp;2. Relating to both polar regions<br>&nbsp;&nbsp;&nbsp;3. Relating to a bipole<br>&nbsp;&nbsp;&nbsp;4. Relating to or having bipolar disorder.<br>&nbsp;&nbsp;&nbsp;5. Of or relating to an international system in which two states wield most of the cultural, economic, and political influence.<br>", "etymology": "First recorded in 1800–10; bi- 1 + polar", "example": "The “Wizards Beyond Waverly Place” star has spoken candidly about her struggles with anxiety, panic attacks and depression caused by her lupus and bipolar disorder diagnoses.", "synonym": "oscillating"}, {"word": "secede", "definitionA": "to withdraw formally from an alliance, federation, or association, as from a political union, a religious organization, etc.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To split from or to withdraw from membership of a political union, an alliance or an organisation.<br>&nbsp;&nbsp;&nbsp;2. To split or to withdraw one or more constituent entities from membership of a political union, an alliance or an organisation.<br>", "etymology": "First recorded in 1695–1705, secede is from the Latin word sēcēdere to withdraw. See se-, cede", "example": "Carter spoke about Sudan — its possibilities and dangers, and the fact that in coming months the country’s south, with its vast oil reserves, would hold an independence referendum on whether to secede from the north.", "synonym": "abdicate"}, {"word": "chintz", "definitionA": "a printed cotton fabric, glazed or unglazed, used especially for draperies.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A painted or stained calico fabric, originally produced in India, and known for its brightly colored designs.<br>", "etymology": "1605–15; earlier chints, plural of chint < Gujarati chī̃ṭ", "example": "She had almost no belongings, so her parents sent her some ’90s chintz furniture that they had in storage.", "synonym": null}, {"word": "tizzy", "definitionA": "a dither", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A state of nervous excitement, confusion, or distress; a dither.<br>&nbsp;&nbsp;&nbsp;2. A sixpence; a tester.<br>", "etymology": "First recorded in 1795–1805; origin uncertain", "example": "From the moment Aaron Judge sent the raucous crowd into a game-long tizzy when he angrily reacted to being hit in the hand by a third-inning Hudson pitch, the Yankees attacked.", "synonym": "anxiety"}, {"word": "gripe", "definitionA": "Informal. to complain naggingly or constantly; grumble.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A complaint, often a petty or trivial one.<br>&nbsp;&nbsp;&nbsp;2. A wire rope, often used on davits and other life raft launching systems.<br>&nbsp;&nbsp;&nbsp;3. Grasp; clutch; grip<br>&nbsp;&nbsp;&nbsp;4. That which is grasped; a handle; a grip.<br>&nbsp;&nbsp;&nbsp;5. A device for grasping or holding anything; a brake to stop a wheel.<br>&nbsp;&nbsp;&nbsp;6. Oppression; cruel exaction; affliction; pinching distress.<br>&nbsp;&nbsp;&nbsp;7. (chiefly in the plural) Pinching and spasmodic pain in the intestines.<br>&nbsp;&nbsp;&nbsp;8. The piece of timber that terminates the keel at the fore end; the forefoot.<br>&nbsp;&nbsp;&nbsp;9. The compass or sharpness of a ship's stern under the water, having a tendency to make her keep a good wind.<br>&nbsp;&nbsp;&nbsp;10. An assemblage of ropes, dead-eyes, and hocks, fastened to ringbolts in the deck, to secure the boats when hoisted.<br>&nbsp;&nbsp;&nbsp;11. A vulture, Gyps fulvus; the griffin.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To complain; to whine.<br>&nbsp;&nbsp;&nbsp;2. To annoy or bother.<br>&nbsp;&nbsp;&nbsp;3. To tend to come up into the wind, as a ship which, when sailing close-hauled, requires constant labour at the helm.<br>&nbsp;&nbsp;&nbsp;4. To pinch; to distress. Specifically, to cause pinching and spasmodic pain to the bowels of, as by the effects of certain purgative or indigestible substances.<br>&nbsp;&nbsp;&nbsp;5. To suffer griping pains.<br>&nbsp;&nbsp;&nbsp;6. To make a grab (to, towards, at or upon something).<br>&nbsp;&nbsp;&nbsp;7. To seize or grasp.<br>", "etymology": "First recorded in 1350–1400; Middle English gripen, Old English grīpan; cognate with Dutch grijpen, German griefen; grip, grope", "example": "A third member, however, griped that so many supplicants crowd the place these days that he sometimes can’t get a table.", "synonym": "aching"}, {"word": "dither", "definitionA": "a trembling; vibration.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The state of being undecided.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tremble, shake, or shiver with cold.<br>&nbsp;&nbsp;&nbsp;2. To be uncertain or unable to make a decision about doing something.<br>&nbsp;&nbsp;&nbsp;3. To do something nervously.<br>&nbsp;&nbsp;&nbsp;4. To render an approximation of (an image, etc.) by using dot patterns to approximate (the features of) colors not in the system palette.<br>&nbsp;&nbsp;&nbsp;5. To intentionally add noise to a signal to randomize errors.<br>", "etymology": "1640–50; variant of didder ( late Middle English diddere ); dodder 1", "example": "The source denies the accusation of “dither”, saying it takes time to work out the right moves.", "synonym": "agitation"}, {"word": "dodder", "definitionA": "to shake; tremble; totter.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shake or tremble as one moves, especially as of old age or childhood; to totter.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of about 100-170 species of yellow, orange or red (rarely green) parasitic plants of the genus Cuscuta. Formerly treated as the only genus in the family Cuscutaceae, recent genetic research by the Angiosperm Phylogeny Group has shown that it is correctly placed in the morning glory family, Convolvulaceae.<br>", "etymology": "First recorded in 1610–20; origin uncertain; perhaps a variant of dadder “to shake, tremble,” of expressive origin; dither, totter, teeter, etc.", "example": "While Biden has been vulnerable to right-wing online trolls who portrayed him as doddering and confused, recent attempts to troll and negatively meme Harris have backfired, Miller said.", "synonym": "quiver"}, {"word": "totter", "definitionA": "to walk or go with faltering, unsteady steps:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An unsteady movement or gait.<br>&nbsp;&nbsp;&nbsp;2. A rag and bone man.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To walk, move or stand unsteadily or falteringly; threatening to fall.<br>&nbsp;&nbsp;&nbsp;2. To be on the brink of collapse.<br>&nbsp;&nbsp;&nbsp;3. To collect junk or scrap.<br>", "etymology": "First recorded in 1150–1200; Middle English toteren “to swing”; origin uncertain", "example": "Hope as a concept would not have worked for Biden, whose age and mental acuity were in question and who seemed to be tottering toward the election with little wind in his political sails.", "synonym": "blunder"}, {"word": "teeter", "definitionA": "to move unsteadily.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A teeter-totter or seesaw.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tilt back and forth on an edge.<br>&nbsp;&nbsp;&nbsp;2. To be indecisive.<br>&nbsp;&nbsp;&nbsp;3. To be close to becoming a typically negative situation.<br>", "etymology": "1835–45; variant of dial. titter, Middle English titeren < Old Norse titra tremble; cognate with German zittern to tremble, quiver", "example": "In it, the Puerto Rican singer pays homage to the infectious Caribbean rhythms, teetering between his bad-boy image and sensual energy.", "synonym": "balance"}, {"word": "asceticism", "definitionA": "the manner of life, practices, or principles of an ascetic.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The principles and practices of an ascetic; extreme self-denial and austerity.<br>", "etymology": "First recorded in 1640–50; ascetic + -ism", "example": "His timing was impeccable, meeting a counterculture primed to embrace ISKCON’s practices of communal living, ecstatic dancing and asceticism.", "synonym": "abnegation"}, {"word": "ascesis", "definitionA": "strict self-discipline or self-control, as for religious or meditative purposes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (Rigorous) self-discipline, particularly as a religious observance; asceticism.<br>&nbsp;&nbsp;&nbsp;2. (specifically) The praxis or \"exercise\" of asceticism and self-denial of impulses or passions for the sake of piety, theosis, and connection with God.<br>", "etymology": "First recorded in 1870–75; from Greek askēsis “exercise, training,” equivalent to askē- (variant stem of askeîn “to practice, train”) + -sis noun suffix; -sis", "example": "Monophysitism adopted this tradition, and made ascesis the central duty of the Christian life.", "synonym": null}, {"word": "abnegate", "definitionA": "to refuse or deny oneself (some rights, conveniences, etc.); reject; renounce.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deny (oneself something); to renounce or give up (a right, a power, a claim, a privilege, a convenience).<br>&nbsp;&nbsp;&nbsp;2. To relinquish; to surrender; to abjure.<br>", "etymology": "1650–60; < Latin abnegātus denied (past participle of abnegāre ). See ab-, negate", "example": "It’s not a matter of abnegating rights, O.K.?", "synonym": "abstain"}]