[{"word": "subpoena", "definitionA": "the usual writ for the summoning of witnesses or the submission of evidence, as records or documents, before a court or other deliberative body.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A writ requiring a defendant to appear in court to answer a plaintiff's claim.<br>&nbsp;&nbsp;&nbsp;2. A writ requiring someone to appear in court to give testimony.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To summon with a subpoena.<br>", "etymology": "First recorded in 1375–1425; late Middle English, from Latin sub poenā “under penalty” (the first words of the writ)", "example": "Earlier in the day, Johnson’s panel voted to authorize subpoenas in its probe targeting former Obama administration officials.", "synonym": "command"}, {"word": "snoop", "definitionA": "to prowl or pry; go about in a sneaking, prying way.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of snooping<br>&nbsp;&nbsp;&nbsp;2. One who snoops<br>&nbsp;&nbsp;&nbsp;3. A private detective<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be devious and cunning so as not to be seen.<br>&nbsp;&nbsp;&nbsp;2. To secretly spy on or investigate, especially into the private personal life of others.<br>", "etymology": "1825–35, Americanism; < Dutch snoepen to take and eat food on the sly", "example": "Hidden defects could allow a stealthy snoop to penetrate the security unnoticed.", "synonym": "busybody"}, {"word": "prowl", "definitionA": "to rove or go about stealthily, as in search of prey, something to steal, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of prowling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rove over, through, or about in a stealthy manner; especially, to search in, as for prey or booty.<br>&nbsp;&nbsp;&nbsp;2. To idle; to go about aimlessly.<br>&nbsp;&nbsp;&nbsp;3. To collect by plunder.<br>", "etymology": "First recorded in 1350–1400; Middle English prollen; origin uncertain", "example": "I found myself longing to learn more about Sophie’s callous roommate, her wealthy British boyfriend or Jesse’s sister, out on the prowl after divorcing her wife.", "synonym": "cruise"}, {"word": "pry", "definitionA": "to inquire impertinently or unnecessarily into something:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of prying.<br>&nbsp;&nbsp;&nbsp;2. An excessively inquisitive person.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To look where one is not welcome; to be nosy.<br>&nbsp;&nbsp;&nbsp;2. To keep asking about something that does not concern one.<br>&nbsp;&nbsp;&nbsp;3. To look closely and curiously at (something closed or not public).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lever.<br>&nbsp;&nbsp;&nbsp;2. Leverage.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use leverage to open or widen.<br>", "etymology": "First recorded in 1300–50; Middle English prien, “look about, peep”; further origin unknown", "example": "In a small area, he explains, using a pry bar to leverage a heavy piece of material onto sections of rolling steel pipe can be a way to move it to a more open area.", "synonym": "bug"}, {"word": "pare", "definitionA": "to cut off the outer coating, layer, or part of.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To remove the outer covering or skin of something with a cutting device, typically a knife<br>&nbsp;&nbsp;&nbsp;2. (often with down or back) to reduce, diminish or trim gradually something as if by cutting off<br>&nbsp;&nbsp;&nbsp;3. To trim the hoof of a horse<br>", "etymology": "First recorded in 1275–1325; Middle English paren, from Middle French parer, “to make ready, trim” from Latin parāre ”to prepare, make ready“; prepare", "example": "Closures of the Mall would not alter plans for the inauguration ceremony, which had already been pared back because of the coronavirus pandemic, said a senior official with the committee planning the event.", "synonym": "carve"}, {"word": "dovish", "definitionA": "(especially of a person in public office) advocating peace, compromise, or a conciliatory national attitude:", "definitionB": "No definition found", "etymology": "dov(e) 1( def ) + -ish 1", "example": "Though they viewed Brainard as slightly more dovish, ultimately they predicted an interest rate hike in the second half of 2022 was the most likely scenario regardless of who of the two was at the helm.", "synonym": null}, {"word": "batten", "definitionA": "to thrive by feeding; grow fat.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To become better; improve in condition, especially by feeding.<br>&nbsp;&nbsp;&nbsp;2. To feed (on); to revel (in).<br>&nbsp;&nbsp;&nbsp;3. To thrive by feeding; grow fat; feed oneself gluttonously.<br>&nbsp;&nbsp;&nbsp;4. To thrive, prosper, or live in luxury, especially at the expense of others; fare sumptuously.<br>&nbsp;&nbsp;&nbsp;5. To gratify a morbid appetite or craving; gloat.<br>&nbsp;&nbsp;&nbsp;6. To improve by feeding; fatten; make fat or cause to thrive due to plenteous feeding.<br>&nbsp;&nbsp;&nbsp;7. To fertilize or enrich, as land.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin strip of wood used in construction to hold members of a structure together or to provide a fixing point.<br>&nbsp;&nbsp;&nbsp;2. A long strip of wood, metal, fibreglass etc., used for various purposes aboard ship, especially one inserted in a pocket sewn on the sail in order to keep the sail flat.<br>&nbsp;&nbsp;&nbsp;3. In stagecraft, a long pipe, usually metal, affixed to the ceiling or fly system in a theater.<br>&nbsp;&nbsp;&nbsp;4. The movable bar of a loom, which strikes home or closes the threads of a woof.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To furnish with battens.<br>&nbsp;&nbsp;&nbsp;2. To fasten or secure a hatch etc using battens.<br>", "etymology": "First recorded in 1585–95; apparently from Old Norse batna “to improve”; cognate with Gothic gabatnan “to benefit, profit”; compare Old English bet, Gothic batis, Old High German baz “better”; better 1( def )", "example": "It was a gloomy evening in April 2021, and I was battening down my mental hatches against whispers insisting the persistent full-body ache I’d begun to feel was the infamous new coronavirus.", "synonym": "fix"}, {"word": "rut", "definitionA": "a furrow or track in the ground, especially one made by the passage of a vehicle or vehicles.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Sexual desire or oestrus of cattle, and various other mammals.<br>&nbsp;&nbsp;&nbsp;2. The noise made by deer during sexual excitement.<br>&nbsp;&nbsp;&nbsp;3. Roaring, as of waves breaking upon the shore; rote.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be in the annual rut or mating season.<br>&nbsp;&nbsp;&nbsp;2. To have sexual intercourse.<br>&nbsp;&nbsp;&nbsp;3. To have sexual intercourse with.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A furrow, groove, or track worn in the ground, as from the passage of many wheels along a road.<br>&nbsp;&nbsp;&nbsp;2. A fixed routine, procedure, line of conduct, thought or feeling.<br>&nbsp;&nbsp;&nbsp;3. A dull routine.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a furrow.<br>", "etymology": "First recorded in 1570–80; perhaps variant of route", "example": "Hunting during the elk rut is a uniquely powerful experience.", "synonym": "furrow"}, {"word": "swab", "definitionA": "a large mop used on shipboard for cleaning decks, living quarters, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small piece of soft, absorbent material, such as gauze, used to clean wounds, apply medicine, or take samples of body fluids. Often attached to a stick or wire to aid access.<br>&nbsp;&nbsp;&nbsp;2. A sample taken with a swab (piece of absorbent material).<br>&nbsp;&nbsp;&nbsp;3. A piece of material used for cleaning or sampling other items like musical instruments or guns.<br>&nbsp;&nbsp;&nbsp;4. A mop, especially on a ship.<br>&nbsp;&nbsp;&nbsp;5. A sailor; a swabby.<br>&nbsp;&nbsp;&nbsp;6. A naval officer's epaulet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a swab on something, or clean something with a swab.<br>", "etymology": "First recorded in 1645–55; back formation from swabber", "example": "A woman standing in line for a coronavirus test asks one of the officials if the test—a nose and throat swab—hurts.", "synonym": "scrub"}, {"word": "tantrum", "definitionA": "a violent demonstration of rage or frustration; a sudden burst of ill temper.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An often childish display or fit of bad temper.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To throw a tantrum.<br>", "etymology": "First recorded in 1740–50; origin uncertain", "example": "No wonder I recently had a claustrophobic tantrum and walked out of my house so I could sit alone in my car in the dark for 30 minutes.", "synonym": "anger"}, {"word": "tetchy", "definitionA": "irritable; touchy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Easily annoyed or irritated; peevish, testy or irascible.<br>", "etymology": "1585–95; origin uncertain; tetched, -y 1", "example": "Order a burger from the food truck parked out front, and be prepared to make friends fast—the Nugget is a place where people aren’t tetchy that you’re skiing their mountain.", "synonym": null}, {"word": "doldrums", "definitionA": "a state of inactivity or stagnation, as in business or art:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A slothful or stupid person.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Usually preceded by the: a state of apathy or lack of interest; a situation where one feels boredom, ennui, or tedium; a state of listlessness or malaise.<br>&nbsp;&nbsp;&nbsp;2. Usually preceded by the: the state of a sailing ship when it is impeded by calms or light, baffling winds, and is unable to make progress.<br>&nbsp;&nbsp;&nbsp;3. (by extension) Usually preceded by the: a part of the ocean near the equator where calms, squalls, and light, baffling winds are common.<br>", "etymology": "First recorded in 1795–1805; obsolete dold stupid ( dolt ) + -rum(s) (plural) noun suffix ( tantrum )", "example": "The prospects for geothermal—energy extracted from the nuclear furnace at the Earth’s core—are rising after decades in the doldrums.", "synonym": "apathy"}, {"word": "cower", "definitionA": "to crouch, as in fear or shame.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To crouch or cringe, or to avoid or shy away from something, in fear.<br>&nbsp;&nbsp;&nbsp;2. To crouch in general.<br>&nbsp;&nbsp;&nbsp;3. To cause to cower; to frighten into submission.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cherish with care.<br>", "etymology": "1250–1300; Middle English couren; cognate with Norwegian, Swedish kūra, Middle Low German kūren, German kauern", "example": "We laughed that off, but it was harder to do the same when everyone coming down the trail toward us cowered in fear at the sight of the dogs the hiker lied had just bit him.", "synonym": "blench"}, {"word": "cringey", "definitionA": "causing a reaction or feeling of embarrassment, awkwardness, or discomfort; cringeworthy:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Characterised by causing feelings of embarrassment; embarrassing.<br>&nbsp;&nbsp;&nbsp;2. Cringing; cowardly.<br>", "etymology": "First recorded in 1965–70; cringe ( def ) + -y 1( def )", "example": "It’s not for anyone who can’t stand gruesomeness, or who hates having their heart seize due to explicit sex, surprises, cringey scenes, or jumpy scares.", "synonym": null}, {"word": "grovel", "definitionA": "to humble oneself or act in an abject manner, as in great fear or utter servility.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be prone on the ground.<br>&nbsp;&nbsp;&nbsp;2. To crawl.<br>&nbsp;&nbsp;&nbsp;3. To abase oneself before another person.<br>&nbsp;&nbsp;&nbsp;4. To be slavishly nice to someone or apologize in the hope of securing something.<br>&nbsp;&nbsp;&nbsp;5. To take pleasure in mundane activities.<br>", "etymology": "1585–95; back formation from obsolete groveling (adv.), equivalent to obsolete grufe face down (< Old Norse ā grūfu face down) + -ling 2, taken to be present participle", "example": "I found the island’s one pier, paddled out, and proceeded to grovel for two-foot waves.", "synonym": "beg"}, {"word": "replete", "definitionA": "abundantly supplied or provided; filled (usually followed by with ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A honeypot ant.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fill to repletion, or restore something that has been depleted.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abounding.<br>&nbsp;&nbsp;&nbsp;2. Gorged, filled to near the point of bursting, especially with food or drink.<br>", "etymology": "First recorded in 1350–1400; Middle English repleet, from Middle French replet, from Latin replētus, past participle of replēre “to fill up,” equivalent to re- “again, again and again” + plē(re) “to fill” (akin to plēnus “full”) + -tus past participle suffix; re-, full 1", "example": "The new generation of Afghans have grown up with freedom of expression, social media and satellite television replete with Bollywood action movies and female news anchors.", "synonym": "abounding"}, {"word": "vilify", "definitionA": "to speak ill of; defame; slander.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To say defamatory things about someone or something; to speak ill of.<br>&nbsp;&nbsp;&nbsp;2. To belittle through speech; to put down.<br>", "etymology": "First recorded in 1400–50; late Middle English word from Late Latin word vīlificāre. See vile, -fy", "example": "Both Irene and Clare are at once the villains and the victims of a society that would force them to choose one existence over another, vilifying Claire’s choices in one breath and praising Irene’s fair skin in the next.", "synonym": "abuse"}, {"word": "feckless", "definitionA": "ineffective; incompetent; futile:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking purpose.<br>&nbsp;&nbsp;&nbsp;2. Without skill, ineffective, incompetent.<br>&nbsp;&nbsp;&nbsp;3. Lacking the courage to act in any meaningful way.<br>&nbsp;&nbsp;&nbsp;4. Lacking vitality.<br>", "etymology": "First recorded in 1590–1600; originally Scots, from feck ( late Middle English ( Scots ) fek, shortened from effeck, Scots form of effect ) + -less", "example": "My “artist formerly known as Bill Cosby” thing feels especially feckless and mealymouthed now.", "synonym": null}, {"word": "forsooth", "definitionA": "(now used in derision or to express disbelief ) in truth; in fact; indeed.", "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Used as an intensifier, often ironic: indeed, really, truthfully.<br>", "etymology": "before 900; Middle English forsothe, Old English forsōth. See for, sooth", "example": "If a man has hired an ox or sheep and a lion has killed it in the open field, that loss is for its owner forsooth.", "synonym": null}, {"word": "googol", "definitionA": "a number that is equal to 1 followed by 100 zeros and expressed as 10 100 .", "definitionB": "&#60;numeral&#62;<br>&nbsp;&nbsp;&nbsp;1. The number 10^{100}, or ten to the power of a hundred.<br>", "etymology": "First recorded in 1935–40; introduced by U.S. mathematician Edward Kasner (1878–1955), whose nine-year-old nephew allegedly invented it", "example": null, "synonym": "cardinal"}, {"word": "piffle", "definitionA": "nonsense, as trivial or senseless talk.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense, foolish talk.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act or speak in a futile, ineffective, or nonsensical manner.<br>&nbsp;&nbsp;&nbsp;2. To waste, to fritter away.<br>&nbsp;&nbsp;&nbsp;3. To be squeamish or delicate.<br>", "etymology": "First recorded in 1840–50; perhaps akin to puff", "example": "Despite the best efforts of the Gowers family, the towers of piffle have continued to climb ever higher.", "synonym": "balderdash"}, {"word": "asylum", "definitionA": "(especially formerly) an institution for the maintenance and care of the mentally ill, orphans, or other persons requiring specialized assistance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A place of safety.<br>&nbsp;&nbsp;&nbsp;2. The protection, physical and legal, afforded by such a place.<br>&nbsp;&nbsp;&nbsp;3. A place of protection or restraint for one or more classes of the disadvantaged, especially the mentally ill.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Latin, from Greek ásȳlon “sanctuary,” from a- a- 6 + sŷlon “right of seizure”", "example": "The agreements require that migrants who travel from other countries through Guatemala, El Salvador, and Honduras to reach the US-Mexico border must first apply for asylum in one of those three countries, before applying for asylum in the US.", "synonym": "cover"}, {"word": "sage", "definitionA": "a profoundly wise person; a person famed for wisdom.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A wise person or spiritual teacher; someone of gravity and wisdom, especially, a teacher venerable for years, and of sound judgment and prudence; a grave or stoic philosopher.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Wise.<br>&nbsp;&nbsp;&nbsp;2. Grave; serious; solemn<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The plant Salvia officinalis and savory spice produced from it; also planted for ornamental purposes.<br>&nbsp;&nbsp;&nbsp;2. Any plant in the genus Salvia<br>&nbsp;&nbsp;&nbsp;3. Any of a number of plants such as sagebrush considered to be similar to Salvia officinalis, mostly because they are small shrubs and have gray foliage or are aromatic.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of using the word or option sage in the email field or a checkbox of an imageboard when posting a reply.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Word used in the email field of imageboards to prevent a bump of the post. Used as an option rather than a word in some imageboard software.<br>", "etymology": "First recorded in 1250–1300; Middle English, from Old French, from Vulgar Latin sapius (unattested), from Latin sap(ere) “to taste, have taste, smell, smell of; to have sense, discern, know, be wise” + -idus; sapient, -id 4", "example": "In his book Kook, Peter Heller is told by one sage surfer that it’s not something you pick up in a year but a “life path.”", "synonym": "contemplative"}, {"word": "receptacle", "definitionA": "a container, device, etc., that receives or holds something:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A container.<br>&nbsp;&nbsp;&nbsp;2. The part of the flower stalk (peduncle or pedicel) to which the floral parts are attached; a thalamus, a torus.<br>&nbsp;&nbsp;&nbsp;3. A structure at the end of a branch of an alga containing conceptacles (reproductive organs).<br>&nbsp;&nbsp;&nbsp;4. An organ that receives and holds a secretion.<br>&nbsp;&nbsp;&nbsp;5. A contact device installed at an outlet for the connection of an attachment plug (typically by receiving the plug's prongs) to supply portable appliances or equipment.<br>", "etymology": "1375–1425; Middle English (< Old French ) < Latin receptāculum reservoir, equivalent to receptā ( re ) to take again, receive back (frequentative of recipere to receive ) + -culum -cle 2", "example": "Which causes all of the caterpillars to fall out of the hedge and into your receptacles.", "synonym": "bowl"}, {"word": "emancipate", "definitionA": "to free from restraint, influence, or the like.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To set free from the power of another; to liberate; as:<br>&nbsp;&nbsp;&nbsp;2. To free from any controlling influence, especially from anything which exerts undue or evil influence<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Freed; set at liberty.<br>", "etymology": "First recorded in 1615–25; from Latin ēmancipātus (past participle of ēmancipāre ) “freed from control,” equivalent to ē- “out of, from” ( e- 1 ) + man(us) “hand” + -cip- (combining form of capere “to seize”) + -ātus past participle suffix ( -ate 1 )", "example": "In the utopian vision, technology emancipates human labor from repetitive, mundane tasks, freeing us to be more productive and take on more fulfilling work.", "synonym": "affranchise"}, {"word": "conveyance", "definitionA": "the act of conveying; transmission; communication.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act or instance of conveying.<br>&nbsp;&nbsp;&nbsp;2. A means of transporting, especially a vehicle.<br>&nbsp;&nbsp;&nbsp;3. An instrument transferring title of an object from one person or group of persons to another.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To transfer (the title) of an object from one person or group of persons to another.<br>", "etymology": "First recorded in 1495–1505; convey + -ance", "example": "Drivers, bicyclists, and pedestrians may quibble over who’s the worst, but for now many seem united in their contempt for the new wave of e-assisted conveyances, in the same way the People’s Front of Judea despised the Judean People’s Front.", "synonym": "car"}, {"word": "fawn", "definitionA": "a young deer, especially an unweaned one.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A young deer.<br>&nbsp;&nbsp;&nbsp;2. A pale brown colour tinted with yellow, like that of a fawn.<br>&nbsp;&nbsp;&nbsp;3. The young of an animal; a whelp.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give birth to a fawn.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of the fawn colour.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A servile cringe or bow.<br>&nbsp;&nbsp;&nbsp;2. Base flattery.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To exhibit affection or attempt to please.<br>&nbsp;&nbsp;&nbsp;2. To seek favour by flattery and obsequious behaviour (with on or upon).<br>&nbsp;&nbsp;&nbsp;3. (of a dog) To show devotion or submissiveness by wagging its tail, nuzzling, licking, etc.<br>", "etymology": "1225–75; Middle English fawn, foun < Middle French faon, foun, feon ≪ Vulgar Latin *fētōn-, stem of *fētō offspring, derivative of Latin fētus fetus", "example": "A fawn, which is basically a mammalian daddy longlegs, scrambles to its feet, falls, stands, and falls again.", "synonym": "yearling"}, {"word": "feck", "definitionA": "slang. a variant of fuck", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Effect, value; vigor.<br>&nbsp;&nbsp;&nbsp;2. The greater or larger part.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To throw.<br>&nbsp;&nbsp;&nbsp;2. To steal.<br>&nbsp;&nbsp;&nbsp;3. To leave hastily.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Fuck.<br>", "etymology": "C15 (Scottish dialect) fek , short for effect", "example": "Maist feck o' them disna ken what liberal principles is, but they like the word.", "synonym": null}, {"word": "litigious", "definitionA": "of or relating to litigation.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to litigation.<br>&nbsp;&nbsp;&nbsp;2. Inclined to engage in lawsuits.<br>&nbsp;&nbsp;&nbsp;3. Argumentative or combative.<br>", "etymology": "1350–1400; Middle English < Latin lītigiōsus contentious, equivalent to lītigi ( um ) a quarrel ( litigant, -ium ) + -ōsus -ous", "example": "Trash hauling contracts are highly regulated, complex, detailed and potentially litigious animals.", "synonym": null}, {"word": "stud", "definitionA": "a boss, knob, nailhead, or other protuberance projecting from a surface or part, especially as an ornament.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A male animal, especially a stud horse (stallion), kept for breeding.<br>&nbsp;&nbsp;&nbsp;2. A female animal, especially a studmare (broodmare), kept for breeding.<br>&nbsp;&nbsp;&nbsp;3. (also by extension) A group of such animals.<br>&nbsp;&nbsp;&nbsp;4. An animal (usually livestock) that has been registered and is retained for breeding.<br>&nbsp;&nbsp;&nbsp;5. A place, such as a ranch, where such animals are kept.<br>&nbsp;&nbsp;&nbsp;6. A sexually attractive male; also a lover in great demand.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small object that protrudes from something; an ornamental knob.<br>&nbsp;&nbsp;&nbsp;2. (jewelry) A small round earring.<br>&nbsp;&nbsp;&nbsp;3. A vertical post, especially one of the small uprights in the framing for lath and plaster partitions, and furring, and upon which the laths are nailed.<br>&nbsp;&nbsp;&nbsp;4. A stem; a trunk.<br>&nbsp;&nbsp;&nbsp;5. A type of poker where an individual cannot throw cards away and some of her cards are exposed (also stud poker).<br>&nbsp;&nbsp;&nbsp;6. A short rod or pin, fixed in and projecting from something, and sometimes forming a journal.<br>&nbsp;&nbsp;&nbsp;7. A stud bolt.<br>&nbsp;&nbsp;&nbsp;8. An iron brace across the shorter diameter of the link of a chain cable.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To set with studs; to furnish with studs.<br>&nbsp;&nbsp;&nbsp;2. To be scattered over the surface of (something) at intervals.<br>&nbsp;&nbsp;&nbsp;3. To set (something) over a surface at intervals.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who studies or learns about a particular subject.<br>&nbsp;&nbsp;&nbsp;2. A person who is formally enrolled at a school, a college or university, or another educational institution.<br>", "etymology": "First recorded before 900; Middle English stod(e), stud(e), “upright post; ornamental knob,” Old English stod, studu “stake, post”; cognate with Middle High German stud, Old Norse stoth “pillar, post, support”", "example": "The Festival’s virtual programming will include powerful daytime interactive sessions and star-studded evening concerts and connections.", "synonym": "beam"}, {"word": "lynchpin", "definitionA": "a variant of linchpin.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pin inserted through holes at the end of an axle or shaft, so as to secure a wheel or shaft-mounted device.<br>&nbsp;&nbsp;&nbsp;2. A central cohesive source of stability and security; a person or thing that is critical to a system or organisation.<br>", "etymology": null, "example": "The RGA’s statement didn’t even congratulate him on his victory in a state that both parties see as a lynchpin to winning the presidency in 2024.", "synonym": null}]