[{"word": "sot", "definitionA": "a habitual drinker of alcohol who is frequently intoxicated.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Stupid person; fool<br>&nbsp;&nbsp;&nbsp;2. Drunkard<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drink until one becomes drunk<br>&nbsp;&nbsp;&nbsp;2. To stupefy; to infatuate; to besot.<br>", "etymology": "First recorded before 1000; Middle English: “fool,” Old English sott, from Medieval Latin sottus; further origin unknown", "example": null, "synonym": "alcoholic"}, {"word": "soot", "definitionA": "a black, carbonaceous substance produced during incomplete combustion of coal, wood, oil, etc., rising in fine particles and adhering to the sides of the chimney or pipe conveying the smoke: also conveyed in the atmosphere to other locations.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Fine black or dull brown particles of amorphous carbon and tar, produced by the incomplete combustion of coal, oil etc.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cover or dress with soot.<br>", "etymology": "before 900; Middle English; Old English sōt; cognate with Old Norse sōt", "example": null, "synonym": "ashes"}, {"word": "sod", "definitionA": "a section cut or torn from the surface of grassland, containing the matted roots of grass.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. That stratum of the surface of the soil which is filled with the roots of grass, or any portion of that surface; turf; sward.<br>&nbsp;&nbsp;&nbsp;2. Turf grown and cut specifically for the establishment of lawns.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cover with sod.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Sodomite; bugger.<br>&nbsp;&nbsp;&nbsp;2. (mildly pejorative, formerly considered vulgar) A person, usually male; often qualified with an adjective.<br>&nbsp;&nbsp;&nbsp;3. Any trifling amount, a bugger, a damn, a jot.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Bugger; sodomize.<br>&nbsp;&nbsp;&nbsp;2. Damn, curse, confound.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Expression of surprise, contempt, outrage, disgust, boredom, frustration.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To boil.<br>&nbsp;&nbsp;&nbsp;2. (of a liquid) To boil vigorously.<br>&nbsp;&nbsp;&nbsp;3. (of a liquid) To foam in an agitated manner, as if boiling.<br>&nbsp;&nbsp;&nbsp;4. (of a person) To be in an agitated or angry mental state, as if boiling.<br>&nbsp;&nbsp;&nbsp;5. (of a place) To buzz with activity.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A damper (bread) which has failed to rise, remaining a flat lump.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Boiled.<br>&nbsp;&nbsp;&nbsp;2. (of bread) Sodden; incompletely risen.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The rock dove.<br>", "etymology": "First recorded in 1475–1525; late Middle English sod(de), from Middle Dutch or Middle Low German sode “turf”", "example": null, "synonym": "grass"}, {"word": "talisman", "definitionA": "a stone, ring, or other object, engraved with figures or characters supposed to possess occult powers and worn as an amulet or charm.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A magical object providing protection against ill will, or the supernatural, or conferring the wearer with a boon such as good luck, good health, or power(s).<br>", "etymology": "First recorded in 1630–40; from French talisman, Spanish talismán or other Romance language, from Arabic ṭilasm, from Late Greek télesmon “completion, performance, consecrated object,” from Greek télesma “payment, payment to be made, outlay, expense,” a derivative of teleîn “to complete, perform” + -ma noun suffix of result. The final -n in the western Europen languages is unexplained.", "example": null, "synonym": "fetish"}, {"word": "quant", "definitionA": "Business Slang. an expert in quantitative analysis.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quantitative analyst.<br>&nbsp;&nbsp;&nbsp;2. Short for quantity.<br>&nbsp;&nbsp;&nbsp;3. Short for quantifier.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Short for quantifiable.<br>&nbsp;&nbsp;&nbsp;2. Short for quantitative.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A punting pole with a broad flange near the end to prevent it from sinking into the mud; a setting pole.<br>&nbsp;&nbsp;&nbsp;2. A vertical shaft used to drive a millstone.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To propel using a quant.<br>", "etymology": "An Americanism dating back to 1985–90; by clipping", "example": null, "synonym": "brain"}, {"word": "blip", "definitionA": "Also called  pip. Electronics.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To emit one or more bleeps.<br>&nbsp;&nbsp;&nbsp;2. To edit out inappropriate spoken language in a broadcast by replacing offending words with bleeps.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small dot registered on electronic equipment, such as a radar or oscilloscope screen.<br>&nbsp;&nbsp;&nbsp;2. A short sound of a single pitch, usually electronically generated.<br>&nbsp;&nbsp;&nbsp;3. (by extension) A brief and usually minor aberration or deviation from what is expected or normal.<br>&nbsp;&nbsp;&nbsp;4. An individual message or document in the Google Wave software framework.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To change state abruptly, such as between off and on or dark and light, sometimes implying motion.<br>", "etymology": "1890–95, for an earlier sense; sound symbolism, with p for brevity and abrupt end of the impulse; bl- perhaps from blink", "example": null, "synonym": "censor"}, {"word": "eureka", "definitionA": "(initial capital letter) I have found (it): the reputed exclamation of Archimedes when, after long study, he discovered a method of detecting the amount of alloy mixed with the gold in the crown of the king of Syracuse.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An alloy of copper and nickel whose resistivity is constant over a wide temperature range<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An exclamation indicating sudden discovery.<br>", "etymology": "1560–70; < Greek heúrēka, 1st person singular perfect indicative of heurískein to find, discover", "example": null, "synonym": "abruptness"}, {"word": "facetious", "definitionA": "not meant to be taken seriously or literally:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Treating serious issues with (often deliberately) inappropriate humour; flippant.<br>&nbsp;&nbsp;&nbsp;2. Pleasantly humorous; jocular.<br>", "etymology": "First recorded in 1585–95; from Middle French facecieux, facetieux, from facetie “a jest,” from Latin facētia “a jest, witticism” ( facetiae ) + -ious", "example": "“And I’m not being facetious, like just bring extra underwear,” he said.", "synonym": null}, {"word": "imbue", "definitionA": "to impregnate or inspire, as with feelings, opinions, etc.:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wet or stain an object completely with some physical quality.<br>&nbsp;&nbsp;&nbsp;2. In general, to act in a way which results in an object becoming completely permeated or impregnated by some quality.<br>", "etymology": "First recorded in 1545–55, imbue is from the Latin word imbuere “to wet, drench”", "example": "Love is revolutionary and imbues people with the power to do incredible things.", "synonym": "bathe"}, {"word": "squelch", "definitionA": "to strike or press with crushing force; crush down; squash.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A squelching sound.<br>&nbsp;&nbsp;&nbsp;2. (radio technology) The suppression of the unwanted hiss or static between received transmissions by adjusting the gain of the receiver.<br>&nbsp;&nbsp;&nbsp;3. A heavy blow or fall.<br>&nbsp;&nbsp;&nbsp;4. A kind of electronic beat used in acid house and related music genres.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To halt, stop, eliminate, stamp out, or put down, often suddenly or by force<br>&nbsp;&nbsp;&nbsp;2. (radio technology) to suppress the unwanted hiss or static between received transmissions by adjusting a threshold level for signal strength, below which the signal is suppressed by applying a gain of zero, and above which a positive (and linear from zero) gain is applied.<br>&nbsp;&nbsp;&nbsp;3. To make a sucking, splashing noise as when walking on muddy ground<br>&nbsp;&nbsp;&nbsp;4. To walk or step through a substance such as mud<br>", "etymology": "1610–20; variant of quelch in same sense (perhaps blend of quell and quash ); initial s perhaps from squash 1", "example": "Vice President Kamala Harris, foremost among the possibilities, has done nothing publicly to either stoke or squelch speculation she might hop in after leaving office later this month.", "synonym": "censure"}]