[{"word": "contiguous", "definitionA": "touching; in contact.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Connected; touching; abutting.<br>&nbsp;&nbsp;&nbsp;2. Adjacent; neighboring.<br>&nbsp;&nbsp;&nbsp;3. Connecting without a break.<br>", "etymology": "First recorded in 1605–15; from Latin contiguus “touching, bordering upon,“ equivalent to prefix con- “with, together” + tig- (variant stem of -tingere, combining form of tangere “to touch”) + -uus adjective suffix; con-, tangent, contingent, contact; -ous, continuous", "example": "Specifically, it cut requirements that members be elected in single districts and that those districts be contiguous and compact, serving relatively equal-sized populations.", "synonym": null}, {"word": "flurry", "definitionA": "a light, brief shower of snow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A light, brief snowfall.<br>&nbsp;&nbsp;&nbsp;2. A sudden and brief blast or gust; a light, temporary breeze.<br>&nbsp;&nbsp;&nbsp;3. A shower of dust, leaves etc. brought on by a sudden gust of wind.<br>&nbsp;&nbsp;&nbsp;4. Any sudden activity; a stir.<br>&nbsp;&nbsp;&nbsp;5. A snack consisting of soft ice cream mixed with small pieces of fruit, cookie crumbs, etc.<br>&nbsp;&nbsp;&nbsp;6. The violent spasms of a dying whale.<br>&nbsp;&nbsp;&nbsp;7. An occurrence of something (countable instances) in large numbers, happening suddenly or in a short period of time.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To agitate, bewilder, fluster.<br>&nbsp;&nbsp;&nbsp;2. To move or fall in a flurry.<br>", "etymology": "1680–90, Americanism; blend of flutter and hurry", "example": "That said, some spotty light snow showers or flurries are possible anywhere in the region during the day Friday, but accumulating, steady snow is not expected.", "synonym": "ado"}, {"word": "spatter", "definitionA": "to scatter or dash in small particles or drops:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A spray or shower of droplets hitting a surface.<br>&nbsp;&nbsp;&nbsp;2. A spot or spots of a substance spattered on a surface.<br>&nbsp;&nbsp;&nbsp;3. The sound of droplets hitting a surface.<br>&nbsp;&nbsp;&nbsp;4. A burst or series of sounds resembling the sound of droplets hitting a surface.<br>&nbsp;&nbsp;&nbsp;5. A collection of objects scattered like droplets splashed onto a surface.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To splash (someone or something) with small droplets.<br>&nbsp;&nbsp;&nbsp;2. To cover, or lie upon (something) by having been scattered, as if by splashing.<br>&nbsp;&nbsp;&nbsp;3. To distribute (a liquid) by sprinkling; to sprinkle around.<br>&nbsp;&nbsp;&nbsp;4. To send out or disperse (something) as if in droplets.<br>&nbsp;&nbsp;&nbsp;5. To send out small droplets; to splash in small droplets (on or against something).<br>&nbsp;&nbsp;&nbsp;6. To injure by aspersion; to defame.<br>", "etymology": "1575–85; perhaps < Dutch spatt ( en ) to splash + -er 6; compare Dutch spatterig literally, spattery", "example": "Blood spatter was reportedly found on the bed, and a Playboy magazine alongside it.", "synonym": "bespatter"}, {"word": "propensity", "definitionA": "a natural inclination or tendency:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An inclination, disposition, tendency, preference, or attraction.<br>", "etymology": "First recorded in 1560–70; propense + -ity", "example": "Alpha-ketoacids drew their attention because of “their stability in water and their propensity to form carbon-carbon bonds, the skeleton of biology,” Springsteen said.", "synonym": "ability"}, {"word": "skedaddle", "definitionA": "to run away hurriedly; flee.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of running away; a scurrying off.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move or run away quickly.<br>&nbsp;&nbsp;&nbsp;2. To spill; to scatter.<br>", "etymology": "1860–65, Americanism; compare dial. ( Scots, N England) skedaddle to spill, scatter, skiddle to move away quickly", "example": "Skedaddle onto the equally heart-stopping Million Dollar Highway to Ouray and Telluride.", "synonym": "blow"}, {"word": "endemic", "definitionA": "natural to or characteristic of a specific people or place; native; indigenous:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An individual or species that is endemic to a region.<br>&nbsp;&nbsp;&nbsp;2. A disease affecting a number of people simultaneously, so as to show a distinct connection with certain localities.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Native to a particular area or culture; originating where it occurs.<br>&nbsp;&nbsp;&nbsp;2. (especially of plants and animals) Peculiar to a particular area or region; not found in other places.<br>&nbsp;&nbsp;&nbsp;3. (especially of diseases) Prevalent in a particular area or region.<br>", "etymology": "First recorded in 1655–65; from New Latin endēmicus, equivalent to Greek éndēm(os) “dwelling in a place, native, (of disease) endemic” (from en- “within, in” + dêm(os) “people, district”) + Latin -icus adjective suffix; en- 2, deme, -ic", "example": "Hart does his best to establish that brashness was endemic to the company from the beginning, starting with its co-founder, Bill Bowerman.", "synonym": "autochthonal"}, {"word": "broach", "definitionA": "Machinery. an elongated, tapered, serrated cutting tool for shaping and enlarging holes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A series of chisel points mounted on one piece of steel. For example, the toothed stone chisel shown here.<br>&nbsp;&nbsp;&nbsp;2. A broad chisel for stone-cutting.<br>&nbsp;&nbsp;&nbsp;3. A spit for cooking food.<br>&nbsp;&nbsp;&nbsp;4. An awl; a bodkin; also, a wooden rod or pin, sharpened at each end, used by thatchers.<br>&nbsp;&nbsp;&nbsp;5. A spire rising from a tower.<br>&nbsp;&nbsp;&nbsp;6. A spit-like start on the head of a young stag.<br>&nbsp;&nbsp;&nbsp;7. The stick from which candle wicks are suspended for dipping.<br>&nbsp;&nbsp;&nbsp;8. The pin in a lock which enters the barrel of the key.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a hole in, especially a cask of liquor, and put in a tap in order to draw the liquid.<br>&nbsp;&nbsp;&nbsp;2. To open, to make an opening into; to pierce.<br>&nbsp;&nbsp;&nbsp;3. To begin discussion about (something).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A piece of women’s ornamental jewellery having a pin allowing it to be fixed to garments worn on the upper body.<br>&nbsp;&nbsp;&nbsp;2. A painting all of one colour, such as a sepia painting.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be turned sideways to oncoming waves, especially large or breaking waves.<br>&nbsp;&nbsp;&nbsp;2. To cause to turn sideways to oncoming waves, especially large or breaking waves (usually followed by to; also figurative).<br>", "etymology": "1175–1225; (noun) Middle English broche < Anglo-French, Old French < Vulgar Latin *brocca spike, horn, tap of a cask ( Medieval Latin broca ), noun use of feminine of Latin adj. brocc ( h ) us projecting (said of teeth); (v.) Middle English brochen < Old French broch ( i ) er, derivative of the noun", "example": "Gaga wanted us to pay attention, and she did it by pinching and stretching other words throughout the anthem, as well as donning a spectacular outfit, which included a golden dove broach that appeared to be life size.", "synonym": "advance"}, {"word": "abyss", "definitionA": "a deep, immeasurable space, gulf, or cavity; vast chasm.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Hell; the bottomless pit; primeval chaos; a confined subterranean ocean.<br>&nbsp;&nbsp;&nbsp;2. (frequently figurative) A bottomless or unfathomed depth, gulf, or chasm; hence, any deep, immeasurable; any void space.<br>&nbsp;&nbsp;&nbsp;3. Anything infinite, immeasurable, or profound.<br>&nbsp;&nbsp;&nbsp;4. Moral depravity; vast intellectual or moral depth.<br>&nbsp;&nbsp;&nbsp;5. An impending catastrophic happening.<br>&nbsp;&nbsp;&nbsp;6. The center of an escutcheon.<br>&nbsp;&nbsp;&nbsp;7. The abyssal zone.<br>&nbsp;&nbsp;&nbsp;8. A difference, especially a large difference, between groups.<br>", "etymology": "First recorded in 1350–1400; Middle English abissus, from Late Latin abyssus, from Greek ábyssos “bottomless,” equivalent to a- a- 6 + byssós “bottom of the sea”", "example": "Such dark matter, a vast abyss, is evidence of a viral world we must come to understand better.", "synonym": "abysm"}, {"word": "gorge", "definitionA": "a narrow cleft with steep, rocky walls, especially one through which a stream runs.", "definitionB": "No definition found", "etymology": "First recorded in 1325–75; (verb) Middle English, from Old French gorger, derivative of gorge “throat,” from unattested Vulgar Latin gorga, akin to Latin gurguliō “gullet, throat,” gurges “whirlpool, eddy”", "example": "While the national-preservation status of the majority of the gorge is a concession to local hunters, the group is slated to lose roughly 4,000 acres of hunting grounds in the Lower Gorge with the new designation.", "synonym": "abyss"}, {"word": "destitute", "definitionA": "without means of subsistence; lacking food, clothing, and shelter.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (followed by the preposition \"of\") Lacking something; devoid<br>&nbsp;&nbsp;&nbsp;2. Lacking money; poor, impoverished<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To impoverish; to strip of wealth, resources, etc.<br>", "etymology": "1350–1400; Middle English < Latin dēstitūtus (past participle of dēstituere to abandon, deprive of support), equivalent to dē- de- + stit- place, put (combining form of statuere; statute ) + -ū- thematic vowel + -tus past participle suffix", "example": "He’s married and settled down, he’s earned awards from the likes of the US National Academy of Medicine, and he’s not a destitute grad student anymore.", "synonym": null}]