[{"word": "disinter", "definitionA": "to take out of the place of interment; exhume; unearth.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take out of the grave or tomb.<br>&nbsp;&nbsp;&nbsp;2. To bring out, as from a grave or hiding place; to bring from obscurity into view.<br>", "etymology": "First recorded in 1605–15; dis- 1 + inter", "example": "The Department of Defense had undertaken the arduous task of disinterring and sorting through the commingled skeletons.", "synonym": "expose"}, {"word": "guttural", "definitionA": "of or relating to the throat.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A harsh and throaty spoken sound<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sounding harsh and throaty.<br>&nbsp;&nbsp;&nbsp;2. Articulated at the back of the mouth.<br>&nbsp;&nbsp;&nbsp;3. Of, relating to, or connected to the throat.<br>", "etymology": "1585–95; < New Latin gutturālis of the throat, equivalent to Latin guttur gullet, throat + -ālis -al 1", "example": "The guttural roar which greeted her winning crosscourt forehand on match point indicated Raducanu's satisfaction, as did the beaming smile across her face as she handed out high fives to the whole British team afterwards.", "synonym": "grating"}, {"word": "gobbledegook", "definitionA": "language characterized by circumlocution and jargon, usually hard to understand:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense; meaningless or encrypted language.<br>&nbsp;&nbsp;&nbsp;2. Something written in an overly complex, incoherent, or incomprehensible manner.<br>", "etymology": "First recorded in 1940–45; fanciful formation from gobble 2", "example": "Mr Brookes said the writing within the letters was \"gobbledegook, gibberish\".", "synonym": "abracadabra"}, {"word": "rebuff", "definitionA": "a blunt or abrupt rejection, as of a person making advances.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sudden resistance or refusal.<br>&nbsp;&nbsp;&nbsp;2. Repercussion, or beating back.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To refuse; to offer sudden or harsh resistance; to turn down or shut out.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To buff again.<br>", "etymology": "1580–90; < Middle French rebuffer < Italian ribuffare to disturb, reprimand, derivative of ribuffo (noun), equivalent to ri- re- + buffo puff; buffoon", "example": "Newsom has rebuffed those entreaties, and the White House seems no closer to making any significant moves forward.", "synonym": "check"}, {"word": "pervert", "definitionA": "to affect with perversion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who has been perverted; one who has turned to error; one who has turned to a twisted sense of values or morals.<br>&nbsp;&nbsp;&nbsp;2. A person whose sexual habits are not considered acceptable.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To turn another way; to divert.<br>&nbsp;&nbsp;&nbsp;2. To corrupt; to cause to be untrue; corrupted or otherwise impure<br>&nbsp;&nbsp;&nbsp;3. To misapply, misuse, use for a nefarious purpose<br>&nbsp;&nbsp;&nbsp;4. To misinterpret designedly.<br>&nbsp;&nbsp;&nbsp;5. To become perverted; to take the wrong course.<br>", "etymology": "First recorded in 1300–50; (for the verb) Middle English perverten, from Latin pervertere “to overturn, subvert,” from per- per- + vertere “to turn”; (for the noun) noun use of obsolete pervert “perverted”", "example": "\"I've spent my entire career trying to help consumers, and these criminals, thieves, organised crime people have perverted my reputation,\" he say on his BBC Sounds podcast.", "synonym": "debauchee"}, {"word": "conducive", "definitionA": "tending to produce; contributive; helpful; favorable (usually followed by to ):", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tending to contribute to, encourage, or bring about some result.<br>", "etymology": "First recorded in 1640–50; conduce + -ive", "example": "Former England scrum-half Matt Dawson, meanwhile, says England's personnel on the bench have not been conducive to continuity in their approach.", "synonym": null}, {"word": "eke", "definitionA": "to increase; enlarge; lengthen.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (obsolete except Britain) An addition.<br>&nbsp;&nbsp;&nbsp;2. A small stand on which a beehive is placed.<br>&nbsp;&nbsp;&nbsp;3. A spacer put between or over or under hive parts to make more space: see http//www.dave-cushman.net/bee/eke.html<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Chiefly in the form eke out: to add to, to augment; to increase; to lengthen.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Also; in addition to.<br>", "etymology": "before 1000; Middle English eken, Old English ēac ( i ) an (intransitive), derivative of ēaca (noun) increase; Middle English echen, Old English ēcan, variant of īecan (transitive) < West Germanic *aukjan; both akin to Old Norse auka, Gothic aukan, Latin augēre, Greek auxánein to increase, amplify", "example": "Candidate quality matters, too: A strong campaigner like Riggs can eke out a victory through moving, personal appeals to voters who are mostly tuned out from politics.", "synonym": null}, {"word": "irk", "definitionA": "to irritate, annoy, or exasperate:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To irritate; annoy; bother<br>", "etymology": "1300–50; Middle English irken to grow tired, tire < Old Norse yrkja to work, cognate with Old English wyrcan; work", "example": "Indeed, McMahon seemed irked at the thought that Raw Story was trying to pull a fast one.", "synonym": "abrade"}, {"word": "expugnable", "definitionA": "able to be overcome, conquered, defeated, etc.", "definitionB": "No definition found", "etymology": "1560–70; < Latin expugnābilis, equivalent to expugnā ( re ) to take by storm ( ex- ex- 1 + pugnāre to fight) + -bilis -ble", "example": null, "synonym": null}, {"word": "victual", "definitionA": "victuals, food supplies; provisions.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Food fit for human consumption.<br>&nbsp;&nbsp;&nbsp;2. (in the plural) Food supplies; provisions.<br>&nbsp;&nbsp;&nbsp;3. Grain of any kind.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To provide with food; to provision.<br>&nbsp;&nbsp;&nbsp;2. To lay in food supplies.<br>&nbsp;&nbsp;&nbsp;3. To eat.<br>", "etymology": "First recorded in 1275–1325; Middle English vitaille, from Anglo-French, Middle French vitail(l)e, Old French vituaille, from Late Latin victuālia “provisions,” noun use of neuter plural of Latin victuālis “pertaining to food,” equivalent to victu(s) “nourishment, way of living” ( vic-, variant stem of vīvere “to live” + -tus suffix of verb action) + -ālis -al 1; modern spelling from Latin", "example": "When it’s in the hands of cinematic chef and film critic Justin Chang, the visual victuals can be sumptuous.", "synonym": "eatable"}]