[{"word": "deduce", "definitionA": "to derive as a conclusion from something known or assumed; infer:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To reach a conclusion by applying rules of logic to given premises.<br>&nbsp;&nbsp;&nbsp;2. To take away; to deduct; to subtract.<br>&nbsp;&nbsp;&nbsp;3. (Latinism) To lead forth.<br>", "etymology": "First recorded in 1520–30; from Latin dēdūcere “to lead down, derive,” from dē- de- + dūcere “to lead”", "example": "Estimating the number of missed outbursts, the astronomers deduced the yearly nova rate.", "synonym": "analyze"}, {"word": "breve", "definitionA": "Phonetics, Orthography. a diacritic (˘) over a vowel to show that it is short, or to indicate a specific pronunciation, as ŭ in (kŭt) cut.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A semicircular diacritical mark (˘) placed above a vowel, commonly used to mark its quantity as short.<br>&nbsp;&nbsp;&nbsp;2. A double whole note.<br>&nbsp;&nbsp;&nbsp;3. Any writ or precept under seal, issued out of any court.<br>&nbsp;&nbsp;&nbsp;4. The great ant thrush of Sumatra (Pitta gigas), which has a very short tail.<br>", "etymology": "1250–1300; Middle English < Medieval Latin, Latin breve, neuter of brevis short; brief", "example": "Combinations such as (y with breve and macron) or (o with under-dot and macron) may not display as intended in all browsers.", "synonym": null}, {"word": "brevity", "definitionA": "shortness of time or duration; briefness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality of being brief in duration.<br>&nbsp;&nbsp;&nbsp;2. Succinctness; conciseness.<br>&nbsp;&nbsp;&nbsp;3. A short piece of writing.<br>", "etymology": "First recorded in 1500–10; from Anglo-French brevite, Old French brievete, from briev(e), feminine of brief brief + -ete -ity", "example": "We humans living on our one planet wring our hands about the brevity of our lives and our mortal restraints, but we do not often think about how improbable it is to be alive at all.", "synonym": "conciseness"}, {"word": "brief", "definitionA": "lasting or taking a short time; of short duration:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A writ summoning one to answer to any action.<br>&nbsp;&nbsp;&nbsp;2. An answer to any action.<br>&nbsp;&nbsp;&nbsp;3. A memorandum of points of fact or of law for use in conducting a case.<br>&nbsp;&nbsp;&nbsp;4. (by extension) A position of interest or advocacy.<br>&nbsp;&nbsp;&nbsp;5. An attorney's legal argument in written form for submission to a court.<br>&nbsp;&nbsp;&nbsp;6. (English law) The material relevant to a case, delivered by a solicitor to the barrister who tries the case.<br>&nbsp;&nbsp;&nbsp;7. A short news story or report.<br>&nbsp;&nbsp;&nbsp;8. (usually in the plural) undershorts briefs.<br>&nbsp;&nbsp;&nbsp;9. A summary, précis or epitome; an abridgement or abstract.<br>&nbsp;&nbsp;&nbsp;10. A letter patent, from proper authority, authorizing a collection or charitable contribution of money in churches, for any public or private purpose.<br>&nbsp;&nbsp;&nbsp;11. (slang) A ticket of any type.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To summarize a recent development to some person with decision-making power.<br>&nbsp;&nbsp;&nbsp;2. To write a legal argument and submit it to a court.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of short duration; happening quickly.<br>&nbsp;&nbsp;&nbsp;2. Concise; taking few words.<br>&nbsp;&nbsp;&nbsp;3. Occupying a small distance, area or spatial extent; short.<br>&nbsp;&nbsp;&nbsp;4. Rife; common; prevalent.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Briefly.<br>&nbsp;&nbsp;&nbsp;2. Soon; quickly.<br>", "etymology": "First recorded in 1250–1300; Middle English bref, from Anglo-French, Old French, from Latin brevis “short”; breve", "example": "As they moved down the street, Harris waved, held her hand to her heart, and bumped elbows and had brief conversations with several onlookers.", "synonym": "bluff"}, {"word": "clinch", "definitionA": "to settle (a matter) decisively:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of several fastenings.<br>&nbsp;&nbsp;&nbsp;2. The act or process of holding fast; that which serves to hold fast; a grip or grasp.<br>&nbsp;&nbsp;&nbsp;3. A pun.<br>&nbsp;&nbsp;&nbsp;4. A hitch or bend by which a rope is made fast to the ring of an anchor, or the breeching of a ship's gun to the ringbolts.<br>&nbsp;&nbsp;&nbsp;5. A passionate embrace.<br>&nbsp;&nbsp;&nbsp;6. In combat sports, the act of one or both fighters holding onto the other to prevent being hit or engage in standup grappling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To clasp; to interlock.<br>&nbsp;&nbsp;&nbsp;2. To make certain; to finalize.<br>&nbsp;&nbsp;&nbsp;3. To fasten securely or permanently.<br>&nbsp;&nbsp;&nbsp;4. To bend and hammer the point of (a nail) so it cannot be removed.<br>&nbsp;&nbsp;&nbsp;5. To embrace passionately.<br>&nbsp;&nbsp;&nbsp;6. To hold firmly; to clench.<br>&nbsp;&nbsp;&nbsp;7. To set closely together; to close tightly.<br>", "etymology": "First recorded in 1560–70; later variant of Middle English clench", "example": "Notably, a 6-turn clinch knot and a 5-turn improved clinch also came in at 96%, but only if they were tied with extreme care.", "synonym": "confirm"}, {"word": "lieu", "definitionA": "place; stead.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Place, stead; See in lieu or in lieu of<br>", "etymology": "First recorded in 1250–1300; from Middle French, from Latin locus “place”; replacing Middle English liue, from Old French liu, from Latin; locus", "example": "In fitness, we embraced regular leisure walks in lieu of trendy fitness classes.", "synonym": "stead"}, {"word": "stead", "definitionA": "the place of a person or thing as occupied by a successor or substitute:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A place, or spot, in general.<br>&nbsp;&nbsp;&nbsp;2. A place where a person normally rests; a seat.<br>&nbsp;&nbsp;&nbsp;3. An inhabited place; a settlement, city, town etc.<br>&nbsp;&nbsp;&nbsp;4. An estate, a property with its grounds; a farm.<br>&nbsp;&nbsp;&nbsp;5. The frame on which a bed is laid; a bedstead.<br>&nbsp;&nbsp;&nbsp;6. (in phrases) The position or function (of someone or something), as taken on by a successor.<br>&nbsp;&nbsp;&nbsp;7. An emotional or circumstantial \"place\" having specified advantages, qualities etc. (now only in phrases).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To help, support, benefit or assist; to be helpful or noteful.<br>&nbsp;&nbsp;&nbsp;2. To fill stead or place of.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One's partner in a romantic relationship.<br>", "etymology": "before 900; (noun) Middle English, Old English stede; cognate with German Stätte place; akin to German Stadt, Old Norse stathr, Gothic staths, Greek stásis ( stasis ); (v.) Middle English steden, derivative of the noun", "example": "Water Authority board members can designate other members agency to vote in their stead – as a proxy – if they’re absent.", "synonym": "footing"}, {"word": "midriff", "definitionA": "diaphragm ( def 1 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The middle section of the human torso, from below the chest to above the waist<br>", "etymology": "before 1000; Middle English mydryf, Old English midhrif, equivalent to mid ( d ) mid 1 + hrif belly", "example": "The piece’s top is covered with hivelike ceramic tiles and balanced above an impossibly tiny midriff on stinger-like legs.", "synonym": "bowels"}, {"word": "folderol", "definitionA": "mere nonsense; foolish talk or ideas.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense or foolishness.<br>&nbsp;&nbsp;&nbsp;2. A decorative object of little value; a trifle or gewgaw.<br>", "etymology": "First recorded in 1695–1705 and 1820–25  folderol fordef 2; originally as a nonsense refrain in songs; of obscure origin", "example": "Men and women of good intent who simply seek “the truth” upon which to base their opinions find themselves awash in folderol.", "synonym": null}, {"word": "carrion", "definitionA": "dead and putrefying flesh.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Dead flesh; carcasses.<br>&nbsp;&nbsp;&nbsp;2. A contemptible or worthless person.<br>", "etymology": "1175–1225; Middle English caroyne, careyn, carion < Anglo-French careine, Old French charo ( i ) gne < Vulgar Latin *caronia, equivalent to Latin carun- ( caruncle ) + -ia -y 3", "example": "Many herbivores will opportunistically scarf down carrion for protein, Gerlach says.", "synonym": "body"}]