[{"word": "fetus", "definitionA": "(used chiefly of viviparous mammals) the young of an animal in the womb or egg, especially in the later stages of development when the body structures are in the recognizable form of its kind, in humans after the end of the second month of gestation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An unborn or unhatched vertebrate showing signs of the mature animal.<br>&nbsp;&nbsp;&nbsp;2. A human embryo after the eighth week of gestation.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin fētus “bringing forth of young,” hence “that which is born, offspring, young still in the womb,” equivalent to fē- (verb base attested in Latin only in noun derivatives, as fēmina “woman,” fēcundus “fertile,” fīlius “son,” fīlia “daughter,” etc.; compare Greek thēsthai “to suck, milk,” Old High German tāan “to suck,” Old Irish denid “(he) sucks,” Slavic (Polish) doić “to milk” + -tus suffix of verb action; fecund", "example": "The incident happened at Hamad international airport in Doha earlier this month after a fetus was discovered in an airport bathroom.", "synonym": "blastosphere"}, {"word": "embryo", "definitionA": "the young of a viviparous animal, especially of a mammal, in the early stages of development within the womb, in humans up to the end of the second month. Compare fetus.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. In the reproductive cycle, the stage after the fertilization of the egg that precedes the development into a fetus.<br>&nbsp;&nbsp;&nbsp;2. An organism in the earlier stages of development before it emerges from the egg, or before metamorphosis.<br>&nbsp;&nbsp;&nbsp;3. In viviparous animals, the young animal's earliest stages in the mother's body<br>&nbsp;&nbsp;&nbsp;4. In humans, usually the cell growth up to the end of the seventh week in the mother's body<br>&nbsp;&nbsp;&nbsp;5. A rudimentary plant contained in the seed.<br>&nbsp;&nbsp;&nbsp;6. The beginning; the first stage of anything.<br>", "etymology": "First recorded in 1580–90; from Medieval Latin embryo, embryon-, from Greek émbryon, noun use of neuter of émbryos “ingrowing,” equivalent to em- “in” + bry- (stem of brýein “to swell”) + -os adjective suffix; em- 2", "example": "A female-founded Israeli startup called Embryonics is setting out to change this by using artificial intelligence to screen embryos.", "synonym": "egg"}, {"word": "punter", "definitionA": "a person who punts a boat", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who bets (punts) against the bank.<br>&nbsp;&nbsp;&nbsp;2. One who oars or poles a punt (pontoon).<br>&nbsp;&nbsp;&nbsp;3. One who punts a football.<br>&nbsp;&nbsp;&nbsp;4. One who gambles. See speculator.<br>&nbsp;&nbsp;&nbsp;5. A customer of a commercial establishment, frequently of a pub or (alternatively) of a prostitute.<br>&nbsp;&nbsp;&nbsp;6. A beginner or unskilled climber.<br>&nbsp;&nbsp;&nbsp;7. The person who keeps score in basset or ombre.<br>&nbsp;&nbsp;&nbsp;8. A program used to forcibly disconnect another user from a network.<br>", "etymology": null, "example": "The clip below, of Mayall hamming it up when he realises a punter is filming him at a charity auction, is a classic.", "synonym": null}, {"word": "dodgy", "definitionA": "inclined to dodge.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Evasive and shifty<br>&nbsp;&nbsp;&nbsp;2. Unsound and unreliable<br>&nbsp;&nbsp;&nbsp;3. Dishonest<br>&nbsp;&nbsp;&nbsp;4. Risky<br>&nbsp;&nbsp;&nbsp;5. Deviant<br>&nbsp;&nbsp;&nbsp;6. Uncomfortable and weird<br>", "etymology": "First recorded in 1860–65; dodge + -y 1", "example": "When in 1803 Jefferson unconstitutionally bought Louisiana from Napoleon using a dodgy British loan, neither the Senate nor the Supreme Court stopped him.", "synonym": "chancy"}, {"word": "purport", "definitionA": "to present, especially deliberately, the appearance of being; profess or claim, often falsely:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Import, intention or purpose<br>&nbsp;&nbsp;&nbsp;2. Disguise; covering<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To convey, imply, or profess outwardly (often falsely).<br>&nbsp;&nbsp;&nbsp;2. (construed with to) To intend.<br>", "etymology": "First recorded in 1375–1425; (verb) late Middle English purporten, from Anglo-French purporter “to mean, signify,” Old French porporter “to carry, convey,” equivalent to pur- pro- 1 + porter “to carry” (from Latin portāre ); (noun) late Middle English, from Anglo-French, derivative of the verb", "example": "Ukrainian government intercepts also purport to reveal Ukrainian separatists acknowledging they controlled SA-11 systems.", "synonym": "acceptation"}, {"word": "credo", "definitionA": "(often initial capital letter) the Apostles' Creed or the Nicene Creed.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A belief system.<br>&nbsp;&nbsp;&nbsp;2. The liturgical creed (usually the Nicene Creed), or a musical arrangement of it for use in church services.<br>", "etymology": "1150–1200; Middle English < Latin: literally, I believe; first word of the Apostles' and Nicene Creeds in Latin", "example": "The unwavering credo of the reducetarian movement may well be “inclusivity” of different philosophical views.", "synonym": "code"}, {"word": "zealous", "definitionA": "full of, characterized by, or due to zeal; ardently active, devoted, or diligent.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Full of zeal; ardent, fervent; exhibiting enthusiasm or strong passion.<br>", "etymology": "First recorded in 1520–30; from Medieval Latin zēlōsus; zeal, -ous", "example": "Rather, I understood such zealous procedures as necessary security precautions.", "synonym": null}, {"word": "berth", "definitionA": "a shelflike sleeping space, as on a ship, airplane, or railroad car.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fixed bunk for sleeping (in caravans, trains, etc).<br>&nbsp;&nbsp;&nbsp;2. Room for maneuvering or safety. (Often used in the phrase a wide berth.)<br>&nbsp;&nbsp;&nbsp;3. A space for a ship to moor or a vehicle to park.<br>&nbsp;&nbsp;&nbsp;4. A room in which a number of the officers or ship's company mess and reside.<br>&nbsp;&nbsp;&nbsp;5. A job or position, especially on a ship.<br>&nbsp;&nbsp;&nbsp;6. Position or seed in a tournament bracket.<br>&nbsp;&nbsp;&nbsp;7. Position on the field of play<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bring (a ship or vehicle) into its berth<br>", "etymology": "First recorded in 1615–25; probably equivalent to bear 1 + -th 1", "example": "Then to close out the season, Washington returns home for meetings with Rivera’s old team, the Panthers, and the Seattle Seahawks, before heading to Philadelphia with possibly a playoff berth on the line.", "synonym": "anchorage"}, {"word": "cuss", "definitionA": "to use profanity; curse; swear.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A curse.<br>&nbsp;&nbsp;&nbsp;2. A curse word.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use cursing, to use bad language, to speak profanely.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fellow, person.<br>", "etymology": "An Americanism first recorded in 1765–75; variant of curse, with loss of r and shortening of vowel, as in ass 2, bass 2, passel, etc.", "example": "If Republicans win big, Democrats will hang their heads and cuss the Koch brothers.", "synonym": "blasphemy"}, {"word": "bosh", "definitionA": "absurd or foolish talk; nonsense.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Nonsense.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of disbelief or annoyance.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The lower part of a blast furnace, between the hearth and the stack.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A figure.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of speedy and satisfactory completion of a simple or straightforward task.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To consume (illicit drugs).<br>", "etymology": "1830–35; < Turkish boş empty; popularized from its use in the novel Ayesha (1834) by British author James J. Morier (1780–1849)", "example": "“Somebody had to break the ice,” Bosh, whose own sexuality has been questioned in recent years, says.", "synonym": "bull"}, {"word": "abecedarian", "definitionA": "a person who is learning the letters of the alphabet.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who is learning the alphabet.<br>&nbsp;&nbsp;&nbsp;2. An elementary student, a novice; one in the early steps of learning.<br>&nbsp;&nbsp;&nbsp;3. Someone engaged in teaching the alphabet; an elementary teacher; one that teaches the methods and principles of learning.<br>&nbsp;&nbsp;&nbsp;4. A work which uses words or lines in alphabetical order.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to someone learning the alphabet or basic studies; elementary; rudimentary.<br>&nbsp;&nbsp;&nbsp;2. Pertaining to the alphabet, or several alphabets.<br>&nbsp;&nbsp;&nbsp;3. Arranged in an alphabetical manner.<br>&nbsp;&nbsp;&nbsp;4. Relating to or resembling an abecedarius.<br>", "etymology": "First recorded in 1595–1605; from Medieval Latin abecedāriānus; abecedary, -an", "example": "Perry had 123 kids from 104 families; the number in Abecedarian was even smaller.", "synonym": "amateur"}, {"word": "punt", "definitionA": "Football.  a kick in which the ball is dropped and then kicked before it touches the ground. Compare drop kick, place kick.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pontoon; a narrow shallow boat propelled by a pole.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To propel a punt or similar craft by means of a pole.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A kick made by a player who drops the ball and kicks it before it hits the ground.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dropkick; to kick something a considerable distance.<br>&nbsp;&nbsp;&nbsp;2. To equivocate and delay or put off (answering a question, addressing an issue, etc).<br>&nbsp;&nbsp;&nbsp;3. To retreat from one's objective; to abandon an effort one still notionally supports.<br>&nbsp;&nbsp;&nbsp;4. To make the best choice from a set of non-ideal alternatives.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A point in the game of faro.<br>&nbsp;&nbsp;&nbsp;2. The act of playing at basset, baccara, faro, etc.<br>&nbsp;&nbsp;&nbsp;3. A bet or wager.<br>&nbsp;&nbsp;&nbsp;4. Gambling, as a pastime, especially betting on horseraces or the dogs.<br>&nbsp;&nbsp;&nbsp;5. A highly speculative investment or other commitment.<br>&nbsp;&nbsp;&nbsp;6. A wild guess.<br>&nbsp;&nbsp;&nbsp;7. An indentation in the base of a wine bottle.<br>&nbsp;&nbsp;&nbsp;8. A thin glass rod which is temporarily attached to a larger piece in order to better manipulate the larger piece.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To play at basset, baccara, faro, etc.<br>&nbsp;&nbsp;&nbsp;2. To stake against the bank, to back a horse, to gamble or take a chance more generally<br>&nbsp;&nbsp;&nbsp;3. To make a highly speculative investment or other commitment, or take a wild guess.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The Irish pound, used as the unit of currency of Ireland until it was replaced by the euro in 2002.<br>", "etymology": "First recorded before 1000; 1835–45  punt 1fordef 1; Old English: “flat-bottomed boat” (not attested in Middle English ), from Latin pontō “pontoon, punt” ( pontoon 1none ); the sense “to kick a dropped ball” comes perhaps via the semse “to propel (a boat) by shoving”", "example": "His critics complained that too often, it meant run, run, pass on third down and either move the chains or punt.", "synonym": "boot"}, {"word": "transpontine", "definitionA": "across or beyond a bridge.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, relating to, or situated on the far side of a bridge.<br>&nbsp;&nbsp;&nbsp;2. Of or relating to the sensational melodramas presented on the south side of the Thames in the 19th century or earlier.<br>", "etymology": "1835–45; trans- + Latin pont- (stem of pōns ) bridge + -ine 1", "example": "And he strode along with the air of the heavy man in a transpontine melodrama.", "synonym": null}]
