[{"word": "exonerate", "definitionA": "to clear, as of an accusation; free from guilt or blame; exculpate:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To relieve (someone or something) of a load; to unburden (a load).<br>&nbsp;&nbsp;&nbsp;2. Of a body of water: to discharge or empty (itself).<br>&nbsp;&nbsp;&nbsp;3. To free from an obligation, responsibility or task.<br>&nbsp;&nbsp;&nbsp;4. To free from accusation or blame.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Freed from an obligation; freed from accusation or blame; acquitted, exonerated.<br>", "etymology": "First recorded in 1515–25; late Middle English, from Latin exonerātus (past participle of exonerāre “to unburden, discharge”), equivalent to ex- “out of, from; thoroughly” + oner- (stem of onus ) “a burden” + -ātus past participle suffix; ex- 1, -ate 1", "example": "Perlin said the science has been “tested and shown to be reliable” and pointed out that TrueAllele has recently been used to help exonerate some falsely accused defendants.", "synonym": "disburden"}, {"word": "extrapolate ", "definitionA": "to infer (an unknown) from something that is known; conjecture.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To infer by extending known information.<br>&nbsp;&nbsp;&nbsp;2. To estimate the value of a variable outside a known range from values within that range by assuming that the estimated value follows logically from the known ones<br>", "etymology": "irst recorded in 1825–35; extra- + (inter)polate", "example": "The study used data collected from 11 states to extrapolate rates for the US as a whole.", "synonym": "anticipate"}, {"word": "presbyter", "definitionA": "(in the early Christian church) an office bearer who exercised teaching, priestly, and administrative functions.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A priest or minister in various churches.<br>&nbsp;&nbsp;&nbsp;2. An elder of the Presbyterian church.<br>&nbsp;&nbsp;&nbsp;3. An elder of the congregation in early Christianity.<br>", "etymology": "1590–1600; < Late Latin, noun use of the adj.: older < Greek presbýteros, equivalent to présby ( s ) old + -teros comparative suffix", "example": "The larger cubiculum has two tufa seats at the side, and one more elevated for the presiding presbyter.", "synonym": null}, {"word": "psephology", "definitionA": "the study of elections.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The predictive or statistical study of elections.<br>&nbsp;&nbsp;&nbsp;2. An ancient Greek method of numerology, similar to gematria.<br>", "etymology": "First recorded in 1945–50; from Greek psêpho(s) “pebble” + -logy; so called from the Athenian custom of casting votes by means of pebbles", "example": null, "synonym": null}, {"word": "psephomancy", "definitionA": "Divination by drawing pebbles from a pile.", "definitionB": "No definition found", "etymology": "From New Latin psēphomantia, from Ancient Greek ψῆφος (psêphos, “pebble used for casting a vote”), +‎ -mancy.", "example": null, "synonym": null}, {"word": "conviviality", "definitionA": "a friendly or agreeable quality:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The state of being convivial<br>&nbsp;&nbsp;&nbsp;2. A jovial spirit or activity<br>", "etymology": "convivial ( def ) + -ity ( def )", "example": "Every time I make it, I’m reminded of all the aiolis I’ve served and been served, the far away friends I miss, and the conviviality of sharing a meal around the same table, at last, again.", "synonym": "entertainment"}, {"word": "bowl", "definitionA": "a rather deep, round dish or basin, used chiefly for holding liquids, food, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A roughly hemispherical container used to hold, mix or present food, such as salad, fruit or soup, or other items.<br>&nbsp;&nbsp;&nbsp;2. As much as is held by a bowl.<br>&nbsp;&nbsp;&nbsp;3. A dish comprising a mix of different foods, not all of which need be cooked, served in a bowl.<br>&nbsp;&nbsp;&nbsp;4. A haircut in which straight hair is cut at an even height around the edges, forming a bowl shape.<br>&nbsp;&nbsp;&nbsp;5. The round hollow part of anything.<br>&nbsp;&nbsp;&nbsp;6. A round crater (or similar) in the ground.<br>&nbsp;&nbsp;&nbsp;7. An elliptical-shaped stadium or amphitheater resembling a bowl.<br>&nbsp;&nbsp;&nbsp;8. A postseason football competition, a bowl game (i.e. Rose Bowl, Super Bowl)<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The ball rolled by players in the game of lawn bowls.<br>&nbsp;&nbsp;&nbsp;2. The action of bowling a ball.<br>&nbsp;&nbsp;&nbsp;3. (in the plural, but used with a singular verb) The game of bowls.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To roll or throw (a ball) in the correct manner in cricket and similar games and sports.<br>&nbsp;&nbsp;&nbsp;2. To throw the ball (in cricket and similar games and sports).<br>&nbsp;&nbsp;&nbsp;3. To roll or carry smoothly on, or as on, wheels.<br>&nbsp;&nbsp;&nbsp;4. To pelt or strike with anything rolled.<br>", "etymology": "First recorded before 950; Middle English bolle, Old English bolla; cognate with Old Norse bolli; boll", "example": "When the marketing guy decided to work from his dining room because it “helped him think” to be able to pour himself a bowl of Lucky Charms cereal whenever he felt the urge, he didn’t have to get permission from management.", "synonym": "boat"}, {"word": "swoosh", "definitionA": "to move with or make a rustling, swirling, or brushing sound.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A swooshing movement or sound<br>&nbsp;&nbsp;&nbsp;2. A pattern or logo suggesting a swooshing movement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move with a rushing or swirling sound<br>", "etymology": "First recorded in 1865–70; imitative", "example": "Sure, I’d rather have Carolina wrens, with their swoosh like that of goth eye makeup, but the Carolina wrens that flitted around our yard in the spring apparently found it wanting and moved on.", "synonym": "agitate"}, {"word": "complicit", "definitionA": "choosing to be involved in an illegal or questionable act, especially with others; having complicity.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Associated with or participating in an activity, especially one of a questionable nature.<br>", "etymology": "First recorded in 1855–60; back formation from complicity", "example": "With his support, Reagan took action against terrorists and the states that sponsored them, including the bombing of Libya in 1986 after it was found complicit in the bombing of a Berlin disco in which two American servicemen died.", "synonym": "deceitful"}, {"word": "cusp", "definitionA": "a point that marks the beginning of a change:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sharp point or pointed end.<br>&nbsp;&nbsp;&nbsp;2. An important moment when a decision is made that will determine future events.<br>&nbsp;&nbsp;&nbsp;3. A point of a curve where the curve is continuous but has no derivative, but such that it has a derivative at every nearby point.<br>&nbsp;&nbsp;&nbsp;4. A point made by the intersection of two curved lines or curved structures, a common motif in Gothic architecture.<br>&nbsp;&nbsp;&nbsp;5. A boundary between zodiacal signs and houses.<br>&nbsp;&nbsp;&nbsp;6. Any of the pointed parts of a canine tooth or molar.<br>&nbsp;&nbsp;&nbsp;7. A flap of a valve of a heart or blood vessel.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To behave in a reckless or dangerous manner.<br>", "etymology": "First recorded in 1575–85, from Latin cuspis “a point”", "example": "The People’s Bank of China is on the cusp of launching a digital yuan, which many believe will help China weaken the influence of the greenback in global trade.", "synonym": "angle"}]