[{"word": "bequeath", "definitionA": "to dispose of (personal property, especially money) by last will:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give or leave by will; to give by testament.<br>&nbsp;&nbsp;&nbsp;2. To hand down; to transmit.<br>&nbsp;&nbsp;&nbsp;3. To give; to offer; to commit.<br>", "etymology": "First recorded before 1000; Middle English bequethen, Old English becwethan ( be- be- + cwethan “to say” ( quoth ), cognate with Old High German quedan, Gothic qithan )", "example": "With an estimated worth of $60 million, Goldberg said in a spring episode that she plans to bequeath it all to her daughter, Alexandrea Martin.", "synonym": "commit"}, {"word": "analphabet", "definitionA": "a person who cannot read or write; illiterate.", "definitionB": "No definition found", "etymology": "First recorded in 1660–70; back formation from analphabetic", "example": "And of the Mohammedan population nearly all the women are analphabet.", "synonym": null}, {"word": "parole", "definitionA": "the conditional release of a person from prison prior to the end of the maximum sentence imposed.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The release of a former prisoner under condition of compliance with specific terms.<br>&nbsp;&nbsp;&nbsp;2. The amount of time a former prisoner spends on limited release.<br>&nbsp;&nbsp;&nbsp;3. A word of honor, especially given by a prisoner of war, to not engage in combat if released.<br>&nbsp;&nbsp;&nbsp;4. Language in use, as opposed to language as a system.<br>&nbsp;&nbsp;&nbsp;5. (immigration law) The permission for a foreigner who does not meet the technical requirements for a visa to be allowed to enter the U.S. on humanitarian grounds.<br>&nbsp;&nbsp;&nbsp;6. A watchword given only to officers of guards; distinguished from the countersign, which is given to all guards.<br>&nbsp;&nbsp;&nbsp;7. An oral declaration; see parol.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To release (a prisoner) on the understanding that s/he checks in regularly and obeys the law.<br>", "etymology": "First recorded in 1610–20; from Middle French, short for parole d'honneur “word of honor”. See parol", "example": "TPS holders who were given parole or never placed in removal proceedings are in the \"best shape\" even though, without status, they'll have to figure out their next steps, Nemecek explained.", "synonym": "free"}, {"word": "edentate", "definitionA": "belonging or pertaining to the Edentata, an order of New World mammals characterized by the absence of incisors and canines in the arrangement of teeth and comprising the armadillos, the sloths, and the South American anteaters.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any mammal that has few or no teeth, but especially the anteaters, armadillos, and sloths of the former order Edentata.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking teeth.<br>&nbsp;&nbsp;&nbsp;2. Belonging to the Edentata.<br>", "etymology": "First recorded in 1820–30; from Latin ēdentātus, past participle of ēdentāre “to knock the teeth out”; equivalent to ē- variant of ex- “out of” + dent- (stem of dēns ) “tooth” + -ātus past participle ending of first conjugation verbs; e- 1, tooth, -ate 1", "example": "One of several species of edentates and monotremes that feed upon ants.", "synonym": "aardvark"}, {"word": "desolate", "definitionA": "barren or laid waste; devastated:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deprive of inhabitants.<br>&nbsp;&nbsp;&nbsp;2. To devastate or lay waste somewhere.<br>&nbsp;&nbsp;&nbsp;3. To abandon or forsake something.<br>&nbsp;&nbsp;&nbsp;4. To make someone sad, forlorn and hopeless.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Deserted and devoid of inhabitants.<br>&nbsp;&nbsp;&nbsp;2. Barren and lifeless.<br>&nbsp;&nbsp;&nbsp;3. Made unfit for habitation or use because of neglect, destruction etc.<br>&nbsp;&nbsp;&nbsp;4. Dismal or dreary.<br>&nbsp;&nbsp;&nbsp;5. Sad, forlorn and hopeless.<br>", "etymology": "First recorded in 1325–75; Middle English, from Latin dēsōlātus “forsaken,” past participle of dēsōlāre, from dē- de- + sōlāre “to make lonely” (derivative of sōlus sole 1 )", "example": "Once bustling with city employees — and residents needing city services — these few blocks lying in the shadow of City Hall have been made desolate by telecommuting options and online access to municipal departments.", "synonym": "abandoned"}, {"word": "collation", "definitionA": "the act of collating.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Bringing together.<br>&nbsp;&nbsp;&nbsp;2. Discussion, light meal.<br>&nbsp;&nbsp;&nbsp;3. The presentation of a clergyman to a benefice by a bishop, who has it in his own gift.<br>&nbsp;&nbsp;&nbsp;4. (inheritance) The blending together of property so as to achieve equal division, mainly in the case of inheritance.<br>&nbsp;&nbsp;&nbsp;5. (inheritance) An heir's right to combine the whole heritable and movable estates of the deceased into one mass, sharing it equally with others who are of the same degree of kindred.<br>&nbsp;&nbsp;&nbsp;6. The act of conferring or bestowing.<br>&nbsp;&nbsp;&nbsp;7. Presentation to a benefice.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To partake of a collation, or light meal.<br>", "etymology": "First recorded in 1175–1225; Middle English collacion, from Anglo-French, from Medieval Latin collātiōn-, stem of collātiō “placement together, combination”; equivalent to collate + -ion", "example": "They all matched those on the collation sheet the BBC had obtained.", "synonym": "comparison"}, {"word": "castellan", "definitionA": "the governor of a castle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The governor or caretaker of a castle or keep.<br>", "etymology": "1350–1400; < Medieval Latin castellānus (noun) governor, occupant of a castle, (adj.) of a castle ( Latin: of a fortress), equivalent to castell ( um ) castellum, castle + -ānus -an; replacing Middle English castelain < Old North French < Latin, as above", "example": "“The heat warnings are out in parts of BC and the Northwest Territories, and we do see that continuing for the foreseeable future with very extreme or anomalous heat in both Yukon and NWT and even a lot of the western parts of Nunavut,” said Armel Castellan, a warning preparedness meteorologist with Environment and Climate Change Canada.", "synonym": null}, {"word": "altercate", "definitionA": "to argue or quarrel with zeal, heat, or anger; wrangle.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To argue, quarrel or wrangle.<br>", "etymology": "1530–40; < Latin altercātus (past participle of altercārī to quarrel), equivalent to *alterc ( us ) a disputing ( alter other + -cus formative suffix) + -ātus -ate 1", "example": "Starting in order of the home team that has the least letters in their name, it's the battle of the As as anxious Arsenal altercate against atrocious Aston Villa.", "synonym": "bandy"}, {"word": "gymnastic", "definitionA": "of or relating to physical exercises that develop and demonstrate strength, balance, and agility, especially such exercises performed mostly on special equipment.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A gymnast.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to gymnastics.<br>&nbsp;&nbsp;&nbsp;2. Pertaining to the gymnasia (ancient Greek schools).<br>", "etymology": "1565–75; < Middle French gymnastique < Latin gymnasticus < Greek gymnastikós, equivalent to gymnáz ( ein ) ( gymnasium 1 ) + -tikos -tic", "example": "In the UK and abroad, there have been major controversies in football, swimming and gymnastics clubs, where allegations of physical, sexual and emotional abuse have been made against coaches by young athletes.", "synonym": null}, {"word": "plagiarize", "definitionA": "to take and use by plagiarism.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use, and pass off as one's own, someone else's writing, speech, ideas, or other intellectual or creative work, especially in an academic context; to commit plagiarism.<br>", "etymology": "First recorded in 1710–20; plagiar(ism) + -ize", "example": "When she refused, they copied the post to a blogging website, backdated it, and then claimed she had plagiarized it in an example of copyright infringement.", "synonym": "appropriate"}, {"word": "glitter", "definitionA": "to reflect light with a brilliant, sparkling luster; sparkle with reflected light.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bright, sparkling light; shininess or brilliance.<br>&nbsp;&nbsp;&nbsp;2. A shiny, decorative adornment, sometimes sprinkled on glue to make simple artwork.<br>&nbsp;&nbsp;&nbsp;3. Glitz.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sparkle with light; to shine with a brilliant and broken light or showy luster; to gleam.<br>&nbsp;&nbsp;&nbsp;2. To be showy, specious, or striking, and hence attractive.<br>", "etymology": "First recorded in 1300–50; Middle English, from Old Norse glitra; compare Old English glitenian, German gleissen “to shine, glitter”", "example": "An original pair of red glitter slippers worn by Judy Garland in the famous film The Wizard of Oz are going on display in central London.", "synonym": "beam"}, {"word": "swag", "definitionA": "a suspended wreath, garland, drapery, or the like, fastened up at or near each end and hanging down in the middle; festoon.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (window coverings) A loop of draped fabric.<br>&nbsp;&nbsp;&nbsp;2. A low point or depression in land; especially, a place where water collects.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To (cause to) sway.<br>&nbsp;&nbsp;&nbsp;2. To droop; to sag.<br>&nbsp;&nbsp;&nbsp;3. To decorate (something) with loops of draped fabric.<br>&nbsp;&nbsp;&nbsp;4. To install (a ceiling fan or light fixture) by means of a long cord running from the ceiling to an outlet, and suspended by hooks or similar.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Style; fashionable appearance or manner.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (thieves' cant) A shop and its goods; any quantity of goods.<br>&nbsp;&nbsp;&nbsp;2. (thieves' cant) Stolen goods; the booty of a burglar or thief; boodle.<br>&nbsp;&nbsp;&nbsp;3. Handouts, freebies, or giveaways, such as those handed out at conventions.<br>&nbsp;&nbsp;&nbsp;4. The possessions of a bushman or itinerant worker, tied up in a blanket and carried over the shoulder, sometimes attached to a stick.<br>&nbsp;&nbsp;&nbsp;5. (by extension) A small single-person tent, usually foldable into an integral backpack.<br>&nbsp;&nbsp;&nbsp;6. A large quantity (of something).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To travel on foot carrying a swag (possessions tied in a blanket).<br>&nbsp;&nbsp;&nbsp;2. To transport stolen goods.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Initialism of scientific/speculative/sophisticated/stupid wild-ass guess.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (window coverings) A loop of draped fabric.<br>&nbsp;&nbsp;&nbsp;2. A low point or depression in land; especially, a place where water collects.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Style; fashionable appearance or manner.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (thieves' cant) A shop and its goods; any quantity of goods.<br>&nbsp;&nbsp;&nbsp;2. (thieves' cant) Stolen goods; the booty of a burglar or thief; boodle.<br>&nbsp;&nbsp;&nbsp;3. Handouts, freebies, or giveaways, such as those handed out at conventions.<br>&nbsp;&nbsp;&nbsp;4. The possessions of a bushman or itinerant worker, tied up in a blanket and carried over the shoulder, sometimes attached to a stick.<br>&nbsp;&nbsp;&nbsp;5. (by extension) A small single-person tent, usually foldable into an integral backpack.<br>&nbsp;&nbsp;&nbsp;6. A large quantity (of something).<br>", "etymology": "First recorded in 1520–30; perhaps from Scandinavian; compare Norwegian svaga, svagga “to sway, rock”", "example": "At a golf tournament later that year, Nelk members kitted out in Happy Dad swag glad-handed with Trump wearing Happy Dad apparel.", "synonym": "boodle"}, {"word": "probation", "definitionA": "the act of testing.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A period of time when a person occupies a position only conditionally and may easily be removed for poor performance<br>&nbsp;&nbsp;&nbsp;2. A type of sentence where convicted criminals are allowed to continue living in the community but will automatically be sent to jail if they violate certain conditions<br>&nbsp;&nbsp;&nbsp;3. The act of testing; proof<br>", "etymology": "First recorded in 1375–1425; late Middle English probacion, from Latin probātiōn- (stem of probātiō ); probate, -ion", "example": "But probation staff say this week they were told by the government that the backlog of offenders who needed to be tagged had reached \"acceptable levels\".", "synonym": "apprenticeship"}, {"word": "probate", "definitionA": "Law. the official proving of a will as authentic or valid in a probate court.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The legal process of verifying the legality of a will.<br>&nbsp;&nbsp;&nbsp;2. A copy of a legally recognised and qualified will.<br>&nbsp;&nbsp;&nbsp;3. Proof<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To establish the legality of (a will).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A court (tribunal) whose function is to administer estates (property of a decedent) and prove wills<br>", "etymology": "First recorded in 1400–50; late Middle English probat, from Latin probātum “a thing approved,” noun use of neuter past participle of probāre “to examine, test”; prove", "example": "The most appealing part about this is that with these designations you can circumvent the often lengthy and cumbersome probate process.", "synonym": "bequest"}]