[{"word": "manger", "definitionA": "a box or trough in a stable or barn from which horses or cattle eat.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trough for animals to eat from.<br>", "etymology": "1350–1400; Middle English < Middle French maingeure, derivative of mangier to eat < Latin mandūcāre to chew, eat. See manducate", "example": "These look not unlike mini manger scenes, something you’d see in December on the front lawn of a suburban Church of Christ.", "synonym": "Bethlehem"}, {"word": "reel", "definitionA": "a cylinder, frame, or other device that turns on an axis and is used to wind up or pay out something.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A shaky or unsteady gait.<br>&nbsp;&nbsp;&nbsp;2. A lively dance originating in Scotland; also, the music of this dance; often called a Scottish (or Scotch) reel.<br>&nbsp;&nbsp;&nbsp;3. A kind of spool, turning on an axis, on which yarn, threads, lines, or the like, are wound.<br>&nbsp;&nbsp;&nbsp;4. A machine on which yarn is wound and measured into lays and hanks, —-- for cotton or linen it is fifty-four inches in circuit; for worsted, thirty inches.<br>&nbsp;&nbsp;&nbsp;5. A device consisting of radial arms with horizontal stats, connected with a harvesting machine, for holding the stalks of grain in position to be cut by the knives.<br>&nbsp;&nbsp;&nbsp;6. A short compilation of sample film work used as a demonstrative resume in the entertainment industry.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wind on a reel.<br>&nbsp;&nbsp;&nbsp;2. To spin or revolve repeatedly.<br>&nbsp;&nbsp;&nbsp;3. To unwind, to bring or acquire something by spinning or winding something else.<br>&nbsp;&nbsp;&nbsp;4. To walk shakily or unsteadily; to stagger; move as if drunk or not in control of oneself.<br>&nbsp;&nbsp;&nbsp;5. (with back) To back off or step away unsteadily and quickly.<br>&nbsp;&nbsp;&nbsp;6. To make or cause to reel.<br>&nbsp;&nbsp;&nbsp;7. To have a whirling sensation; to be giddy.<br>&nbsp;&nbsp;&nbsp;8. To be in shock.<br>&nbsp;&nbsp;&nbsp;9. To roll.<br>", "etymology": "First recorded before 1050; Middle English noun rel(e), Old English hrēol; rēol, cognate with Old Norse hræll “weaver's rod”; the verb is derivative of the noun", "example": "The men cutting the reel aren’t satisfied because they can’t figure out why Kane’s last word was “Rosebud,” and they send a reporter to go figure it out by interviewing Kane’s former friends and associates.", "synonym": "bob"}, {"word": "deoxyribose", "definitionA": "any of certain carbohydrates derived from ribose by the replacement of a hydroxyl group with a hydrogen atom.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A derivative of the pentose sugar ribose in which the 2' hydroxyl (-OH) is reduced to a hydrogen (H); it is a constituent of the nucleotides that constitute the biopolymer, deoxyribonucleic acid, or DNA.<br>", "etymology": "First recorded in 1930–35; deoxy- + ribose", "example": null, "synonym": null}, {"word": "nuclein", "definitionA": "any of a group of proteins, containing phosphorus, that occur in the nuclei of living cells", "definitionB": "No definition found", "etymology": null, "example": "What about the patient who eats several eggs or consumes a sweetbread or other nuclein-containing articles of diet?", "synonym": null}, {"word": "thorp", "definitionA": "a hamlet; village.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (now chiefly in placenames) A group of houses standing together in the country; a hamlet; a village.<br>", "etymology": "before 900; Middle English, Old English; cognate with German Dorf, Old Norse thorp village, Gothic thaurp field", "example": "Nothing Lasts Forever was written by Roderick Thorp and published in 1979.", "synonym": null}, {"word": "temperance", "definitionA": "moderation or self-restraint in action, statement, etc.; self-control.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Habitual moderation in regard to the indulgence of the natural appetites and passions; restrained or moderate indulgence<br>&nbsp;&nbsp;&nbsp;2. Moderation, and sometimes abstinence, in respect to using intoxicating liquors.<br>&nbsp;&nbsp;&nbsp;3. Moderation of passion<br>&nbsp;&nbsp;&nbsp;4. State with regard to heat or cold; temperature.<br>", "etymology": "1200–50; Middle English temperaunce < Anglo-French < Latin temperantia self-control. See temper, -ance", "example": "Temperance advocates actually won state laws banning alcohol sales starting in the 1840s.", "synonym": "abnegation"}, {"word": "hypothetical", "definitionA": "assumed or entertained as a theoretical possibility, invented example, premise for argument’s sake, etc.; supposed:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hypothetical situation or proposition<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Based upon a hypothesis; conjectural<br>&nbsp;&nbsp;&nbsp;2. Conditional; contingent upon some hypothesis/antecedent<br>", "etymology": "First recorded in 1580–90; from Greek hypothetik(ós) “supposed” ( hypo- hypo- + the- “placed, put,” base of tithénai “to place, put, set”) + -tikos -tic ) + -al 1", "example": "Many were unwilling to bear the present-day cost of preparing for future hypotheticals.", "synonym": "academic"}, {"word": "critter", "definitionA": "a domesticated animal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually affectionate) A creature, an animal.<br>", "etymology": "Variant of creature", "example": "Fish, worms, crickets, and many other critters are safe for human consumption.", "synonym": "being"}, {"word": "arthropod", "definitionA": "any invertebrate of the phylum Arthropoda, having a segmented body, jointed limbs, and usually a chitinous shell that undergoes moltings, including the insects, spiders and other arachnids, crustaceans, and myriapods.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An invertebrate animal of the phylum Arthropoda, characterized by a chitinous exoskeleton and multiple jointed appendages<br>", "etymology": "1875–80; < New Latin Arthropoda; arthro-, -pod", "example": "Scientists find an increase in the overall numbers of arthropods in the Arctic, but a decline in diversity.", "synonym": "arachnid"}, {"word": "budge", "definitionA": "to move slightly; begin to move:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move.<br>&nbsp;&nbsp;&nbsp;2. To move.<br>&nbsp;&nbsp;&nbsp;3. To yield in one’s opinions or beliefs.<br>&nbsp;&nbsp;&nbsp;4. (Minnesota, Wisconsin, Iowa) To cut or butt (in line); to join the front or middle rather than the back of a queue.<br>&nbsp;&nbsp;&nbsp;5. To try to improve the spot of a decision on a sports field.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Brisk; stirring; jocund.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A kind of fur prepared from lambskin dressed with the wool on, formerly used as an edging and ornament, especially on scholastic habits.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Austere or stiff, like scholastics<br>", "etymology": "1580–90; < Anglo-French, Middle French bouger to stir < Vulgar Latin *bullicāre to bubble, frequentative of Latin bullīre; boil 1", "example": "The cost per transistor—which once fell at the same exponential rate that transistor density increased—hasn’t budged for more than three generations of chipmaking.", "synonym": "change"}]