[{"word": "snub", "definitionA": "to treat with disdain or contempt, especially by ignoring.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A deliberate affront or slight.<br>&nbsp;&nbsp;&nbsp;2. A sudden checking of a cable or rope.<br>&nbsp;&nbsp;&nbsp;3. A knot; a protuberance; a snag.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To slight, ignore or behave coldly toward someone.<br>&nbsp;&nbsp;&nbsp;2. To turn down; to dismiss.<br>&nbsp;&nbsp;&nbsp;3. To check; to reprimand.<br>&nbsp;&nbsp;&nbsp;4. To stub out (a cigarette etc).<br>&nbsp;&nbsp;&nbsp;5. To halt the movement of a rope etc by turning it about a cleat or bollard etc; to secure a vessel in this manner.<br>&nbsp;&nbsp;&nbsp;6. To clip or break off the end of; to check or stunt the growth of.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Conspicuously short.<br>&nbsp;&nbsp;&nbsp;2. Of the nose: flat and broad, with the end slightly turned up.<br>&nbsp;&nbsp;&nbsp;3. (of a polyhedron) Derived from a simpler polyhedron by the addition of extra triangular faces.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sob with convulsions.<br>", "etymology": "First recorded in 1300–50; Middle English snubben, from Old Norse snubba “to scold, reprimand”; cognate with Middle Low German snūben", "example": "Brady was snubbed, and didn’t receive a single all-pro vote, either.", "synonym": "burr"}, {"word": "complaisant", "definitionA": "inclined or disposed to please; obliging; agreeable or gracious; compliant:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Compliant.<br>&nbsp;&nbsp;&nbsp;2. Willing to do what pleases others; obliging.<br>&nbsp;&nbsp;&nbsp;3. Polite; showing respect.<br>", "etymology": "1640–50; < French (present participle of complaire ) < Latin complacent- (stem of complacēns, present participle of complacēre; complacent )", "example": "He had received to the peace some complaisant Scots whose lands or dwellings lay on his northward route.", "synonym": null}, {"word": "palatine", "definitionA": "having royal privileges:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feudal lord (a count palatine or Pfalzgraf) or a bishop possessing palatine powers.<br>&nbsp;&nbsp;&nbsp;2. A palace official, especially in an imperial palace; the chief minister.<br>&nbsp;&nbsp;&nbsp;3. A county palatine, a palatinate.<br>&nbsp;&nbsp;&nbsp;4. A resident of a palatinate.<br>&nbsp;&nbsp;&nbsp;5. (in plural) The Roman soldiers of the imperial palace; praetorians.<br>&nbsp;&nbsp;&nbsp;6. A type of shoulder cape for women.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly as postmodifier) Designating a territory in England (and, later, other countries) whose lord had specific royal privileges, or designating a modern administrative area corresponding to such a territory.<br>&nbsp;&nbsp;&nbsp;2. (chiefly as postmodifier) Designating a ruler or feudal lord with direct powers held from the sovereign.<br>&nbsp;&nbsp;&nbsp;3. Pertaining to the Elector Palatine or the German Palatinate or its people.<br>&nbsp;&nbsp;&nbsp;4. Pertaining to a palace, particularly for the Eastern and Western Roman emperors; palatial.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of a pair of bones behind the palate<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to the palate or to a palatine bone<br>", "etymology": "First recorded in 1400–50; late Middle English palatine, paladin, palentine, from Old French palatin, palantien, from Medieval Latin, Latin palātīnus “of the imperial house (on the Palatine hill), imperial”; originally, of the hill Palātium in Rome; palace, palatium -ine 1", "example": "The repetition of her festival may possibly point to separate celebrations of the communities of Palatine and Quirinal.", "synonym": "authorized"}, {"word": "erratic", "definitionA": "deviating from the usual or proper course in conduct or opinion; eccentric:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A rock moved from one location to another, usually by a glacier.<br>&nbsp;&nbsp;&nbsp;2. Anything that has erratic characteristics.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unsteady, random; prone to unexpected changes; not consistent<br>&nbsp;&nbsp;&nbsp;2. Deviating from normal opinions or actions; eccentric; odd.<br>", "etymology": "First recorded in 1325–75; Middle English, from Latin errāticus, equivalent to errāt(us) (past participle of errāre “to make a mistake, err” ( err ) + -icus -ic", "example": "Moreover, snowballing agricultural crises like avian flu and ASF can make meat prices extremely erratic.", "synonym": null}, {"word": "cronyism", "definitionA": "the practice of favoring one's close friends, especially in political appointments.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Favoritism to friends without regard for their qualifications, especially by appointing them to political positions.<br>", "etymology": "First recorded in 1830–40; crony + -ism", "example": "They have cronyism, systemic financial risk, excessive materialism, ecological crisis stemming from overconsumption.", "synonym": "civility"}, {"word": "incandescent", "definitionA": "(of light) produced by incandescence.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An incandescent lamp or bulb<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Emitting light as a result of being heated<br>&nbsp;&nbsp;&nbsp;2. Shining very brightly<br>&nbsp;&nbsp;&nbsp;3. Showing intense emotion, as of a performance, etc.<br>", "etymology": "1785–95; < Latin incandēscent- (stem of incandēscēns ), present participle of incandēscere to glow. See in- 2, candescent", "example": "Some bulbs mimic bright blue daylight, while others try to recreate the warm glow of incandescent bulbs.", "synonym": null}, {"word": "hangry", "definitionA": "feeling irritable or irrationally angry as a result of being hungry.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Hungry and angry, especially when the anger is induced by the hunger.<br>", "etymology": "First recorded in 1915–20; h(ungry) ( def ) + angry ( def )", "example": null, "synonym": null}, {"word": "unbiased", "definitionA": "not biased biased or prejudiced; fair; impartial.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Impartial or without bias or prejudice.<br>", "etymology": "First recorded in 1600–10; un- 1 + biased", "example": "I needed somebody who was unbiased and had an outside perspective to advise on the best way to approach feedback or raising issues.", "synonym": null}, {"word": "ensconce", "definitionA": "to settle securely or snugly:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To place in a secure environment.<br>&nbsp;&nbsp;&nbsp;2. To settle comfortably.<br>", "etymology": "First recorded in 1580–90; en- 1 + sconce 2", "example": "Liselle is still connected to West Philly, however, by her salty mother Verity, who remains ensconced in the old neighborhood and is less than impressed by her daughter’s bourgeois lifestyle.", "synonym": "bury"}, {"word": "abscond", "definitionA": "to depart in a sudden and secret manner, especially to avoid capture and legal prosecution:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To flee, often secretly; to steal away, particularly to avoid arrest or prosecution.<br>&nbsp;&nbsp;&nbsp;2. To withdraw from.<br>&nbsp;&nbsp;&nbsp;3. To evade, to hide or flee from.<br>&nbsp;&nbsp;&nbsp;4. To conceal; to take away.<br>&nbsp;&nbsp;&nbsp;5. To hide, to be in hiding or concealment.<br>", "etymology": "First recorded in 1605–15; from Latin abscondere “to hide or stow away,” equivalent to abs- abs- + condere “to stow” ( con- con- + -dere “to put”; do 1 )", "example": "Girls Night Out is a three-volume series that follows the adventures of a woman with dementia and her friends, who abscond from a nursing home.", "synonym": "bolt"}, {"word": "sconce", "definitionA": "a bracket for candles or other lights, placed on a wall, mirror, picture frame, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fixture for a light.<br>&nbsp;&nbsp;&nbsp;2. A head or a skull.<br>&nbsp;&nbsp;&nbsp;3. A poll tax; a mulct or fine.<br>&nbsp;&nbsp;&nbsp;4. A piece of armor for the head; headpiece; helmet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To impose a fine, a forfeit, or a mulct.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A type of small fort or other fortification, especially as built to defend a pass or ford.<br>&nbsp;&nbsp;&nbsp;2. A hut for protection and shelter; a stall.<br>&nbsp;&nbsp;&nbsp;3. The circular tube, with a brim, in a candlestick, into which the candle is inserted.<br>&nbsp;&nbsp;&nbsp;4. A squinch.<br>&nbsp;&nbsp;&nbsp;5. A fragment of a floe of ice.<br>&nbsp;&nbsp;&nbsp;6. A fixed seat or shelf.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shut within a sconce; to imprison.<br>", "etymology": "First recorded in 1350–1400; Middle English sconce, sconse, from Old French esconce, or directly from Medieval Latin scōnsa, shortening of abscōnsa, noun use of feminine past participle of abscondere “to conceal”; abscond", "example": "The person who cares for things unusual will find the candle sconce made of a cowhorn a suitable fixture for the den.", "synonym": "candelabrum"}, {"word": "stow", "definitionA": "Nautical.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A place, stead.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put something away in a compact and tidy manner, in its proper place, or in a suitable place.<br>&nbsp;&nbsp;&nbsp;2. To store or pack something in a space-saving manner and over a long time.<br>&nbsp;&nbsp;&nbsp;3. To arrange, pack, or fill something tightly or closely.<br>&nbsp;&nbsp;&nbsp;4. To dispose, lodge, or hide somebody somewhere.<br>", "etymology": "1300–50; Middle English stowen, Old English stōwigan to keep, hold back (literally, to place), derivative of stōw place; akin to Old Norse eldstō fireplace, Gothic stojan to judge (literally, to place)", "example": "In college, at the small Gustavus Adolphus College in Minnesota, the seeds stowed since her childhood Boundary Waters journey came roaring back to life.", "synonym": "bundle"}]