[{"word": "honk", "definitionA": "the cry of a goose.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sound produced by a typical car horn.<br>&nbsp;&nbsp;&nbsp;2. The cry of a goose.<br>&nbsp;&nbsp;&nbsp;3. A bad smell.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a car horn.<br>&nbsp;&nbsp;&nbsp;2. To make a loud, harsh sound like a car horn.<br>&nbsp;&nbsp;&nbsp;3. To make the vocal sound of a goose.<br>&nbsp;&nbsp;&nbsp;4. To vomit: regurgitate the contents of one's stomach.<br>&nbsp;&nbsp;&nbsp;5. To have a bad smell.<br>&nbsp;&nbsp;&nbsp;6. To squeeze playfully, usually a breast or nose.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Imitation of car horn, used, for example, to clear a path for oneself.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (racial slur) A Caucasian person.<br>&nbsp;&nbsp;&nbsp;2. A factory hand or general unskilled worker.<br>", "etymology": "An Americanism dating back to 1790–1800; imitative", "example": "It’s a booming track that hurtles brass instrumentals, car honks and metallic clangs at the listener as the members bulldoze their way from beginning to end.", "synonym": "blast"}, {"word": "aberration", "definitionA": "the act of departing from the right, normal, or usual course:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of wandering; deviation from truth, moral rectitude; abnormal; divergence from the straight, correct, proper, normal, or from the natural state.<br>&nbsp;&nbsp;&nbsp;2. The convergence to different foci, by a lens or mirror, of rays of light emanating from one and the same point, or the deviation of such rays from a single focus; a defect in a focusing mechanism that prevents the intended focal point.<br>&nbsp;&nbsp;&nbsp;3. A small periodical change of position in the stars and other heavenly bodies, due to the combined effect of the motion of light and the motion of the observer.<br>&nbsp;&nbsp;&nbsp;4. A partial alienation of reason.<br>&nbsp;&nbsp;&nbsp;5. A mental disorder, especially one of a minor or temporary character.<br>&nbsp;&nbsp;&nbsp;6. Atypical development or structure; deviation from the normal type; an aberrant organ.<br>&nbsp;&nbsp;&nbsp;7. A deviation of a tissue, organ or mental functions from what is considered to be within the normal range.<br>", "etymology": "First recorded in 1585–95; from Latin aberrātiōn-, stem of aberrātiō “distraction, diversion, relief (from pain or sorrow),” from aberrāt(us) “diverted, deviated” (past participle of aberrāre “to divert, forget for a time,” also “to wander, deviate”; aberrant ) + -iō -ion", "example": "They were also an aberration from conventional music industry logic.", "synonym": "delusion"}, {"word": "hew", "definitionA": "to strike forcibly with an ax, sword, or other cutting instrument; chop; hack.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To chop away at; to whittle down; to mow down.<br>&nbsp;&nbsp;&nbsp;2. To shape; to form.<br>&nbsp;&nbsp;&nbsp;3. To act according to, to conform to; usually construed with to.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Hue; colour<br>&nbsp;&nbsp;&nbsp;2. Shape; form<br>&nbsp;&nbsp;&nbsp;3. Destruction by cutting down.<br>", "etymology": "First recorded before 900; Middle English hewen, Old English hēawan; cognate with German hauen, Old Norse hǫggva; akin to haggle", "example": "That system weakened as members of all three branches hewed increasingly to the platforms of the two political parties.", "synonym": "axe"}, {"word": "fusty", "definitionA": "having a stale smell; moldy; musty:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Moldy or musty.<br>&nbsp;&nbsp;&nbsp;2. Stale-smelling or stuffy.<br>&nbsp;&nbsp;&nbsp;3. (by extension) Old-fashioned, refusing to change or update.<br>&nbsp;&nbsp;&nbsp;4. (of wine) Tasting of the cask.<br>", "etymology": "1350–1400; Middle English fusti, equivalent to fust (noun) < Old French: wine cask, tree trunk (< Latin fūstis stick, pole) + -y 1", "example": "While they’ve mostly shed their fusty reputation, documentaries still give the impression of being more nutritious than the average TV treat.", "synonym": null}, {"word": "musty", "definitionA": "having an odor or flavor suggestive of mold, as old buildings, long-closed rooms, or stale food.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a stale odor.<br>", "etymology": "1520–30; perhaps variant of moisty ( Middle English; moist, -y 1 ) with loss of i before s as in master", "example": "The musty Conservative Party of Margaret Thatcher was in decline, to be replaced the following year by the sterile charm of Tony Blair and his New Labour project.", "synonym": null}, {"word": "diatribe", "definitionA": "a bitter, sharply abusive denunciation, attack, or criticism:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An abusive, bitter, attack or criticism: denunciation.<br>&nbsp;&nbsp;&nbsp;2. A prolonged discourse.<br>&nbsp;&nbsp;&nbsp;3. A speech or writing which bitterly denounces something.<br>", "etymology": "1575–85; < Latin diatriba < Greek diatribḗ pastime, study, discourse, derivative of diatríbein to rub away ( dia- dia- + tríbein to rub)", "example": "In its latest diatribe, Amazon spends over six of eight pages on matters wholly irrelevant to the current proceeding or even matters currently before the commission.", "synonym": "abuse"}, {"word": "hallow", "definitionA": "to make holy; sanctify; consecrate.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (obsolete outside set phrases) A saint; a holy person; an apostle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make holy, to sanctify.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A shout, cry; a hulloo.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shout, especially to urge on dogs for hunting.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of something solid) Having an empty space or cavity inside.<br>&nbsp;&nbsp;&nbsp;2. (of a sound) Distant, eerie; echoing, reverberating, as if in a hollow space; dull, muffled; often low-pitched.<br>&nbsp;&nbsp;&nbsp;3. Without substance; having no real or significant worth; meaningless.<br>&nbsp;&nbsp;&nbsp;4. Insincere, devoid of validity; specious.<br>&nbsp;&nbsp;&nbsp;5. Concave; gaunt; sunken.<br>&nbsp;&nbsp;&nbsp;6. Pertaining to hollow body position<br>", "etymology": "First recorded before 900; Middle English hal(o)wen, Old English hālgian (cognate with German heiligen, Old Norse helga ), derivative of hālig “consecrated, sacred, holy”; holy", "example": "To live with ugliness, we must hallow loveliness the more, remembering that it often springsfrom mud into light-filled air.", "synonym": "anoint"}, {"word": "fustigate", "definitionA": "to cudgel; beat; punish severely.", "definitionB": "No definition found", "etymology": "First recorded in 1650–60; from Late Latin fūstīgātus, past participle of fūstigāre “to cudgel to death,” derivative of the noun fūstis “a stick, club, cudgel” + -igāre, combining form of agere “to drive, do, act”", "example": null, "synonym": "baste"}, {"word": "fulminate", "definitionA": "to explode with a loud noise; detonate.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any salt or ester of fulminic acid, mostly explosive.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a verbal attack.<br>&nbsp;&nbsp;&nbsp;2. To issue as a denunciation.<br>&nbsp;&nbsp;&nbsp;3. To thunder or make a loud noise.<br>&nbsp;&nbsp;&nbsp;4. To strike with lightning; to cause to explode.<br>", "etymology": "First recorded in 1375–1425; late Middle English fulminaten < Latin fulminātus, past participle of fulmināre “to hurl thunderbolts, thunder,” equivalent to fulmin-, stem of fulmen “thunderbolt, lightning” + -ātus -ate 1", "example": "The gun nuts—and obviously, not all gun owners are nuts, not even a majority—fulminate endlessly about their rights.", "synonym": "animadvert"}, {"word": "fumigate", "definitionA": "to expose to smoke or fumes, as in disinfecting or exterminating roaches, ants, etc.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To disinfect, purify, or rid of vermin with the fumes of certain chemicals.<br>", "etymology": "First recorded in 1520–30; from Latin fūmigātus, past participle of fūmigāre “to smoke, fumigate,” equivalent to fūm(us) “smoke” + -igāre, combining form of agere “to drive, do”", "example": "The facilities use a toxic gas called ethylene oxide to sanitize medical and dental equipment and fumigate certain food products.", "synonym": "antisepticize"}]