[{"word": "notoriety", "definitionA": "the state, quality, or character of being notorious or widely known:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The condition of being infamous or notorious.<br>", "etymology": "1585–95; < Medieval Latin nōtōrietās, equivalent to nōtōri ( us ) notorious + -etās, variant (after -i- ) of -ity", "example": "Renowned as a political scrapper, he gained notoriety in 2001 for punching a protester who had thrown an egg at him.", "synonym": "ballyhoo"}, {"word": "debauchery", "definitionA": "excessive indulgence in sensual pleasures; intemperance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Indulgence in sensual pleasures; scandalous activities involving sex, alcohol, or drugs without inhibition.<br>&nbsp;&nbsp;&nbsp;2. Seduction from duty.<br>", "etymology": "First recorded in 1635–45; debauch + -ery", "example": "The group’s many moments of debauchery and complex romantic entanglements.", "synonym": "bender"}, {"word": "grit", "definitionA": "abrasive particles or granules, as of sand or other small, coarse impurities found in the air, food, water, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection of hard small materials, such as dirt, ground stone, debris from sandblasting or other such grinding, or swarf from metalworking.<br>&nbsp;&nbsp;&nbsp;2. Inedible particles in food.<br>&nbsp;&nbsp;&nbsp;3. A measure of the relative coarseness of an abrasive material such as sandpaper, the smaller the number the coarser the abrasive.<br>&nbsp;&nbsp;&nbsp;4. A hard, coarse-grained siliceous sandstone; gritstone. Also, a finer sharp-grained sandstone, e.g., grindstone grit.<br>&nbsp;&nbsp;&nbsp;5. Strength of mind; great courage or fearlessness; fortitude.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Apparently only in grit one's teeth: to clench, particularly in reaction to pain or anger.<br>&nbsp;&nbsp;&nbsp;2. To cover with grit.<br>&nbsp;&nbsp;&nbsp;3. To give forth a grating sound, like sand under the feet; to grate; to grind.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually in the plural) Husked but unground oats.<br>&nbsp;&nbsp;&nbsp;2. (usually in the plural) Coarsely ground corn or hominy used as porridge.<br>", "etymology": "First recorded before 1000; Middle English gret, griet, grit, Old English grēot; cognate with German Griess, Old Norse grjōt “pebble, boulder”; grits", "example": "As he ran down the court, he shook his head and gritted his teeth.", "synonym": "dust"}, {"word": "gritty", "definitionA": "consisting of, containing, or resembling grit; sandy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Containing sand or grit; consisting of grit; caused by grit; full of hard particles.<br>&nbsp;&nbsp;&nbsp;2. Spirited; resolute; unyielding.<br>&nbsp;&nbsp;&nbsp;3. Intense and starkly realistic; depicting harsh reality, especially violence.<br>", "etymology": "First recorded in 1590–1600; grit + -y 1", "example": "“We got to do a little bit more, be a little bit more gritty, make more plays, not have so many breakdowns.”", "synonym": null}, {"word": "throe", "definitionA": "a violent spasm or pang; paroxysm.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pang, spasm.<br>&nbsp;&nbsp;&nbsp;2. (usually plural) A hard struggle.<br>&nbsp;&nbsp;&nbsp;3. A tool for splitting wood into shingles; a frow.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put in agony.<br>&nbsp;&nbsp;&nbsp;2. To struggle in extreme pain; to be in agony; to agonize.<br>", "etymology": "1150–1200; Middle English throwe, alteration of thrawe ( -o- from Old English thrōwian to suffer, be in pain), Old English thrawu; cognate with Old Norse thrā (in līkthrā leprosy)", "example": "He stretches his arms wide like a child in the throes of a sugar rampage, pushing groups of strangers to their deaths, grinning as snipers take them out.", "synonym": "ache"}, {"word": "pinnace", "definitionA": "a light sailing ship, especially one formerly used in attendance on a larger ship.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A light boat, traditionally propelled by sails, but sometimes a rowboat. Pinnaces are usually messenger boats, carrying messages among the larger ships of a fleet.<br>", "etymology": "1540–50; < Middle French pinace < Old Spanish pinaza literally, something made of pino pine 1", "example": "He says the largest one is the Susan Constant, next in size is the Godspeed, and the smallest, a pinnace, is the Discovery.", "synonym": "ark"}, {"word": "barbican", "definitionA": "an outwork of a fortified place, as a castle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tower at the entrance to a castle or fortified town<br>&nbsp;&nbsp;&nbsp;2. A fortress at the end of a bridge.<br>&nbsp;&nbsp;&nbsp;3. An opening in the wall of a fortress through which the guns are levelled; a narrow loophole through which arrows and other missiles may be shot.<br>&nbsp;&nbsp;&nbsp;4. A temporary wooden tower built for defensive purposes.<br>", "etymology": "1250–1300; Middle English barbecan, barbican < Old French barbacane or Medieval Latin barbacana, perhaps ≪ Persian bālāḥāna terrace over a roof, upper floor, altered by association with Latin barba beard, a beard marking the front or face of a thing", "example": "If the barbican fell, the castle still had two courtyards, or baileys, from which last gasp fighting could be carried out.", "synonym": "beacon"}, {"word": "molest", "definitionA": "to make indecent sexual advances to.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To annoy intentionally.<br>&nbsp;&nbsp;&nbsp;2. To disturb or tamper with.<br>&nbsp;&nbsp;&nbsp;3. To sexually assault or sexually harass, especially a minor.<br>", "etymology": "First recorded in 1325–75; Middle English molesten, from Latin molestāre “to irk,” derivative of molestus “irksome”; compare mōlēs “mass, burden, trouble”", "example": "Harris has denied molesting minors and was never criminally charged.", "synonym": "assail"}, {"word": "impinge", "definitionA": "to make an impression; have an effect or impact (usually followed by on or upon ):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a physical impact on.<br>&nbsp;&nbsp;&nbsp;2. To interfere with.<br>&nbsp;&nbsp;&nbsp;3. To have an effect upon, especially a negative one.<br>", "etymology": "First recorded in 1525–35; from Medieval Latin impingere “to strike against, drive at,” equivalent to Latin im- prefix meaning “in” ( im- 1 ) + -pingere, combining form of pangere “to fasten, drive in, fix”; impact", "example": "And third, Trump has floated the idea of using U.S. military power to confront narcotraffickers within Mexico — which would directly impinge on Mexico’s sovereignty and could generate more violence on both sides of the border.", "synonym": "affect"}, {"word": "arbitrate", "definitionA": "to decide as arbitrator or arbiter; determine.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a judgment (on a dispute) as an arbitrator or arbiter<br>&nbsp;&nbsp;&nbsp;2. To submit (a dispute) to such judgment<br>&nbsp;&nbsp;&nbsp;3. To assign an arbitrary value to, or otherwise determine arbitrarily.<br>", "etymology": "First recorded in 1580–90; from Latin arbitrātus “decided, judged,” past participle of arbitrārī “to decide, judge,” from arbit(e)r arbiter", "example": "He said the review did not and “could not arbitrate on whether or not Israel has breached international humanitarian law”.", "synonym": "adjudge"}, {"word": "arbitrary", "definitionA": "subject to individual will or judgment without restriction; contingent solely upon one's discretion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Anything arbitrary, such as an arithmetical value or a fee.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually of a decision) Based on individual discretion or judgment; not based on any objective distinction, perhaps even made at random.<br>&nbsp;&nbsp;&nbsp;2. Determined by impulse rather than reason; heavy-handed.<br>&nbsp;&nbsp;&nbsp;3. Any, out of all that are possible.<br>&nbsp;&nbsp;&nbsp;4. Determined by independent arbiter.<br>&nbsp;&nbsp;&nbsp;5. Not representative or symbolic; not iconic.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Latin arbitrārius “uncertain” (i.e., depending on an arbiter's decision); arbiter, -ary", "example": "“Undersigned” only works because the choices don’t feel like an arbitrary thought experiment; that is, it’s not a game of accepting, say, untold billions by giving up a pet or a limb.", "synonym": null}, {"word": "shoal", "definitionA": "a place where a sea, river, or other body of water is shallow:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sandbank or sandbar creating a shallow.<br>&nbsp;&nbsp;&nbsp;2. A shallow in a body of water.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To arrive at a shallow (or less deep) area.<br>&nbsp;&nbsp;&nbsp;2. To cause a shallowing; to come to a more shallow part of.<br>&nbsp;&nbsp;&nbsp;3. To become shallow.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Shallow.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any large number of persons or things.<br>&nbsp;&nbsp;&nbsp;2. (collective) A large number of fish (or other sea creatures) of the same species swimming together.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To collect in a shoal; to throng.<br>", "etymology": "First recorded before 900; (for the adjective) Middle English shold(e), Old English sceald shallow; noun and verb derivative of the adjective", "example": "Calm captains of the ship of state struggle to navigate the world system’s waves and shoals.", "synonym": "bank"}, {"word": "tome", "definitionA": "a book, especially a very heavy, large, or learned book.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One in a series of volumes.<br>&nbsp;&nbsp;&nbsp;2. A large or scholarly book.<br>", "etymology": "First recorded in 1510–20; from French, from Latin tomus, from Greek tómos “slice, piece, roll of paper, book,” akin to témnein “to cut”", "example": "Publishers have given us a lot to love this year, including tomes about Hollywood, Pride and California landscapes, and cookbooks sampling the flavors of Mexico, Africa, Latin America and Vietnam.", "synonym": "classic"}, {"word": "beleaguer", "definitionA": "to surround with military forces.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To besiege; to surround with troops.<br>&nbsp;&nbsp;&nbsp;2. To vex, harass, or beset.<br>&nbsp;&nbsp;&nbsp;3. To exhaust.<br>", "etymology": "First recorded in 1580–90; be- + leaguer 1", "example": "While he said the charity does an \"enormous amount of good work\" across the UK \"it is beleaguered with the Assured Scheme\" which he said was like a \"millstone\" around the charity's neck.", "synonym": "badger"}]