[{"word": "ingrate", "definitionA": "an ungrateful person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ungrateful person<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Ungrateful<br>&nbsp;&nbsp;&nbsp;2. Unpleasant, unfriendly<br>", "etymology": "1350–1400; Middle English ingrat < Latin ingrātus ungrateful. See in- 3, grateful", "example": "She was even sweet to that smug ingrate Miss Bunting after she kept insulting everyone at dinner.", "synonym": "bounder"}, {"word": "skirl", "definitionA": "to play the bagpipe.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A shrill sound, as of bagpipes.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a shrill sound, as of bagpipes.<br>", "etymology": "1350–1400; Middle English scirlen, skrillen (v.), perhaps < Scandinavian; compare Norwegian skrella boom, crash", "example": "A roll of a drum and the skirl of a fife came wafting across the valley on the April breeze.", "synonym": "blast"}, {"word": "mackle", "definitionA": "a blur in printing, as from a double impression.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A spot.<br>&nbsp;&nbsp;&nbsp;2. A blur or an appearance of a double impression, as when the paper slips a little during printing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To blur or be blurred; especially to blur or double an impression from type.<br>", "etymology": "1585–95; variant of earlier macle, makle; earlier macule macule", "example": null, "synonym": null}, {"word": "kerplunk", "definitionA": "with or as if with a sudden muffled thud:", "definitionB": "No definition found", "etymology": "First recorded in 1885–90; ker-, plunk", "example": "The potato missed Jasper Jay by less than an inch, bringing up kerplunk!", "synonym": null}, {"word": "macula", "definitionA": "a spot or blotch, especially on one's skin; macule.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An oval yellow spot near the center of the retina of the human eye, histologically defined as having two or more layers of ganglion cells, responsible for detailed central vision.<br>&nbsp;&nbsp;&nbsp;2. A small chamber of the inner ear of certain vertebrates filled with endolymph and containing an otolith.<br>&nbsp;&nbsp;&nbsp;3. A spot, as on the skin, or on the surface of the sun or of some other luminous orb.<br>&nbsp;&nbsp;&nbsp;4. A rather large spot or blotch of color.<br>&nbsp;&nbsp;&nbsp;5. In planetary geology, an unusually dark area on the surface of a planet or moon.<br>", "etymology": "1350–1400; Middle English < Latin: spot, blemish", "example": "In order then to avoid diplopia the macula lutea moves to where the retinal image is formed.", "synonym": "birthmark"}, {"word": "muffle", "definitionA": "to wrap with something to deaden or prevent sound:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Anything that mutes or deadens sound.<br>&nbsp;&nbsp;&nbsp;2. A warm piece of clothing for the hands.<br>&nbsp;&nbsp;&nbsp;3. A boxing glove.<br>&nbsp;&nbsp;&nbsp;4. A kiln or furnace, often electric, with no direct flames (a muffle furnace)<br>&nbsp;&nbsp;&nbsp;5. The bare end of the nose between the nostrils, especially in ruminants.<br>&nbsp;&nbsp;&nbsp;6. A machine with two pulleys to hoist load by spinning wheels, polyspast, block and tackle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wrap (a person, face etc.) in fabric or another covering, for warmth or protection; often with up.<br>&nbsp;&nbsp;&nbsp;2. To wrap up or cover (a source of noise) in order to deaden the sound.<br>&nbsp;&nbsp;&nbsp;3. To mute or deaden (a sound etc.).<br>&nbsp;&nbsp;&nbsp;4. To speak indistinctly, or without clear articulation.<br>&nbsp;&nbsp;&nbsp;5. To prevent seeing, or hearing, or speaking, by wraps bound about the head; to blindfold; to deafen.<br>", "etymology": "First recorded in 1450–1500; late Middle English muffelen “to veil, cover”; probably a derivative of Old French moufle “mitten”; muff", "example": "While headbands do provide some natural muffle, the fabric won’t be enough to tune out sounds within close range.", "synonym": "conceal"}, {"word": "muff", "definitionA": "a thick, tubular case for the hands, covered with fur or other material, used by women and girls for warmth and as a handbag.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A piece of fur or cloth, usually with open ends, used for keeping the hands warm.<br>&nbsp;&nbsp;&nbsp;2. Female pubic hair; female genitals.<br>&nbsp;&nbsp;&nbsp;3. A blown cylinder of glass which is afterward flattened out to make a sheet.<br>&nbsp;&nbsp;&nbsp;4. The feathers sticking out from both sides of the face under the beak of some birds.<br>&nbsp;&nbsp;&nbsp;5. A short hollow cylinder surrounding an object such as a pipe.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fool, a stupid or poor-spirited person.<br>&nbsp;&nbsp;&nbsp;2. An error, a mistake; a failure to hold a ball when once in the hands.<br>&nbsp;&nbsp;&nbsp;3. A bird, the whitethroat.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drop or mishandle (the ball, a catch etc.); to play badly.<br>&nbsp;&nbsp;&nbsp;2. To mishandle; to bungle.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A muffin.<br>", "etymology": "1590–1600; < Dutch mof, earlier moffel, muffel mitten, muff < Old North French moufle < early Medieval Latin muffula, perhaps < Frankish", "example": "The kitchen assembles and refrigerates his Muff-A-Lotta the day before diners can actually buy it.", "synonym": "blunder"}, {"word": "insufferable", "definitionA": "not to be endured; intolerable; unbearable:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not sufferable; very difficult or impossible to endure.<br>", "etymology": "First recorded in 1525–35; in- 3 + sufferable ( def )", "example": "While that would be an insufferable amount of time to get a backpacking or car-camping tent up and livable, the aforementioned benefits make that time investment worthwhile.", "synonym": null}, {"word": "squelch", "definitionA": "to strike or press with crushing force; crush down; squash.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A squelching sound.<br>&nbsp;&nbsp;&nbsp;2. (radio technology) The suppression of the unwanted hiss or static between received transmissions by adjusting the gain of the receiver.<br>&nbsp;&nbsp;&nbsp;3. A heavy blow or fall.<br>&nbsp;&nbsp;&nbsp;4. A kind of electronic beat used in acid house and related music genres.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To halt, stop, eliminate, stamp out, or put down, often suddenly or by force<br>&nbsp;&nbsp;&nbsp;2. (radio technology) to suppress the unwanted hiss or static between received transmissions by adjusting a threshold level for signal strength, below which the signal is suppressed by applying a gain of zero, and above which a positive (and linear from zero) gain is applied.<br>&nbsp;&nbsp;&nbsp;3. To make a sucking, splashing noise as when walking on muddy ground<br>&nbsp;&nbsp;&nbsp;4. To walk or step through a substance such as mud<br>", "etymology": "1610–20; variant of quelch in same sense (perhaps blend of quell and quash ); initial s perhaps from squash 1", "example": "Even so, AEI is mostly a bystander as Republicans fight among themselves to squelch the Tea Party grassroots.", "synonym": "censure"}, {"word": "hush", "definitionA": "(used as a command to be silent or quiet.)", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A silence, especially after some noise<br>&nbsp;&nbsp;&nbsp;2. A mining method using water<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To become quiet.<br>&nbsp;&nbsp;&nbsp;2. To make quiet.<br>&nbsp;&nbsp;&nbsp;3. To appease; to allay; to soothe.<br>&nbsp;&nbsp;&nbsp;4. To clear off soil and other materials overlying the bedrock.<br>", "etymology": "1350–1400; apparently back formation from husht whist 2 ( Middle English huissht ), the -t being taken for past participle suffix", "example": "Keeping everything “hush-hush” for years was exhausting, and it was demoralizing to never open up about her personal life — particularly as an “open book” singer-songwriter who poured her real experiences into lyrics.", "synonym": "calm"}]