[{"word": "jot", "definitionA": "to write or mark down quickly or briefly (usually followed by down ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Iota; the smallest letter or stroke of any writing.<br>&nbsp;&nbsp;&nbsp;2. A small amount, bit; the smallest amount.<br>&nbsp;&nbsp;&nbsp;3. Moment, instant.<br>&nbsp;&nbsp;&nbsp;4. A brief and hurriedly written note.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (usually with \"down\") To write quickly.<br>", "etymology": "1520–30; earlier iot, iote < Latin iōta < Greek iôta iota", "example": "The young man had the presence of mind to tail Gaylard Williams out of the park and jot down his license plate.", "synonym": "indicate"}, {"word": "jolt", "definitionA": "to jar, shake, or cause to move by or as if by a sudden rough thrust; shake up roughly:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An act of jolting.<br>&nbsp;&nbsp;&nbsp;2. A surprise or shock.<br>&nbsp;&nbsp;&nbsp;3. A long prison sentence.<br>&nbsp;&nbsp;&nbsp;4. A narcotic injection.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To push or shake abruptly and roughly.<br>&nbsp;&nbsp;&nbsp;2. To knock sharply<br>&nbsp;&nbsp;&nbsp;3. To shock (someone) into taking action or being alert<br>&nbsp;&nbsp;&nbsp;4. To shock emotionally.<br>&nbsp;&nbsp;&nbsp;5. To shake; to move with a series of jerks.<br>", "etymology": "1590–1600; blend of jot to jolt and joll to bump, both now dial.", "example": "Despite a year of tumult and a jolt to its ad revenues, Google is as important as ever.", "synonym": "blow"}, {"word": "eerie", "definitionA": "uncanny, so as to inspire superstitious fear; weird", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Strange, weird, fear-inspiring.<br>&nbsp;&nbsp;&nbsp;2. Frightened, timid.<br>", "etymology": "First recorded in 1250–1300; Middle English eri, dialectal variant of argh, Old English earg “cowardly”; cognate with Old Frisian erg, Old Norse argr “evil,” German arg “cowardly”", "example": "Faintly we heard the eerie traces of high-pitched whale song, the complicated variation that the males sing, perhaps to warn off other males.", "synonym": "awesome"}, {"word": "goad", "definitionA": "a stick with a pointed or electrically charged end, for driving cattle, oxen, etc.; prod.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long, pointed stick used to prod animals.<br>&nbsp;&nbsp;&nbsp;2. That which goads or incites; a stimulus.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To prod with a goad.<br>&nbsp;&nbsp;&nbsp;2. To encourage or stimulate.<br>&nbsp;&nbsp;&nbsp;3. To incite or provoke.<br>", "etymology": "before 900; Middle English gode, Old English gād; compare Langobardic gaida spearhead", "example": "Thus began Johns’s career-long fascination with signs and symbols — not as a subject for representation, but as a goad to pure painting.", "synonym": "catalyst"}, {"word": "carotid", "definitionA": "Also called  ca·rot·id ar·ter·y [k, uh, -, rot, -id , ahr, -t, uh, -ree]. either of the two large arteries, one on each side of the head, that carry blood to the head and that divide into an external branch supplying the neck, face, and other external parts, and an internal branch supplying the brain, eye, and other internal parts.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of a number of major arteries in the head and neck.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to these arteries.<br>", "etymology": "1660–70; < Greek karōtídes neck arteries, equivalent to karōt ( ikós ) soporific ( kár ( os ) stupor + -ōtikos -otic ) + -ides -id 1; so called by Galen, who found that their compression causes stupor", "example": "After saying there was “no reason for Elijah McClain to be stopped in the first place,” Bennett pointed out that McClain was given a massive dose of ketamine after the officers had forced him to the ground and placed carotid holds on him.", "synonym": null}, {"word": "unctuous", "definitionA": "characterized by excessive piousness or moralistic fervor, especially in an affected manner; excessively smooth, suave, or smug.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a liquid or substance) Oily or greasy.<br>&nbsp;&nbsp;&nbsp;2. (of a wine, coffee, sauce, gravy etc.) Rich, lush, intense, with layers of concentrated, soft, velvety flavor.<br>&nbsp;&nbsp;&nbsp;3. (by extension, of a person) Profusely polite, especially unpleasantly so and insincerely earnest.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Medieval Latin ūnctuōsus, equivalent to Latin ūnctu(s) “act of anointing” ( ung(uere) “to smear, anoint” + -tus suffix of verb action) + -ōsus -ous", "example": "One promising early antagonist is the late President’s unctuous daughter, Kimberly, played marvelously against type by Amber Tamblyn.", "synonym": null}, {"word": "cornea", "definitionA": "the transparent anterior part of the external coat of the eye covering the iris and the pupil and continuous with the sclera.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The transparent layer making up the outermost front part of the eye, covering the iris, pupil, and anterior chamber.<br>", "etymology": "1350–1400; Middle English < Medieval Latin cornea ( tēla, later tunica ) horny (web or tunic), feminine of corneus corneous", "example": "The tear-moistened surface of your eye’s cornea allows oxygen to diffuse directly from the air into your eyeball.", "synonym": null}, {"word": "sclerometer", "definitionA": "any instrument for determining with precision the degree of hardness of a substance, especially a mineral, as by measuring the pressure necessary to pierce or scratch it.", "definitionB": "No definition found", "etymology": "First recorded in 1875–80; sclero- + -meter", "example": null, "synonym": null}, {"word": "sclerous", "definitionA": "hard; firm; bony.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Hard; indurated; sclerotic<br>", "etymology": "First recorded in 1835–45; scler- + -ous", "example": "Lactic acid, applied with one to ten or more parts of water is also of value in the sclerous and verrucous types.", "synonym": null}, {"word": "retina", "definitionA": "the innermost coat of the posterior part of the eyeball that receives the image produced by the lens, is continuous with the optic nerve, and consists of several layers, one of which contains the rods and cones that are sensitive to light.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The thin layer of cells at the back of the eyeball where light is converted into neural signals sent to the brain.<br>", "etymology": "1350–1400; Middle English ret ( h ) ina < Medieval Latin rētina, perhaps equivalent to Latin rēt- (stem of rēte ) net + -ina -ine 1", "example": "The lowest layer makes predictions about actual sensory input — say, the photons falling on the retina.", "synonym": null}, {"word": "sclerosis", "definitionA": "Pathology. a hardening or induration of a tissue or part, or an increase of connective tissue or the like at the expense of more active tissue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The abnormal hardening of body tissues, such as an artery.<br>&nbsp;&nbsp;&nbsp;2. Inability to create change.<br>", "etymology": "1350–1400; Middle English < Medieval Latin < Greek sklḗrōsis hardening. See scler-, -osis", "example": "After Hurricane Florence in 2018, Gray went three days with no way to refrigerate medicine for her multiple sclerosis or pump the floodwater out of her basement.", "synonym": null}, {"word": "fraternize", "definitionA": "to associate socially or romantically with people considered inappropriate company, often due to a difference in status, as between managers and subordinates, or professors and students:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To associate with others in a brotherly or friendly manner.<br>&nbsp;&nbsp;&nbsp;2. To associate as friends with an enemy, in violation of duty.<br>&nbsp;&nbsp;&nbsp;3. To have an intimate or sexual relationship with a forbidden member of the opposite sex; as, in some cases, football players with cheerleaders.<br>", "etymology": "First recorded in 1605–15; from French fraterniser, from Medieval Latin frāternizāre; fraternal, -ize", "example": "The RA, Axley said, told her not to report it, saying Axley could be found to have violated the school’s prohibition against drinking and fraternizing with the opposite sex.", "synonym": "hobnob"}, {"word": "callow", "definitionA": "immature or inexperienced:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A callow young bird.<br>&nbsp;&nbsp;&nbsp;2. A callow or teneral phase of an insect or other arthropod, typically shortly after ecdysis, while the skin still is hardening, the colours have not yet become stable, and as a rule, before the animal is able to move effectively.<br>&nbsp;&nbsp;&nbsp;3. An alluvial flat.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unfledged (of a young bird).<br>&nbsp;&nbsp;&nbsp;2. (by extension) Immature, lacking in life experience.<br>&nbsp;&nbsp;&nbsp;3. Lacking color or firmness (of some kinds of insects or other arthropods, such as spiders, just after ecdysis); teneral.<br>&nbsp;&nbsp;&nbsp;4. Shallow or weak-willed.<br>&nbsp;&nbsp;&nbsp;5. (of a brick) Unburnt.<br>&nbsp;&nbsp;&nbsp;6. Of land: low-lying and liable to be submerged.<br>&nbsp;&nbsp;&nbsp;7. Bald.<br>", "etymology": "First recorded before 1000; Middle English, Old English calu “bald”; cognate with Dutch kaal, German kahl “bald,” Old Church Slavonic golŭ “bare”", "example": "That was what I sought when, as a callow and hormonal high school student, I first discovered Lawrence.", "synonym": null}, {"word": "scurry", "definitionA": "to go or move quickly or in haste.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dash.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To run with quick light steps, to scamper.<br>", "etymology": "First recorded in 1800–10; extracted from hurry-scurry", "example": "It has also caused a panicked scurry for antiviral drug remdesivir, which became a popular therapy option as India’s case count kept surging past all previous records.", "synonym": "barrel"}, {"word": "skelter", "definitionA": "to scurry.", "definitionB": "No definition found", "etymology": "First recorded in 1850–55; probably extracted from helter-skelter", "example": "In its first season, though, it’s weighed down by helter-skelter storytelling that borders on the aimless—and, consequently, renders it a snooze.", "synonym": null}, {"word": "unwavering", "definitionA": "not wavering or hesitant; resolute", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Never doubted; always steady and on course<br>", "etymology": null, "example": "Through all the ups and downs, one thing remained constant about our team — an unwavering commitment to battle through adversity and to achieve our goals not as individuals, but as a collective unit.", "synonym": null}, {"word": "halter", "definitionA": "a rope or strap with a noose or headstall for leading or restraining horses or cattle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bitless headpiece of rope or straps, placed on the head of animals such as cattle or horses to lead or tie them.<br>&nbsp;&nbsp;&nbsp;2. A rope with a noose, for hanging criminals; the gallows rope.<br>&nbsp;&nbsp;&nbsp;3. A halter top.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To place a halter on.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who halts or limps; a cripple.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small knobbed structure in some two-winged insects, one of a pair that are flapped rapidly and function as accelerometers to maintain stability in flight.<br>", "etymology": "First recorded before 1000; Middle English; Old English hælfter; cognate with German Halfter", "example": "“There are many after-hours events where you can show off your halter, strapless shirt or dress, or mini-skirt,” Royer wrote.", "synonym": "check"}, {"word": "obstetrician ", "definitionA": "a physician who specializes in obstetrics. : OB, ob", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A physician who specializes in childbirth.<br>", "etymology": "irst recorded in 1820–30; from Latin obstetrīci(a) “midwifery” (noun use of feminine of obstetrīcius ) + -an; obstetric", "example": "It is believed the couple were visiting royal obstetrician Alan Farthing.", "synonym": "accoucheuse"}, {"word": "cahoot", "definitionA": "go cahoots,  to share equally; become partners: Also go in cahoot with, go in cahoots.", "definitionB": "No definition found", "etymology": "1820–30, Americanism; perhaps < French cahute cabin, hut, equivalent to ca ( bane ) cabin + hutte hut", "example": null, "synonym": "alliance"}, {"word": "nag", "definitionA": "to annoy by persistent faultfinding, complaints, or demands.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small horse; a pony.<br>&nbsp;&nbsp;&nbsp;2. An old useless horse.<br>&nbsp;&nbsp;&nbsp;3. A paramour.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone or something that nags.<br>&nbsp;&nbsp;&nbsp;2. A repeated complaint or reminder.<br>&nbsp;&nbsp;&nbsp;3. A persistent, bothersome thought or worry<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To continuously remind or complain to (someone) in an annoying way, often about insignificant or unnecessary matters.<br>&nbsp;&nbsp;&nbsp;2. To bother with persistent thoughts or memories.<br>&nbsp;&nbsp;&nbsp;3. To bother or disturb persistently in any way.<br>", "etymology": "First recorded in 1820–30; from Old Norse nagga “to rub, grumble, quarrel”; akin to Middle Low German naggen “to irritate”; gnaw", "example": "I’m stuck since I don’t want to fight about this or be a nag, but I am afraid he is not going to be with me when we grow old.", "synonym": "bait"}, {"word": "succor", "definitionA": "help; relief; aid; assistance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Aid, assistance, or relief given to one in distress; ministration.<br>&nbsp;&nbsp;&nbsp;2. Aid or assistance in the form of military equipment and soldiers, especially reinforcements sent to support military action.<br>&nbsp;&nbsp;&nbsp;3. (obsolete except dialectal) Protection, refuge, shelter; a place providing such protection, refuge or shelter.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give aid, assistance, or help.<br>&nbsp;&nbsp;&nbsp;2. To provide aid or assistance in the form of military equipment and soldiers; in particular, for helping a place under siege.<br>&nbsp;&nbsp;&nbsp;3. (obsolete except dialectal) To protect, to shelter; to provide a refuge.<br>", "etymology": "1250–1300; (verb) Middle English sucuren from Old French suc(c)urre, socorre from Latin succurrere “to go beneath, run to help,” equivalent to suc- suc- + currere “to run” ( current ); (noun) Middle English soc(o)ur, back formation from sucurs (taken as plural) from Old French from Medieval Latin succursus, equivalent to Latin succur(rere) + -sus, var of -tus suffix of verbal action", "example": "Such attention comes too late to offer any succor or comfort to the families, friends, and co-workers mourning the dead.", "synonym": "aid"}, {"word": "liminal", "definitionA": "Psychology. of, relating to, or situated at the limen, the threshold at which a stimulus begins to produce an effect:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to an entrance or threshold.<br>&nbsp;&nbsp;&nbsp;2. Of or pertaining to a beginning or first stage of a process.<br>", "etymology": "First recorded in 1875–80; from Latin līmin- (stem of līmen ) “threshold, lintel, sill” + -al 1", "example": "What the scientists see in them is the faintest sign of a liminal, maybe dreamlike, consciousness.", "synonym": null}, {"word": "ripsnorter", "definitionA": "something or someone exceedingly strong or violent:", "definitionB": "No definition found", "etymology": "An Americanism dating back to 1830–40; rip 1 + snorter", "example": "He'd just about convinced himself that he's a real ripsnorter of a buck.", "synonym": null}, {"word": "blinky", "definitionA": "(of milk) sour.", "definitionB": "No definition found", "etymology": "blink (in the sense “to turn sour”; compare British dialect blink to bewitch, turn (milk, beer) sour by witchcraft) + -y 1", "example": "Blinky Palermo, arguably the last great abstract painter, moved in the opposite direction.", "synonym": null}, {"word": "covenant", "definitionA": "an agreement or promise, usually formal, between two or more people or groups to do or not do something specified.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An agreement to do or not do a particular thing.<br>&nbsp;&nbsp;&nbsp;2. A promise, incidental to a deed or contract, either express or implied.<br>&nbsp;&nbsp;&nbsp;3. A pact or binding agreement between two or more parties.<br>&nbsp;&nbsp;&nbsp;4. An incidental clause in an agreement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To enter into, or promise something by, a covenant.<br>&nbsp;&nbsp;&nbsp;2. To enter a formal agreement.<br>&nbsp;&nbsp;&nbsp;3. To bind oneself in contract.<br>&nbsp;&nbsp;&nbsp;4. To make a stipulation.<br>", "etymology": "First recorded in 1250–1300; Middle English, from Anglo-French, Old French, noun use of convenant, covenant “agreeing, fitting,” present participle of convenir, covenir “to agree, meet, suit,” from Latin convenīre “to be suitable, come together”; convene", "example": "Our hosts were joined by Alain Stephens of The Trace, who gave a great lesson on ghost guns, and Cristina Kim of KPBS, who has reported on racially restrictive housing covenants that remain in public records.", "synonym": "agreement"}, {"word": "timorous", "definitionA": "full of fear; fearful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fearful; afraid; timid<br>", "etymology": "1400–50; late Middle English < Medieval Latin timōrōsus ( Latin timōr- (stem of timor ) fear + -ōsus -ous )", "example": "Forget about the Second Amendment—the gun lobby, abetted by timorous Republicans, is trying to privatize law and order.", "synonym": null}]