[{"word": "slump", "definitionA": "to drop or fall heavily; collapse:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A heavy or helpless collapse; a slouching or drooping posture; a period of poor activity or performance, especially an extended period.<br>&nbsp;&nbsp;&nbsp;2. A measure of the fluidity of freshly mixed concrete, based on how much the concrete formed in a standard slump cone sags when the cone is removed.<br>&nbsp;&nbsp;&nbsp;3. A boggy place.<br>&nbsp;&nbsp;&nbsp;4. The noise made by anything falling into a hole, or into a soft, miry place.<br>&nbsp;&nbsp;&nbsp;5. The gross amount; the mass; the lump.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To collapse heavily or helplessly.<br>&nbsp;&nbsp;&nbsp;2. To decline or fall off in activity or performance.<br>&nbsp;&nbsp;&nbsp;3. To slouch or droop.<br>&nbsp;&nbsp;&nbsp;4. To lump; to throw together messily.<br>&nbsp;&nbsp;&nbsp;5. To fall or sink suddenly through or in, when walking on a surface, as on thawing snow or ice, a bog, etc.<br>&nbsp;&nbsp;&nbsp;6. (slang) To cause to collapse; to hit hard; to render unsconscious; to kill.<br>", "etymology": "1670–80; originally, to sink into a bog or mud; perhaps imitative ( plump 2 )", "example": "And, yes, even Tesla can endure a strong slump, giving up tens of billions of dollars in market capitalization at the same time.", "synonym": "blight"}, {"word": "serenity", "definitionA": "the state or quality of being serene, calm, or tranquil; sereneness.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The state of being serene; calmness; peacefulness.<br>&nbsp;&nbsp;&nbsp;2. A lack of agitation or disturbance.<br>&nbsp;&nbsp;&nbsp;3. A title given to a reigning prince or similar dignitary.<br>", "etymology": "First recorded in 1400–50; late Middle English serenite, from Latin serēnitās; serene ( def ), -ity ( def )", "example": "The thin step-laden lanes of Sibernik’s old town were packed with pedestrians and tour groups circa 2019, but now those Renaissance streets are transportative, a picture of elegance and serenity.", "synonym": "cool"}, {"word": "salinity", "definitionA": "the quality or condition of being salty; saltiness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality of being saline.<br>&nbsp;&nbsp;&nbsp;2. The concentration of salt in a solution.<br>", "etymology": "salin(e) ( def ) + -ity ( def )", "example": "Coined “Weganool,” the plant’s fibers can be extracted without chemicals and it can be grown in soil with high salinity and little water — plus the liquid leftovers can be made into insect repellent.", "synonym": null}, {"word": "diadem", "definitionA": "a crown.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ornamental headband worn as a badge of royalty.<br>&nbsp;&nbsp;&nbsp;2. A crown.<br>&nbsp;&nbsp;&nbsp;3. Regal power; sovereignty; empire—considered as symbolized by the crown.<br>&nbsp;&nbsp;&nbsp;4. An arch rising from the rim of a crown (rarely also of a coronet), and uniting with others over its centre.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To adorn with a diadem; to crown.<br>", "etymology": "1250–1300; Middle English diademe (< Anglo-French ) < Latin diadēma < Greek diádēma fillet, band, equivalent to diadē- (verbid stem of diadeîn to bind round + -ma noun suffix", "example": "In an infrared image released September 21, Neptune and its gossamer diadems of dust take on an ethereal glow against the inky backdrop of space.", "synonym": "coronet"}, {"word": "phlegm", "definitionA": "the thick mucus secreted in the respiratory passages and discharged through the mouth, especially that occurring in the lungs and throat passages, as during a cold.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of the four humors making up the body in ancient and mediaeval medicine; said to be cold and moist, and often identified with mucus.<br>&nbsp;&nbsp;&nbsp;2. Viscid mucus produced by the body, later especially mucus expelled from the bronchial passages by coughing.<br>&nbsp;&nbsp;&nbsp;3. A watery distillation, especially one obtained from plant matter; an aqueous solution.<br>&nbsp;&nbsp;&nbsp;4. Calmness of temperament, composure; also seen negatively, sluggishness, indifference.<br>", "etymology": "1350–1400; Middle English fleem < Middle French flemme < Late Latin phlegma < Greek phlégma flame, phlegmatic humor, equivalent to phlég ( ein ) to burn + -ma resultative noun suffix", "example": "If pathogens make it through your airways to the lungs, those pathogens can get stuck on phlegm.", "synonym": "aloofness"}, {"word": "fumble", "definitionA": "to feel or grope about clumsily:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ball etc. that has been dropped by accident.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To handle nervously or awkwardly.<br>&nbsp;&nbsp;&nbsp;2. To grope awkwardly in trying to find something<br>&nbsp;&nbsp;&nbsp;3. To blunder uncertainly.<br>&nbsp;&nbsp;&nbsp;4. To grope about in perplexity; to seek awkwardly.<br>&nbsp;&nbsp;&nbsp;5. To drop a ball or a baton etc. by accident.<br>&nbsp;&nbsp;&nbsp;6. To handle much; to play childishly; to turn over and over.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dessert similar to a cross between a fool and a crumble.<br>", "etymology": "1500–10; akin to Norwegian, Swedish fumla, Middle Low German fummeln to grope, fumble", "example": "Trubisky lost a fumble on a sack, although the Packers might have gotten away with a face-mask penalty that went uncalled.", "synonym": "bollix"}, {"word": "arachrophobia", "definitionA": null, "definitionB": "No definition found", "etymology": null, "example": null, "synonym": null}, {"word": "placental", "definitionA": "(esp of animals) having a placenta See also eutherian", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any animal that is a member of the Placentalia<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to the placenta, or to the Placentalia<br>&nbsp;&nbsp;&nbsp;2. Having a placenta.<br>", "etymology": null, "example": "But increase in size and activity, and the expense of producing each new individual, led to the adoption of placental development.", "synonym": null}, {"word": "legume", "definitionA": "any plant of the legume family, especially those used for feed, food, or as a soil-improving crop.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The fruit or seed of leguminous plants (as peas or beans) used for food.<br>&nbsp;&nbsp;&nbsp;2. Any of a large family (Fabaceae, syn. Leguminosae) of dicotyledonous herbs, shrubs, and trees having fruits that are legumes or loments, bearing nodules on the roots that contain nitrogen-fixing bacteria, and including important food and forage plants (as peas, beans, or clovers).<br>&nbsp;&nbsp;&nbsp;3. A pod dehiscent into two pieces or valves, and having the seed attached at one suture, as that of the pea.<br>", "etymology": "First recorded in 1670–80; from French légume “vegetable,” from Latin legūmen “pulse” (a leguminous plant), derivative of legere “to choose, gather, read”", "example": "Along with his vegetable crops and cannabis, Stein plants grasses and legumes, including oats, beans, and peas.", "synonym": "edible"}, {"word": "arachnid", "definitionA": "any wingless, carnivorous arthropod of the class Arachnida, including spiders, scorpions, mites, ticks, and daddy-longlegs, having a body divided into two parts, the cephalothorax and the abdomen, and having eight appendages and no antennae. Compare insect.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of the eight-legged creatures, including spiders and scorpions, of the class Arachnida.<br>", "etymology": "1865–70; < New Latin Arachnida < Greek aráchn ( ē ) spider, spider's web + New Latin -ida -ida", "example": "If experiences shape the brain’scircuitry then I learned to fear the fatherbefore the arachnid.", "synonym": "harvestman"}]