[{"word": "propensity", "definitionA": "a natural inclination or tendency:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An inclination, disposition, tendency, preference, or attraction.<br>", "etymology": "First recorded in 1560–70; propense + -ity", "example": "Alpha-ketoacids drew their attention because of “their stability in water and their propensity to form carbon-carbon bonds, the skeleton of biology,” Springsteen said.", "synonym": "ability"}, {"word": "thug", "definitionA": "a violent, lawless, or vicious person, especially one who commits a crime such as assault, robbery, or murder:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone with an intimidating and unseemly appearance and mannerisms, who treats others violently and roughly, often for hire.<br>&nbsp;&nbsp;&nbsp;2. One of a band of assassins formerly active in northern India who worshipped Kali and offered their victims to her.<br>&nbsp;&nbsp;&nbsp;3. In gardening, an over-vigorous plant that spreads and dominates the flowerbed.<br>&nbsp;&nbsp;&nbsp;4. A punk; a hoodlum; a hooligan.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To commit acts of thuggery, to live the life of a thug, or to dress and act in a manner reminiscent of someone who does.<br>", "etymology": "First recorded in 1800–10; from Hindi, Marathi ṭhag “swindler, cheat, rogue,” perhaps from Sanskrit sthaga- “a cheat,” from sthagati “he conceals”", "example": "Mike has busted broncos, been tossed by bulls, alienated his former wife with his stoicism and, most recently, taken on various thugs.", "synonym": "delinquent"}, {"word": "anecdote", "definitionA": "a short account of a particular incident or event, especially of an interesting or amusing nature.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short account of a real incident or person, often humorous or interesting.<br>&nbsp;&nbsp;&nbsp;2. An account which supports an argument, but which is not supported by scientific or statistical analysis.<br>&nbsp;&nbsp;&nbsp;3. A previously untold secret account of an incident.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To tell anecdotes (about).<br>", "etymology": "First recorded in 1670–80; from New Latin anecdota or French anecdotes, from Late Greek, Greek anékdota “things unpublished” (referring particularly to Procopius's unpublished memoirs of Justinian and Theodora), neuter plural of anékdotos, equivalent to an- an- 1 + ékdotos “given out,” adjective derivative of ekdidónai “to give out, publish” ( ek- ec- + didónai “to give”)", "example": "Each photograph is combined with stories or anecdotes about that specific animal and informative facts about their species.", "synonym": "chestnut"}, {"word": "fugacious", "definitionA": "fleeting; transient:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fleeting, fading quickly, transient.<br>", "etymology": "1625–35; < Latin fugāci- (stem of fugāx apt to flee, fleet, derivative of fugere to flee + -ous", "example": "By means of careful work, Grafe came closer to ascertaining the origin of the fugacious aromatic materials.", "synonym": null}, {"word": "ephemeral", "definitionA": "lasting a very short time; short-lived; transitory:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something which lasts for a short period of time.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lasting for a short period of time.<br>&nbsp;&nbsp;&nbsp;2. Existing for only one day, as with some flowers, insects, and diseases.<br>&nbsp;&nbsp;&nbsp;3. (of a body of water) Usually dry, but filling with water for brief periods during and after precipitation.<br>", "etymology": "First recorded in 1570–80; from Greek ephḗmer(os) “short-lived, lasting a day” (from ep- ep- + hēmér(a) “day” + -os, adjective suffix) + -al 1", "example": "There’s no ephemeral rush of terror from scaling icy chimneys or descending hillsides.", "synonym": "brief"}, {"word": "sabaton", "definitionA": "a foot defense of mail or of a number of lames with solid toe and heel pieces.", "definitionB": "No definition found", "etymology": "1300–50; Middle English < Old Provençal, equivalent to sabat ( a ) shoe + -on augmentative suffix. See sabot", "example": "Some writers use the term Sabaton for the foot-defence of this period.", "synonym": null}, {"word": "expository", "definitionA": "of the nature of exposition; serving to expound, set forth, or explain:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Serving to explain, explicate, or elucidate; expositive; of or relating to exposition.<br>", "etymology": "From the Medieval Latin word expositōrius, dating back to 1590–1600. See expositor, -tory 1", "example": "His AI buddy is expository to a fault, and functions as the game’s quick and dirty way of dealing with storytelling and worldbuilding for those who don’t remember what happened six years ago.", "synonym": null}, {"word": "expound", "definitionA": "to set forth or state in detail:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To set out the meaning of; to explain or discuss at length<br>&nbsp;&nbsp;&nbsp;2. To make a statement, especially at length.<br>", "etymology": "First recorded in 1250–1300; Middle English expounen, expounden, from Old French espondre, from Latin expōnere “to put out, set forth, explain,” equivalent to ex- ex- 1 + pōnere “to put”", "example": "Driving with one hand on the steering wheel in order to leave the other free to punctuate his stream-of–consciousness musings, Bottura expounds on his theory of culture with the depth of an obsessive and the breadth of an omnivore.", "synonym": "comment"}, {"word": "flick", "definitionA": "a sudden light blow or tap, as with a whip or the finger:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short, quick movement, especially a brush, sweep, or flip.<br>&nbsp;&nbsp;&nbsp;2. A motion picture; (in plural, usually preceded by \"the\") movie theater, cinema.<br>&nbsp;&nbsp;&nbsp;3. A cut that lands with the point, often involving a whip of the foible of the blade to strike at a concealed target.<br>&nbsp;&nbsp;&nbsp;4. A powerful underarm volley shot.<br>&nbsp;&nbsp;&nbsp;5. The act of pressing a place on a touch screen device.<br>&nbsp;&nbsp;&nbsp;6. A flitch.<br>&nbsp;&nbsp;&nbsp;7. A unit of time, equal to 1/705,600,000 of a second<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move or hit (something) with a short, quick motion.<br>", "etymology": "First recorded in 1400–50; late Middle English flykke; imitative", "example": "She plans to hold movie nights, where they’ll gather in the living room to catch a flick.", "synonym": "dab"}, {"word": "porch", "definitionA": "an exterior appendage to a building, forming a covered approach or vestibule to a doorway.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A covered and enclosed entrance to a building, whether taken from the interior, and forming a sort of vestibule within the main wall, or projecting without and with a separate roof.<br>&nbsp;&nbsp;&nbsp;2. A portico; a covered walk.<br>&nbsp;&nbsp;&nbsp;3. The platform outside the external hatch of a spacecraft.<br>", "etymology": "1250–1300; Middle English porche < Old French < Latin porticus porch, portico", "example": "“I was losing it,” Peter later recalled as we sat on their front porch on a far-too-warm November afternoon in Altadena, California, just below the San Gabriel Mountains.", "synonym": "steps"}, {"word": "poach", "definitionA": "to cook (eggs, fish, fruits, etc.) in a hot liquid that is kept just below the boiling point.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of cooking in simmering liquid.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cook something in simmering liquid.<br>&nbsp;&nbsp;&nbsp;2. To be cooked in simmering liquid<br>&nbsp;&nbsp;&nbsp;3. To become soft or muddy.<br>&nbsp;&nbsp;&nbsp;4. To make soft or muddy.<br>&nbsp;&nbsp;&nbsp;5. To stab; to pierce; to spear, as fish.<br>&nbsp;&nbsp;&nbsp;6. To force, drive, or plunge into anything.<br>&nbsp;&nbsp;&nbsp;7. To begin and not complete.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of taking something unfairly, as in tennis doubles where one player returns a shot that their partner was better placed to return.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take game or fish illegally.<br>&nbsp;&nbsp;&nbsp;2. To take anything illegally or unfairly.<br>&nbsp;&nbsp;&nbsp;3. To entice (an employee or customer) to switch from a competing company to one's own.<br>", "etymology": "First recorded in 1350–1400; Middle English noun poche “poached eggs (in sauce),” from Old French pochié, past participle of pochier “to bag (the yolk inside the white),” derivative of poche “bag, pocket,” from Middle Dutch poke poke 2", "example": "Fulmer, who had been serving as an ambassador for Vols football since 2009, took over as athletic director and soon poached Pruitt from Nick Saban’s staff at Alabama.", "synonym": "appropriate"}, {"word": "honk", "definitionA": "the cry of a goose.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sound produced by a typical car horn.<br>&nbsp;&nbsp;&nbsp;2. The cry of a goose.<br>&nbsp;&nbsp;&nbsp;3. A bad smell.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a car horn.<br>&nbsp;&nbsp;&nbsp;2. To make a loud, harsh sound like a car horn.<br>&nbsp;&nbsp;&nbsp;3. To make the vocal sound of a goose.<br>&nbsp;&nbsp;&nbsp;4. To vomit: regurgitate the contents of one's stomach.<br>&nbsp;&nbsp;&nbsp;5. To have a bad smell.<br>&nbsp;&nbsp;&nbsp;6. To squeeze playfully, usually a breast or nose.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Imitation of car horn, used, for example, to clear a path for oneself.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (racial slur) A Caucasian person.<br>&nbsp;&nbsp;&nbsp;2. A factory hand or general unskilled worker.<br>", "etymology": "An Americanism dating back to 1790–1800; imitative", "example": "It’s a booming track that hurtles brass instrumentals, car honks and metallic clangs at the listener as the members bulldoze their way from beginning to end.", "synonym": "blast"}, {"word": "snot", "definitionA": "Vulgar. mucus from the nose.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mucus, especially mucus from the nose.<br>&nbsp;&nbsp;&nbsp;2. A contemptible child.<br>&nbsp;&nbsp;&nbsp;3. A mean fellow.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To blow, wipe, or clear (the nose).<br>&nbsp;&nbsp;&nbsp;2. To sniff or snivel; to produce snot, to have a runny nose.<br>", "etymology": "1350–1400; Middle English; compare Middle Low German, Middle Dutch snotte, Old English gesnot, Danish snot", "example": "You are constantly losing them in your snot and saliva and lots of them are lost in just a day or a few days.", "synonym": null}, {"word": "booger", "definitionA": "Informal. any person or thing:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A piece of solid or semisolid mucus in or removed from a nostril.<br>&nbsp;&nbsp;&nbsp;2. Something suggestive of this material.<br>&nbsp;&nbsp;&nbsp;3. A thing; especially a problematic or difficult thing.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (mildly derogatory) A bodyboarder.<br>", "etymology": "1865–70; perhaps variant of British dialect boggard goblin, bogy; in senses of  booger defs 1, 2 conflated with bugger 1", "example": "Other sea critters feast on these ocean boogers, like brittle stars and small crustaceans.", "synonym": null}, {"word": "dirge", "definitionA": "a funeral song or tune, or one expressing mourning in commemoration of the dead.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mournful poem or piece of music composed or performed as a memorial to a dead person.<br>&nbsp;&nbsp;&nbsp;2. A song or piece of music that is considered too slow, bland or boring.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sing dirges<br>", "etymology": "1175–1225; Middle English dir ( i ) ge < Latin: direct, syncopated variant of dīrige (imperative of dīrigere ), first word of the antiphon sung in the Latin office of the dead (Psalm V, 8)", "example": "Now again they are choosingA fall filled with funeral dirges.", "synonym": "chant"}, {"word": "olid", "definitionA": "foul-smelling", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Evil-smelling; fetid.<br>", "etymology": "C17: from Latin olidus, from olēre to smell", "example": "After a short battle, Olid, hoping for the speedy return of his absent forces, applied for a truce.", "synonym": "bad"}, {"word": "canticle", "definitionA": "one of the nonmetrical hymns or chants, chiefly from the Bible, used in church services.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A chant, hymn or song, especially a nonmetrical one, with words from a biblical text.<br>", "etymology": "1175–1225; Middle English (< Old French ) < Latin canticulum, equivalent to cantic ( um ) song ( canticum ) + -ulum -ule", "example": "In perpetual canticle of love it finds resemblances of the Divine Object of its devotion throughout all nature.", "synonym": "paean"}, {"word": "matins", "definitionA": "Morning prayers", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Together with lauds, the earliest of the canonical hours; normally at sunrise, but often earlier<br>&nbsp;&nbsp;&nbsp;2. Morning prayers<br>", "etymology": "C13: from Old French, ultimately from Latin mātūtīnus of the morning, from Mātūta goddess of dawn", "example": "Damme, where the patriots mustered on the eve of the Bruges Matins, is within a short hour's stroll from the east end of the town.", "synonym": null}]