[{"word": "eerie", "definitionA": "uncanny, so as to inspire superstitious fear; weird", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Strange, weird, fear-inspiring.<br>&nbsp;&nbsp;&nbsp;2. Frightened, timid.<br>", "etymology": "First recorded in 1250–1300; Middle English eri, dialectal variant of argh, Old English earg “cowardly”; cognate with Old Frisian erg, Old Norse argr “evil,” German arg “cowardly”", "example": null, "synonym": "awesome"}, {"word": "succubus", "definitionA": "a demon in female form, said to have sexual intercourse with men in their sleep. Compare incubus ( def 1 ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A female demon which comes to men, especially monks, in their dreams to seduce them and have sexual intercourse, drawing energy from the men to sustain themselves, often until the point of exhaustion or death.<br>&nbsp;&nbsp;&nbsp;2. A strumpet, whore or prostitute.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Medieval Latin, variant of Latin succuba succuba; incubus", "example": "You know he told me once that he had been attacked by a succubus [female demon].", "synonym": "beast"}, {"word": "gadabout", "definitionA": "a person who moves about restlessly or aimlessly, especially from one social activity to another.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who restlessly moves from place to place, seeking amusement or the companionship of others.<br>", "etymology": "First recorded in 1810–20; noun use of verb phrase gad about", "example": "As the lake boat swung around to resume its course, the Gadabout, one hundred feet or more astern, followed.", "synonym": "rover"}, {"word": "gad", "definitionA": "to move restlessly or aimlessly from one place to another:", "definitionB": "&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An exclamatory interjection roughly equivalent to by God, goodness gracious, for goodness' sake.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who roams about idly; a gadabout.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move from one location to another in an apparently random and frivolous manner.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A greedy and/or stupid person.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sharp-pointed object; a goad.<br>&nbsp;&nbsp;&nbsp;2. A metal bar.<br>&nbsp;&nbsp;&nbsp;3. A pointed metal tool for breaking or chiselling rock.<br>&nbsp;&nbsp;&nbsp;4. An indeterminate measure of metal produced by a furnace, perhaps equivalent to the bloom, perhaps weighing around 100 pounds.<br>&nbsp;&nbsp;&nbsp;5. A spike on a gauntlet; a gadling.<br>&nbsp;&nbsp;&nbsp;6. A rod or stick, such as a fishing rod, a measuring rod, or a rod used to drive cattle with.<br>", "etymology": "1425–75; late Middle English gadden, perhaps back formation from gadeling companion in arms, fellow (in 16th century, vagabond, wanderer), Old English gædeling, derivative of gæd fellowship; gather, -ling 1", "example": "Starring the Frozen snowman, the first episode of At Home With Olaf debuted in early April 2020 thanks to their speedy work, with Gad joking that quarantine restrictions forced him to become an ace sound engineer.", "synonym": "cruise"}, {"word": "ambivalent", "definitionA": "having mixed feelings about someone or something; being unable to choose between two (usually opposing) courses of action:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Simultaneously experiencing or expressing opposing or contradictory feelings, beliefs, or motivations.<br>&nbsp;&nbsp;&nbsp;2. Alternately having one opinion or feeling, and then the opposite.<br>", "etymology": "Back formation from ambivalence", "example": null, "synonym": null}, {"word": "bolster", "definitionA": "a long, often cylindrical, cushion or pillow for a bed, sofa, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large cushion or pillow.<br>&nbsp;&nbsp;&nbsp;2. A pad, quilt, or anything used to hinder pressure, support part of the body, or make a bandage sit easy upon a wounded part; a compress.<br>&nbsp;&nbsp;&nbsp;3. A small spacer located on top of the axle of horse-drawn wagons that gives the front wheels enough clearance to turn.<br>&nbsp;&nbsp;&nbsp;4. A short, horizontal structural timber between a post and a beam for enlarging the bearing area of the post and/or reducing the span of the beam.<br>&nbsp;&nbsp;&nbsp;5. A beam in the middle of a railway truck, supporting the body of the car.<br>&nbsp;&nbsp;&nbsp;6. The perforated plate in a punching machine on which anything rests when being punched.<br>&nbsp;&nbsp;&nbsp;7. The part of a knife blade that abuts upon the end of the handle.<br>&nbsp;&nbsp;&nbsp;8. The metallic end of a pocketknife handle.<br>&nbsp;&nbsp;&nbsp;9. The rolls forming the ends or sides of the Ionic capital.<br>&nbsp;&nbsp;&nbsp;10. A block of wood on the carriage of a siege gun, upon which the breech of the gun rests when arranged for transportation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To brace, reinforce, secure, or support.<br>", "etymology": "First recorded before 1000; Middle English bolstre (noun), Old English bolster; cognate with Old Norse bolstr, Dutch bolster, German Polster", "example": "We recommend getting a bed with bolsters, which provide a sense of security and satisfies their natural instinct to dig and burrow.", "synonym": "assist"}, {"word": "misogyny", "definitionA": "hatred, dislike, or mistrust of women, manifested in various forms such as physical intimidation and abuse, sexual harassment and rape, social shunning and ostracism, etc.: Historically witch hunts were an embodiment of the misogyny of the time.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Hatred of, contempt for, or prejudice against women.<br>", "etymology": "First recorded in 1650–60; New Latin misogynia, from Greek misogynía “hatred of women,” equivalent to miso- + gyn- + -ia noun suffix; miso-, gyn-, -y 3", "example": "I truly believe it is misogyny, and I also think it’s classist.", "synonym": "bias"}, {"word": "accredit", "definitionA": "to provide or send with credentials; designate officially:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ascribe; attribute; credit with.<br>&nbsp;&nbsp;&nbsp;2. To put or bring into credit; to invest with credit or authority; to sanction.<br>&nbsp;&nbsp;&nbsp;3. To send with letters credential, as an ambassador, envoy, or diplomatic agent; to authorize, as a messenger or delegate.<br>&nbsp;&nbsp;&nbsp;4. To believe; to put trust in.<br>&nbsp;&nbsp;&nbsp;5. To enter on the credit side of an account book.<br>&nbsp;&nbsp;&nbsp;6. To certify as meeting a predetermined standard; to certify an educational institution as upholding the specified standards necessary for the students to advance.<br>&nbsp;&nbsp;&nbsp;7. To recognize as outstanding.<br>&nbsp;&nbsp;&nbsp;8. To credit.<br>", "etymology": "First recorded in 1610–20; earlier acredit, from Middle French acrediter; ac-, credit", "example": "They would neither be required to be accredited nor report student results.", "synonym": "ascribe"}, {"word": "cubicle", "definitionA": "a small space or compartment partitioned off.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small separate part or one of the compartments of a room, especially in a work environment.<br>&nbsp;&nbsp;&nbsp;2. A small enclosure at a swimming pool etc. used to provide personal privacy when changing.<br>&nbsp;&nbsp;&nbsp;3. A small enclosure in a public toilet for individual use.<br>", "etymology": "1400–50; late Middle English < Latin cubiculum bedroom, equivalent to cub ( āre ) to lie down + -i- -i- + -culum -cle 2", "example": "Amazon officials said the structure is intended to be an alternative workspace, not a traditional office building, where employees would be able to air out ideas and find downtime beyond their cubicles.", "synonym": "cubbyhole"}, {"word": "succor", "definitionA": "help; relief; aid; assistance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Aid, assistance, or relief given to one in distress; ministration.<br>&nbsp;&nbsp;&nbsp;2. Aid or assistance in the form of military equipment and soldiers, especially reinforcements sent to support military action.<br>&nbsp;&nbsp;&nbsp;3. (obsolete except dialectal) Protection, refuge, shelter; a place providing such protection, refuge or shelter.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give aid, assistance, or help.<br>&nbsp;&nbsp;&nbsp;2. To provide aid or assistance in the form of military equipment and soldiers; in particular, for helping a place under siege.<br>&nbsp;&nbsp;&nbsp;3. (obsolete except dialectal) To protect, to shelter; to provide a refuge.<br>", "etymology": "1250–1300; (verb) Middle English sucuren from Old French suc(c)urre, socorre from Latin succurrere “to go beneath, run to help,” equivalent to suc- suc- + currere “to run” ( current ); (noun) Middle English soc(o)ur, back formation from sucurs (taken as plural) from Old French from Medieval Latin succursus, equivalent to Latin succur(rere) + -sus, var of -tus suffix of verbal action", "example": null, "synonym": "aid"}, {"word": "succumb", "definitionA": "to give way to superior force; yield:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To yield to an overpowering force or overwhelming desire.<br>&nbsp;&nbsp;&nbsp;2. To give up, or give in.<br>&nbsp;&nbsp;&nbsp;3. To die.<br>&nbsp;&nbsp;&nbsp;4. To overwhelm or bring down.<br>", "etymology": "First recorded in 1480–90; from Latin succumbere, from suc- suc- + -cumbere (derivative of cubāre “to lie down, recline”); incumbent", "example": "Altogether, the team watched the brain activity of 39 people as they grappled with sticking with their choice or succumbing to peer pressure.", "synonym": "accede"}, {"word": "valet", "definitionA": "a male servant who attends to the personal needs of his male employer, as by taking care of clothing or the like; manservant.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A man's personal male attendant, responsible for his clothes and appearance.<br>&nbsp;&nbsp;&nbsp;2. A hotel employee performing such duties for guests.<br>&nbsp;&nbsp;&nbsp;3. (professional wrestling) A female performer in professional wrestling, acting as either a manager or personal chaperone; often used to attract and titillate male members of the audience.<br>&nbsp;&nbsp;&nbsp;4. A female chaperone who accompanies a man, and is usually not married to him.<br>&nbsp;&nbsp;&nbsp;5. A person employed to clean or park cars.<br>&nbsp;&nbsp;&nbsp;6. A person employed to assist the jockey and trainer at a racecourse.<br>&nbsp;&nbsp;&nbsp;7. A wooden stand on which to hold clothes and accessories in preparation for dressing.<br>&nbsp;&nbsp;&nbsp;8. A kind of goad or stick with an iron point.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To serve (someone) as a valet.<br>&nbsp;&nbsp;&nbsp;2. To clean and service (a car), as a valet does.<br>&nbsp;&nbsp;&nbsp;3. To leave (a car) with a valet to park it.<br>", "etymology": "1560–70; < French; Middle French va ( s ) let squire, equivalent to vas- (< Medieval Latin vassus servant) + -let -let; vassal", "example": "While the speed limit, valet mode and sentry mode settings have been moved to a new category titled Security, which includes tips on how to use the Bluetooth, phone key and location services.", "synonym": "dresser"}, {"word": "varlet", "definitionA": "a knavish person; rascal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A servant or attendant.<br>&nbsp;&nbsp;&nbsp;2. Specifically, a youth acting as a knight's attendant at the beginning of his training for knighthood.<br>&nbsp;&nbsp;&nbsp;3. A rogue or scoundrel.<br>&nbsp;&nbsp;&nbsp;4. The jack.<br>", "etymology": "1425–75; late Middle English < Middle French; variant of valet", "example": "He had been regarding with interest a shackled-kneed varlet holding a halberd in his arms as if it had been a fractious bairn.", "synonym": "blackguard"}, {"word": "resuscitate", "definitionA": "to revive, especially from apparent death or from unconsciousness.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To restore consciousness, vigor, or life to.<br>&nbsp;&nbsp;&nbsp;2. To regain consciousness.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Restored to life.<br>", "etymology": "1525–35; < Latin resuscitātus (past participle of resuscitāre “to reawaken”), equivalent to re- re- + sus- sus- + cit(āre) “to move, arouse” ( cite 1 ) + -ātus -ate 1( def )", "example": "Klimas told the Blade he attempted to resuscitate Rieschick after calling 911.", "synonym": "arouse"}]