[{"word": "folly", "definitionA": "the state or quality of being foolish; lack of understanding or sense.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Foolishness.<br>&nbsp;&nbsp;&nbsp;2. Thoughtless action resulting in tragic consequence.<br>&nbsp;&nbsp;&nbsp;3. A fanciful building built for purely ornamental reasons.<br>", "etymology": "First recorded in 1175–1225; Middle English folie, from Old French, derivative of fol, fou “foolish, mad”; equivalent to fool 1 + -y 3( def )", "example": "If there is one book that captures the Vietnam War in the sheer Homeric scale of its passion and folly, this book is it.", "synonym": "daftness"}, {"word": "tamper", "definitionA": "to meddle, especially for the purpose of altering, damaging, or misusing (usually followed by with ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person or thing that tamps.<br>&nbsp;&nbsp;&nbsp;2. A tool used to tamp something down, such as tobacco in a pipe.<br>&nbsp;&nbsp;&nbsp;3. A railway vehicle used to tamp down ballast.<br>&nbsp;&nbsp;&nbsp;4. An envelope of neutron-reflecting material in a nuclear weapon, used to delay the expansion of the reacting material and thus produce a longer-lasting and more energetic explosion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make unauthorized or improper alterations, sometimes causing deliberate damage; to meddle (with something).<br>&nbsp;&nbsp;&nbsp;2. To try to influence someone, usually in an illegal or devious way; to try to deal (with someone).<br>&nbsp;&nbsp;&nbsp;3. To meddle (with something) in order to corrupt or pervert it.<br>&nbsp;&nbsp;&nbsp;4. To involve oneself (in a plot, scheme, etc.).<br>&nbsp;&nbsp;&nbsp;5. To attempt to practise or administer something (especially medicine) without sufficient knowledge or qualifications.<br>&nbsp;&nbsp;&nbsp;6. (in professional sports) To discuss future contracts with a player, against league rules.<br>", "etymology": "First recorded in 1560–70; probably variant of temper (verb)", "example": "There had been problems of a similar nature which were suspected to be tampering or minor mechanical issues.", "synonym": "busybody"}, {"word": "toiletry", "definitionA": "any article or preparation used in cleaning or grooming oneself, as soap or deodorant.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any item used for personal hygiene or grooming.<br>", "etymology": "First recorded in 1825–35; toilet + -ry", "example": "My comrades here say that I can request a toiletry item whenever I want.", "synonym": null}, {"word": "necrosis", "definitionA": "death of a circumscribed portion of animal or plant tissue.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The localized death of cells or tissues through injury, disease, or the interruption of blood supply.<br>", "etymology": "First recorded in 1655–65; from New Latin, from Greek nékrōsis “mortification, state of death”; necr-, -osis", "example": "Particularly effective are drugs like antitumor necrosis factor agents.", "synonym": "cessation"}, {"word": "consuetudinary", "definitionA": "customary or traditional.", "definitionB": "No definition found", "etymology": "1375–1425; late Middle English < Late Latin consuētūdinārius, equivalent to consuētūdin- (stem of consuētūdō ) consuetude + -ārius -ary", "example": "But revolutions have no customs: happily they have not been so frequent in history as to have induced any consuetudinary usage.", "synonym": null}, {"word": "praxis", "definitionA": "practice, as distinguished from theory; application or use, as of knowledge or skills.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The practical application of any branch of learning.<br>&nbsp;&nbsp;&nbsp;2. The deliberate action of a rational being.<br>&nbsp;&nbsp;&nbsp;3. The synthesis of theory and practice, without presuming the primacy of either.<br>&nbsp;&nbsp;&nbsp;4. Custom or established practice.<br>&nbsp;&nbsp;&nbsp;5. An example or form of exercise, or a collection of such examples, for practice.<br>", "etymology": "First recorded in 1575–85; from Medieval Latin, from Greek prâxis “act, action, deed,” from prāk-, base of prā́ssein “to do, fare” + -sis -sis", "example": "I talk in the book about Aristotle’s idea of two sorts of different work — praxis, work that you love doing for its own sake, so you don’t want a shortcut for that.", "synonym": "custom"}, {"word": "nephogram", "definitionA": "meteorol a photograph of a cloud", "definitionB": "No definition found", "etymology": null, "example": null, "synonym": null}, {"word": "nephograph", "definitionA": "an instrument for photographing clouds", "definitionB": "No definition found", "etymology": null, "example": null, "synonym": null}, {"word": "esophagus", "definitionA": "a muscular passage connecting the mouth or pharynx with the stomach in invertebrate and vertebrate animals; gullet.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The tube that carries food from the pharynx to the stomach.<br>", "etymology": "1350–1400; < New Latin oesophagus < Greek oisophágos gullet, literally, channel for eating ( oiso-, akin to oísein, future infinitive of phérein to carry + -phagos eating); replacing Middle English ysophagus < Medieval Latin", "example": "While useful for muscle pain, these can cause problems anywhere along the GI tract, from the esophagus to the colon.", "synonym": "craw"}, {"word": "gullet", "definitionA": "the esophagus.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The throat or esophagus.<br>&nbsp;&nbsp;&nbsp;2. The cytopharynx of a ciliate, through which food is ingested.<br>&nbsp;&nbsp;&nbsp;3. The space between the teeth of a saw blade.<br>&nbsp;&nbsp;&nbsp;4. A channel for water.<br>&nbsp;&nbsp;&nbsp;5. A preparatory cut or channel in excavations, of sufficient width for the passage of earth wagons.<br>&nbsp;&nbsp;&nbsp;6. The wide room under the pommel of a saddle, the hollow over the withers.<br>", "etymology": "1350–1400; Middle English golet < Old French goulet ≪ Latin gula throat; -et", "example": "Once the meal is partially in its mouth, a second set of jaws somewhere in the eel’s throat clamps down on the squid, pulling the food down the fish’s gullet.", "synonym": "craw"}, {"word": "auspice", "definitionA": "Usually auspices. patronage; support; sponsorship:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly in the plural) Patronage or protection.<br>&nbsp;&nbsp;&nbsp;2. An omen or a sign.<br>&nbsp;&nbsp;&nbsp;3. Divination from the actions of birds.<br>", "etymology": "First recorded in 1525–35; from French, from Latin auspicium “a bird-watching, divination from flight of birds,” equivalent to auspic- (stem of auspex ) + -ium -ium", "example": "A lateral move in the offing provides opportunity to trailblaze new frontiers under existing career auspice.", "synonym": "augury"}, {"word": "barb", "definitionA": "a point or pointed part projecting backward from a main point, as of a fishhook or arrowhead.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The point that stands backward in an arrow, fishhook, etc., to prevent it from being easily extracted. Hence: Anything which stands out with a sharp point obliquely or crosswise to something else.<br>&nbsp;&nbsp;&nbsp;2. A hurtful or disparaging remark.<br>&nbsp;&nbsp;&nbsp;3. A beard, or that which resembles it, or grows in the place of it.<br>&nbsp;&nbsp;&nbsp;4. Armor for a horse, corrupted from bard.<br>&nbsp;&nbsp;&nbsp;5. A horse.<br>&nbsp;&nbsp;&nbsp;6. One of the side branches of a feather, which collectively constitute the vane.<br>&nbsp;&nbsp;&nbsp;7. Any of various species of freshwater carp-like fish that have barbels and belong to the cyprinid family.<br>&nbsp;&nbsp;&nbsp;8. Menticirrhus americanus (Carolina whiting, king whiting, southern kingcroaker, and southern kingfish), found along the Atlantic and Gulf Coasts of the United States.<br>&nbsp;&nbsp;&nbsp;9. A hair or bristle ending in a double hook.<br>&nbsp;&nbsp;&nbsp;10. A blackish or dun variety of the pigeon, originally brought from Barbary.<br>&nbsp;&nbsp;&nbsp;11. A muffler, worn by nuns and mourners.<br>&nbsp;&nbsp;&nbsp;12. Paps, or little projections, of the mucous membrane, which mark the opening of the submaxillary glands under the tongue in horses and cattle. The name is mostly applied when the barbs are inflamed and swollen. [Written also barbel and barble.]<br>&nbsp;&nbsp;&nbsp;13. A bit for a horse.<br>&nbsp;&nbsp;&nbsp;14. A plastic fastener, shaped roughly like a capital I (with serifs), used to attach socks etc. to their packaging.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To furnish with barbs, or with that which will hold or hurt like barbs, as an arrow, fishhook, spear, etc.<br>&nbsp;&nbsp;&nbsp;2. To cover a horse in armor, corrupted from bard.<br>&nbsp;&nbsp;&nbsp;3. To cut (hair).<br>&nbsp;&nbsp;&nbsp;4. To shave or dress the beard of.<br>&nbsp;&nbsp;&nbsp;5. To clip; to mow.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The Barbary horse, a superior breed introduced from Barbary into Spain by the Moors.<br>&nbsp;&nbsp;&nbsp;2. A blackish or dun variety of pigeon, originally brought from Barbary.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A barbiturate.<br>", "etymology": "First recorded in 1350–1400; Middle English barbe “beard, pleated cloth, barb (of an arrow),” from Middle French, Old French barbe, from Latin barba beard", "example": "Wind barbs Wind barbs are the most visible portion of a station plot.", "synonym": "bristle"}]