[{"word": "dawdle", "definitionA": "to waste time; idle; trifle; loiter:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dawdler.<br>&nbsp;&nbsp;&nbsp;2. A slow walk, journey.<br>&nbsp;&nbsp;&nbsp;3. An easily accomplished task; a doddle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To spend time idly and unfruitfully, to waste time.<br>&nbsp;&nbsp;&nbsp;2. To spend (time) without haste or purpose.<br>&nbsp;&nbsp;&nbsp;3. To move or walk lackadaisically.<br>", "etymology": "First recorded in 1650–60; variant of daddle “to toddle”", "example": null, "synonym": "amble"}, {"word": "liability", "definitionA": "liabilities,", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An obligation, debt or responsibility owed to someone.<br>&nbsp;&nbsp;&nbsp;2. A handicap that holds something back, a drawback, someone or something that is a burden to whoever is required to take care of them; an individual or action that exposes others to greater risk.<br>&nbsp;&nbsp;&nbsp;3. The likelihood of something happening.<br>&nbsp;&nbsp;&nbsp;4. The condition of being susceptible to something.<br>", "etymology": "First recorded in 1785–95; li(able) + -ability", "example": null, "synonym": "amenability"}, {"word": "beckon", "definitionA": "to signal, summon, or direct by a gesture of the head or hand.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sign made without words; a beck.<br>&nbsp;&nbsp;&nbsp;2. A children's game similar to hide and seek in which children who have been \"caught\" may escape if they see another hider beckon to them.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To wave or nod to somebody with the intention to make the person come closer.<br>&nbsp;&nbsp;&nbsp;2. To seem attractive and inviting<br>", "etymology": "before 950; Middle English beknen, Old English gebē ( a ) cnian, derivative of bēacen beacon", "example": null, "synonym": "allure"}, {"word": "intercede", "definitionA": "to act or interpose in behalf of someone in difficulty or trouble, as by pleading or petition:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To plead on someone else's behalf.<br>&nbsp;&nbsp;&nbsp;2. To act as a mediator in a dispute; to arbitrate or mediate.<br>&nbsp;&nbsp;&nbsp;3. To pass between; to intervene.<br>", "etymology": "From the Latin word intercēdere, dating back to 1570–80. See inter-, cede", "example": "Navarro continued keeping Farrell at arm's length until others interceded and shuffled him away.", "synonym": "advocate"}, {"word": "theophany", "definitionA": "a manifestation or appearance of God or a god to a person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A manifestation of a deity to a person.<br>", "etymology": "1625–35; < Late Latin theophania < Late Greek theopháneia. See theo-, -phany", "example": null, "synonym": null}, {"word": "aspersion", "definitionA": "a damaging or derogatory remark or criticism; slander:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An attack on somebody's reputation or good name, often in the phrase to cast aspersions upon….<br>&nbsp;&nbsp;&nbsp;2. A sprinkling, especially of holy water.<br>&nbsp;&nbsp;&nbsp;3. (in plural) slander, calumny<br>", "etymology": "First recorded in 1570–80; from Latin aspersiōn- (stem of aspersiō ) “a sprinkling”; asperse, -ion", "example": null, "synonym": "abuse"}, {"word": "hyperboloid", "definitionA": "a quadric surface having a finite center and some of its plane sections hyperbolas. Equation: x 2 / a 2 + y 2 / b 2 − z 2 / c 2 = 1.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A particular surface in three-dimensional Euclidean space, the graph of a quadratic with all three variables squared and their coefficients not all of the same sign.<br>", "etymology": "First recorded in 1720–30; hyperbol(a) + -oid", "example": null, "synonym": null}, {"word": "parlay", "definitionA": "to bet or gamble (an original amount and its winnings) on a subsequent race, contest, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (originally United States) A bet or series of bets where the stake and winnings are cumulatively carried forward; an accumulator.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To carry forward the stake and winnings from a bet on to a subsequent wager or series of wagers.<br>&nbsp;&nbsp;&nbsp;2. (by extension) To increase (an asset, money, etc.) by gambling or investing in a daring manner.<br>&nbsp;&nbsp;&nbsp;3. (by extension, generally) To convert (a situation, thing, etc.) into something better.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a discussion, especially one between enemies.<br>", "etymology": "An Americanism first recorded in 1820–30; alteration of earlier paroli, from French, from Neapolitan Italian, plural of parolo, perhaps derivative of paro “equal,” from Latin pār; pair 1", "example": null, "synonym": "engineer"}, {"word": "parley", "definitionA": "a discussion or conference.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A conference, especially one between enemies.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a discussion, especially one between enemies.<br>", "etymology": "1400–50; late Middle English parlai < Middle French parlee, noun use of feminine of parle, past participle of parler to parle", "example": null, "synonym": "confab"}, {"word": "dismal", "definitionA": "causing gloom or dejection; gloomy; dreary; cheerless; melancholy:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Disappointingly inadequate.<br>&nbsp;&nbsp;&nbsp;2. Gloomy and bleak.<br>&nbsp;&nbsp;&nbsp;3. Depressing.<br>", "etymology": "First recorded in 1275–1325; Middle English dismale “unlucky time,” dismol day one of two days in each month considered unlucky (hence later taken as adjective), from Anglo-French dis mal, from Medieval Latin diēs malī, literally, “evil days”; diary ( def ), mal- ( def )", "example": "Kansas City's defence allowed them to see out the game, with Butker adding his third field goal before Fairbairn's dismal day continued.", "synonym": null}, {"word": "cuddle", "definitionA": "to hold close in an affectionate manner; hug tenderly; fondle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A snuggle; an affectionate embrace, often given to family members and close friends.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To embrace affectionately, lie together snugly.<br>&nbsp;&nbsp;&nbsp;2. To cradle in one's arms so as to give comfort, warmth.<br>&nbsp;&nbsp;&nbsp;3. To lie close or snug; to crouch; to nestle.<br>", "etymology": "1510–20; perhaps back formation from Middle English cudliche intimate, affectionate, Old English cūthlīc, or from Middle English cuthlechen, Old English cūthlǣcan to make friends with; couth 2, -ly", "example": null, "synonym": "bundle"}, {"word": "replicon", "definitionA": "any genetic element that can regulate and effect its own replication from initiation to completion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A DNA molecule or a region of DNA that replicates as an individual unit. A replicon may be, for instance, a chromosome, a plasmid or a phage.<br>", "etymology": "< French (1963), shortened form of réplication; -on 1", "example": null, "synonym": null}, {"word": "stymie", "definitionA": "to hinder, block, or thwart.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A situation where an opponent's ball is directly in the way of one's own ball and the hole, on the putting green (abolished 1952).<br>&nbsp;&nbsp;&nbsp;2. (by extension) An obstacle or obstruction.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To thwart or stump; to cause to fail or to leave hopelessly puzzled, confused, or stuck.<br>&nbsp;&nbsp;&nbsp;2. To bring into the position of, or impede by, a stymie.<br>", "etymology": "First recorded in 1855–60; origin uncertain", "example": null, "synonym": "balk"}, {"word": "foible", "definitionA": "a minor weakness or failing of character; slight flaw or defect:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quirk, idiosyncrasy, or mannerism; unusual habit or way (usage is typically plural), that is slightly strange or silly.<br>&nbsp;&nbsp;&nbsp;2. A weakness or failing of character.<br>&nbsp;&nbsp;&nbsp;3. Part of a sword between the middle and the point, weaker than the forte.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Weak; feeble.<br>", "etymology": "First recorded in 1640–50; from French, obsolete form of faible feeble", "example": null, "synonym": "characteristic"}, {"word": "brace", "definitionA": "something that holds parts together or in place, as a clasp or clamp.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Armor for the arm; vambrace.<br>&nbsp;&nbsp;&nbsp;2. A measurement of length, originally representing a person's outstretched arms.<br>&nbsp;&nbsp;&nbsp;3. A curved instrument or handle of iron or wood, for holding and turning bits, etc.; a bitstock.<br>&nbsp;&nbsp;&nbsp;4. That which holds anything tightly or supports it firmly; a bandage or a prop.<br>&nbsp;&nbsp;&nbsp;5. A cord, ligament, or rod, for producing or maintaining tension.<br>&nbsp;&nbsp;&nbsp;6. A thong used to regulate the tension of a drum.<br>&nbsp;&nbsp;&nbsp;7. The state of being braced or tight; tension.<br>&nbsp;&nbsp;&nbsp;8. Harness; warlike preparation.<br>&nbsp;&nbsp;&nbsp;9. A curved, pointed line, also known as \"curly bracket\": { or } connecting two or more words or lines, which are to be considered together, such as in {role, roll}; in music, used to connect staves.<br>&nbsp;&nbsp;&nbsp;10. A pair, a couple; originally used of dogs, and later of animals generally (e.g., a brace of conies) and then other things, but rarely human persons. (The plural in this sense is unchanged.) In British use (as plural), this is a particularly common reference to game birds.<br>&nbsp;&nbsp;&nbsp;11. A piece of material used to transmit, or change the direction of, weight or pressure; any one of the pieces, in a frame or truss, which divide the structure into triangular parts. It may act as a tie, or as a strut, and serves to prevent distortion of the structure, and transverse strains in its members. A boiler brace is a diagonal stay, connecting the head with the shell.<br>&nbsp;&nbsp;&nbsp;12. A rope reeved through a block at the end of a yard, by which the yard is moved horizontally; also, a rudder gudgeon.<br>&nbsp;&nbsp;&nbsp;13. The mouth of a shaft.<br>&nbsp;&nbsp;&nbsp;14. (chiefly in the plural) Straps or bands to sustain trousers; suspenders.<br>&nbsp;&nbsp;&nbsp;15. (plural in North America, singular or plural in the UK) A system of wires, brackets, and elastic bands used to correct crooked teeth or to reduce overbite.<br>&nbsp;&nbsp;&nbsp;16. Two goals scored by one player in a game.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To prepare for something bad, such as an impact or blow.<br>&nbsp;&nbsp;&nbsp;2. To place in a position for resisting pressure; to hold firmly.<br>&nbsp;&nbsp;&nbsp;3. To swing round the yards of a square rigged ship, using braces, to present a more efficient sail surface to the direction of the wind.<br>&nbsp;&nbsp;&nbsp;4. To stop someone for questioning, usually said of police.<br>&nbsp;&nbsp;&nbsp;5. To confront with questions, demands or requests.<br>&nbsp;&nbsp;&nbsp;6. To furnish with braces; to support; to prop.<br>&nbsp;&nbsp;&nbsp;7. To draw tight; to tighten; to put in a state of tension; to strain; to strengthen.<br>&nbsp;&nbsp;&nbsp;8. To bind or tie closely; to fasten tightly.<br>", "etymology": "First recorded in 1300–50; (for the noun) Middle English, from Anglo-French, Old French: “pair of arms,” from Latin brā(c)chia plural (taken as feminine singular) of brā(c)chium “arm” (from Greek; brachium ); (for the verb) in part Middle English bracen (from Anglo-French bracier, derivative of brace; embrace 1 ), in part derivative of the noun", "example": null, "synonym": "arm"}, {"word": "posse", "definitionA": "posse comitatus.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A group or company of people, originally especially one having hostile intent; a throng, a crowd.<br>&nbsp;&nbsp;&nbsp;2. A group of people summoned to help law enforcement.<br>&nbsp;&nbsp;&nbsp;3. A search party.<br>&nbsp;&nbsp;&nbsp;4. A criminal gang.<br>&nbsp;&nbsp;&nbsp;5. A group of (especially young) people seen as constituting a peer group or band of associates; a gang, a group of friends.<br>", "etymology": "First recorded in 1575–85; from Medieval Latin posse “power, force,” noun use of Latin infinitive: “to be able, have power,” contraction of potis “able” + esse “to be”; potent 1", "example": null, "synonym": "band"}, {"word": "virtuoso", "definitionA": "a person who has special knowledge or skill in a field.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An expert in virtù or art objects and antiquities; a connoisseur.<br>&nbsp;&nbsp;&nbsp;2. Someone with special skill or knowledge; an expert.<br>&nbsp;&nbsp;&nbsp;3. Specifically, a musician (or other performer) with masterly ability, technique, or personal style.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Exhibiting the ability of a virtuoso.<br>", "etymology": "1610–20; < Italian: versed, skilled < Late Latin virtuosus virtuous", "example": null, "synonym": "ace"}]