[{"word": "riparian", "definitionA": "of, relating to, or situated or dwelling on the bank of a river or other body of water:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person or other entity that lives or owns property along the shore of a river.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to the bank of a river or stream.<br>", "etymology": "1840–50; < Latin rīpāri ( us ) that frequents riverbanks ( rīp ( a ) bank of a river 1 + -ārius -ary ) + -an", "example": "Bosell was tasked with devising a temporary fix that would allow people back into the area for some much needed nature connection, but in a way that better managed impact on the fragile riparian environment.", "synonym": null}, {"word": "rheology", "definitionA": "the study of the deformation and flow of matter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The branch of physics that studies the deformation and flow of matter.<br>", "etymology": "First recorded in 1925–30; rheo- + -logy", "example": "Experts hailed from disciplines such as agronomy, exercise physiology, endocrinology, metabolomics, and rheology, among others.", "synonym": null}, {"word": "rhinal", "definitionA": "of or relating to the nose; nasal.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to the nose; nasal<br>&nbsp;&nbsp;&nbsp;2. Of or pertaining to those parts of the brain concerned with the sense of smell<br>", "etymology": "First recorded in 1860–65; rhin- + -al 1", "example": "The anterior rhinal fissure, which is present in the early human fœtus, vanishes (almost, if not altogether) in the adult.", "synonym": null}, {"word": "potamic", "definitionA": "of or relating to rivers.", "definitionB": "No definition found", "etymology": "1880–85; < Greek potam ( ós ) river + -ic", "example": null, "synonym": null}, {"word": "hippopotamus", "definitionA": "a large herbivorous mammal, Hippopotamus amphibius, having a thick hairless body, short legs, and a large head and muzzle, found in and near the rivers, lakes, etc., of Africa, and able to remain under water for a considerable time.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large, semi-aquatic, herbivorous (plant-eating) African mammal (Hippopotamus amphibius)<br>", "etymology": "1555–65; < Latin < Greek hippopótamos, earlier híppos potámios literally, riverine horse (term used by Herodotus in his account of the Egyptian hippopotamus); compare Middle English ypotame, ypotamos, ypotanus < Old French ypotame < Medieval Latin ypotamus", "example": "In the case of the hippopotamus, they cut channels through the mud to navigate between precious water and food sources.", "synonym": "elephant"}, {"word": "potamology", "definitionA": "the study of rivers.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The study of rivers.<br>", "etymology": "C19: from Greek potamos river + -logy", "example": null, "synonym": null}, {"word": "fluvial", "definitionA": "of or relating to a river:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, pertaining to, inhabiting, or produced by the action of a river or stream<br>", "etymology": "1350–1400; Middle English < Latin fluviālis, equivalent to fluvi ( us ) river (derivative of fluere to flow) + -ālis -al 1", "example": "At various points tributary gorges, the graves of fluvial gods who had perished long ago, opened into the main cañon.", "synonym": null}, {"word": "esoteric", "definitionA": "understood by or meant for only the select few who have special knowledge or interest; recondite:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An esoteric doctrine or treatise; esoteric philosophy.<br>&nbsp;&nbsp;&nbsp;2. One who believes, or is an initiate, in esoteric doctrines or rites.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Intended for or likely to be understood by only a small number of people with a specialized knowledge or interest, or an enlightened inner circle.<br>&nbsp;&nbsp;&nbsp;2. Having to do with concepts that are highly theoretical and without obvious practical application; often with mystical or religious connotations.<br>&nbsp;&nbsp;&nbsp;3. Confidential; private.<br>", "etymology": "First recorded in 1645–55; from Greek esōterikós “inner,” equivalent to esṓter(os) “inner” + -ikos -ic", "example": "It may sound like an esoteric problem, but a rapidly-spinning litter beneath a helicopter with a 74-year-old evacuee in it made news in 2019 in a video that will make you gasp.", "synonym": null}, {"word": "clement", "definitionA": "mild or merciful in disposition or character; lenient; compassionate:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lenient or merciful; charitable.<br>&nbsp;&nbsp;&nbsp;2. Mild (said of weather and similar circumstances).<br>", "etymology": "First recorded in 1425–75; late Middle English either from Old French or directly from Latin clēment-, stem of clēmēns “gentle, merciful”", "example": "“And at the end of the day, I think what it means to give somebody a constitutional right is that they don’t have to satisfy a government official that they have a really good need to exercise it or they face atypical risks,” Clement said.", "synonym": null}, {"word": "erudite", "definitionA": "characterized by great knowledge; learned or scholarly:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A learned or scholarly person<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Learned, scholarly, with emphasis on knowledge gained from books.<br>", "etymology": "First recorded in 1375–1425; late Middle English, from Latin ērudītus, equivalent to ērud(ē)- ( ē- intensive prefix + rud- “unformed, rough, rude”) + -ītus adjective suffix; e- 1, rude, -ite 2", "example": "A small group of us followed erudite and friendly seaweed expert Spencer Marley of Marley Family Seaweeds as he walked down a path and climbed over rocks, leading us to a remote beach where different types of seaweed can be found.", "synonym": null}, {"word": "menagerie", "definitionA": "a collection of wild or unusual animals, especially for exhibition.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection of live wild animals on exhibition; the enclosure where they are kept.<br>&nbsp;&nbsp;&nbsp;2. A diverse or miscellaneous group.<br>", "etymology": "1705–15; < French: literally, housekeeping. See ménage, -ery", "example": "To replace that functionality, Google’s engineers have marched out a menagerie of bird-themed acronyms like FLOC, FLEDGE and TURTLEDOVE to describe their proposals for advertising without cookies.", "synonym": "aquarium"}, {"word": "exoteric", "definitionA": "suitable for or communicated to the general public.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Suitable to be imparted to the public without secrecy or other reserves<br>&nbsp;&nbsp;&nbsp;2. (by extension) Accessible; capable of being readily or fully comprehended; or, having an obvious application<br>&nbsp;&nbsp;&nbsp;3. Public or popular; having wide currency<br>&nbsp;&nbsp;&nbsp;4. External<br>", "etymology": "First recorded in 1645–55; from Late Latin exōtericus “popular (e.g., of books), not technical or abstruse,” from Greek exōterikós “external, outside, popular,” equivalent to exṓter(os) “outer” (from exō- adverb and prefix + -teros comparative suffix also used for natural and complementary pairs) + -ikos adjective suffix; exo-, -ic", "example": "He had been appointed a committee-man, and said that he knew secrets of which the exoteric knew nothing.", "synonym": "extraterrestrial"}]