[{"word": "boulder", "definitionA": "a detached and rounded or worn rock, especially a large one.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large mass of stone detached from the surrounding land.<br>&nbsp;&nbsp;&nbsp;2. A particle greater than 256 mm in diameter, following the Wentworth scale<br>&nbsp;&nbsp;&nbsp;3. A large marble, in children's games.<br>&nbsp;&nbsp;&nbsp;4. A session of bouldering; involvement in bouldering.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To engage in bouldering.<br>", "etymology": "1610–20; short for boulder stone; Middle English bulderston < Scandinavian; compare dialectal Swedish bullersten big stone (in a stream), equivalent to buller rumbling noise (< Old Swedish bulder ) + sten stone", "example": "They found that boulders in this area showed bright veins, narrow in width but about a meter in length, similar to what’s found in other carbonaceous chondritic meteorites that have landed on Earth.", "synonym": "cromlech"}, {"word": "conviction", "definitionA": "a fixed or firm belief:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A firmly held belief.<br>&nbsp;&nbsp;&nbsp;2. A judgement of guilt in a court of law.<br>&nbsp;&nbsp;&nbsp;3. The state of being found or proved guilty.<br>&nbsp;&nbsp;&nbsp;4. The state of being wholly convinced.<br>", "etymology": "First recorded in 1400–50; late Middle English, from Late Latin convictiōn-, stem of convictiō “proof (of guilt)” from convict(us) “convinced, conquered” (past participle of convincere; convince ) + -iō -ion ( def )", "example": "Founders described needing conviction in their decisions and preserving carved out time for their own information processing.", "synonym": "creed"}, {"word": "luster", "definitionA": "the state or quality of shining by reflecting light; glitter, sparkle, sheen, or gloss:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Shine, polish or sparkle.<br>&nbsp;&nbsp;&nbsp;2. By extension, brilliance, attractiveness or splendor.<br>&nbsp;&nbsp;&nbsp;3. Refinement, polish or quality.<br>&nbsp;&nbsp;&nbsp;4. A candlestick, chandelier, girandole, etc. generally of an ornamental character.<br>&nbsp;&nbsp;&nbsp;5. A substance that imparts lustre to a surface, such as plumbago or a glaze.<br>&nbsp;&nbsp;&nbsp;6. Lusterware.<br>&nbsp;&nbsp;&nbsp;7. A fabric of wool and cotton with a lustrous surface, used for women's dresses.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To gleam, have luster.<br>&nbsp;&nbsp;&nbsp;2. To give luster, distinguish.<br>&nbsp;&nbsp;&nbsp;3. To give a coating or other treatment to impart physical luster.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lustrum, quinquennium, a period of five years, originally the interval between Roman censuses.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who lusts.<br>", "etymology": "First recorded in 1515–25; from Middle French lustre, from Italian lustro, derivative of lustrare “to polish, purify,” from Latin lūstrāre “to purify ceremonially,” derivative of lūstrum lustrum", "example": "Although he's soft spoken, Huerta's eyes are bold — brimming with emotion in one scene, then reflecting the dull luster of a traumatized mind in the next.", "synonym": "afterglow"}, {"word": "divestiture", "definitionA": "the act of divesting.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of divesting, or something divested.<br>&nbsp;&nbsp;&nbsp;2. The process of stripping away a person's confidence, values and attitudes in order to indoctrinate them into an organization.<br>", "etymology": "First recorded in 1595–1605; di- 2 + (in)vestiture", "example": "After publicly discussing the potential divestiture of Amobee late last year, Singtel has engaged the services of investment bank Moelis kicking off a process that could see it part ways with its ad tech subsidiary.", "synonym": "dispossession"}, {"word": "wither", "definitionA": "to shrivel; fade; decay:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shrivel, droop or dry up, especially from lack of water.<br>&nbsp;&nbsp;&nbsp;2. To cause to shrivel or dry up.<br>&nbsp;&nbsp;&nbsp;3. To lose vigour or power; to languish; to pass away.<br>&nbsp;&nbsp;&nbsp;4. To become helpless due to emotion.<br>&nbsp;&nbsp;&nbsp;5. To make helpless due to emotion.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Against, in opposition to.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To go against, resist; oppose.<br>", "etymology": "First recorded in 1250–1300; Middle English, perhaps variant of weather (verb)", "example": "Left to fight a losing battle in the Republican Party, as the recent CPAC confirmed, the withering pro-democracy faction is up against frightening odds.", "synonym": "blast"}, {"word": "anemia", "definitionA": "Pathology. a quantitative deficiency of the hemoglobin, often accompanied by a reduced number of red blood cells and causing pallor, weakness, and breathlessness.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A medical condition in which the capacity of the blood to transport oxygen to the tissues is reduced, either because of too few red blood cells, or because of too little hemoglobin, resulting in pallor and fatigue.<br>&nbsp;&nbsp;&nbsp;2. A disease or condition that has anemia as a symptom.<br>&nbsp;&nbsp;&nbsp;3. (obsolete) Ischemia.<br>", "etymology": "First recorded in 1800–10; from New Latin, from Greek anaimía “bloodlessness, lack of blood”; an- 1, -emia", "example": "Economists believe high rates of iron-deficiency anemia also have a macroeconomic effect, reducing individual productivity by as much as 40% and reducing GDP by over 1%.", "synonym": "chlorosis"}, {"word": "ethos", "definitionA": "Sociology. the fundamental character or spirit of a culture; the underlying sentiment that informs the beliefs, customs, or practices of a group or society; dominant assumptions of a people or period:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The character or fundamental values of a person, people, culture, or movement.<br>&nbsp;&nbsp;&nbsp;2. A form of rhetoric in which the writer or speaker invokes their authority, competence or expertise in an attempt to persuade others that their view is correct.<br>&nbsp;&nbsp;&nbsp;3. (aesthetics) The traits in a work of art which express the ideal or typic character, as influenced by the ethos (character or fundamental values) of a people, rather than realistic or emotional situations or individual character in a narrow sense; opposed to pathos.<br>", "etymology": "First recorded in 1850–55; from Latin ēthos “character, portrayal of character,” from Greek êthos “custom, habit, disposition character”", "example": "Her move also broke with the “own the libs” ethos of today’s GOP.", "synonym": "attitude"}, {"word": "levity", "definitionA": "lightness of mind, character, or behavior; lack of appropriate seriousness or earnestness.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lightness of manner or speech, frivolity; lack of appropriate seriousness; inclination to make a joke of serious matters.<br>&nbsp;&nbsp;&nbsp;2. Lack of steadiness.<br>&nbsp;&nbsp;&nbsp;3. The state or quality of being light, buoyancy.<br>&nbsp;&nbsp;&nbsp;4. A lighthearted or frivolous act.<br>", "etymology": "1555–65; < Latin levitās lightness, frivolity, equivalent to levi ( s ) light + -tās -ty 2", "example": "In any of my projects, I think if something is really deep or dramatic, I always try to make sure I find the levity in it.", "synonym": "absurdity"}, {"word": "groovy", "definitionA": "Slang. highly stimulating or attractive; excellent:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of, pertaining to, or having grooves.<br>&nbsp;&nbsp;&nbsp;2. Set in one's ways.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trendy and fashionable person.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Cool, neat, interesting, fashionable.<br>", "etymology": "First recorded in 1850–55; groove + -y 1", "example": "Relaxed drums and a jazzy guitar playing while singer Nick Carpenter croons about the monotony of the pandemic and missing an ex makes for a groovy song.", "synonym": null}, {"word": "sarcophagus", "definitionA": "a stone coffin, especially one bearing sculpture, inscriptions, etc., often displayed as a monument.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stone coffin, often inscribed or decorated with sculpture.<br>&nbsp;&nbsp;&nbsp;2. The cement and steel structure that encases the destroyed reactor at the power station in Chernobyl, Ukraine.<br>&nbsp;&nbsp;&nbsp;3. A kind of limestone used by the Greeks for coffins, so called because it was thought to consume the flesh of corpses.<br>&nbsp;&nbsp;&nbsp;4. An 18th-century form of wine cooler.<br>", "etymology": "1595–1605; < Latin < Greek sarkophágos, noun use of the adj.; sarcophagous", "example": "Then her body was dressed in her finest silks, draped with her most impressive jewels, and shelved away in a plain stone sarcophagus.", "synonym": "bin"}, {"word": "pathos", "definitionA": "the quality or power in an actual life experience or in literature, music, speech, or other forms of expression, of evoking a feeling of pity, or of sympathetic and kindly sorrow or compassion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality or property of anything which touches the feelings or excites emotions and passions, especially that which awakens tender emotions, such as pity, sorrow, and the like; contagious warmth of feeling, action, or expression; pathetic quality.<br>&nbsp;&nbsp;&nbsp;2. A writer or speaker's attempt to persuade an audience through appeals involving the use of strong emotions such as pity.<br>&nbsp;&nbsp;&nbsp;3. An author's attempt to evoke a feeling of pity or sympathetic sorrow for a character.<br>&nbsp;&nbsp;&nbsp;4. In theology and existentialist ethics following Kierkegaard and Heidegger, a deep and abiding commitment of the heart, as in the notion of \"finding your passion\" as an important aspect of a fully lived, engaged life.<br>&nbsp;&nbsp;&nbsp;5. Suffering; the enduring of active stress or affliction.<br>", "etymology": "First recorded in 1570–80; from Greek páthos “suffering, sensation, experience,” akin to páschein “to suffer, feel, be affected”; pathetic ( def )", "example": "Hall is another highlight, endowing an underwritten woman-scorned character with some real pathos.", "synonym": "desolation"}, {"word": "logos", "definitionA": "(often initial capital letter) Philosophy. the rational principle that governs and develops the universe.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A form of rhetoric in which the writer or speaker uses logic as the main argument.<br>&nbsp;&nbsp;&nbsp;2. Alternative letter-case form of Logos<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A visual symbol or emblem that acts as a trademark or a means of identification of a company or organization.<br>&nbsp;&nbsp;&nbsp;2. (by extension) An audio recording for the same purpose; a jingle.<br>&nbsp;&nbsp;&nbsp;3. A single graphic which contains one or more separate elements.<br>&nbsp;&nbsp;&nbsp;4. An ensign, a badge of office, rank, or power.<br>", "etymology": "First recorded in 1580–90; from Greek lógos “word, saying; speech, discourse; thought, reckoning; proportion, ratio,” derivative of légein “to choose, gather; recount, tell over, speak”; lection", "example": "If you have a Canva Pro subscription, you’ll have a Logos tab.", "synonym": null}, {"word": "blare", "definitionA": "to emit a loud, raucous sound:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A loud sound.<br>&nbsp;&nbsp;&nbsp;2. Dazzling, often garish, brilliance.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a loud sound.<br>&nbsp;&nbsp;&nbsp;2. To cause to sound like the blare of a trumpet; to proclaim loudly.<br>", "etymology": "1400–50; late Middle English bleren; akin to Middle Dutch blaren, Middle Low German blarren, Middle High German blerren ( German plärren )", "example": "A siren’s blare woke me, so loud it sounded like it was inside the room.", "synonym": "bellow"}, {"word": "blast", "definitionA": "a sudden and violent gust of wind:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A violent gust of wind.<br>&nbsp;&nbsp;&nbsp;2. A forcible stream of gas or liquid from an orifice, for example from a bellows, the mouth, etc.<br>&nbsp;&nbsp;&nbsp;3. A hit from a pipe.<br>&nbsp;&nbsp;&nbsp;4. The continuous blowing to which one charge of ore or metal is subjected in a furnace<br>&nbsp;&nbsp;&nbsp;5. The exhaust steam from an engine, driving a column of air out of a boiler chimney, and thus creating an intense draught through the fire; also, any draught produced by the blast.<br>&nbsp;&nbsp;&nbsp;6. An explosion, especially for the purpose of destroying a mass of rock, etc.<br>&nbsp;&nbsp;&nbsp;7. An explosive charge for blasting.<br>&nbsp;&nbsp;&nbsp;8. A loud, sudden sound.<br>&nbsp;&nbsp;&nbsp;9. A sudden, pernicious effect, as if by a noxious wind, especially on animals and plants; a blight.<br>&nbsp;&nbsp;&nbsp;10. A good time; an enjoyable moment.<br>&nbsp;&nbsp;&nbsp;11. A promotional message sent to an entire mailing list.<br>&nbsp;&nbsp;&nbsp;12. A flatulent disease of sheep.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make an impression on, by making a loud blast or din.<br>&nbsp;&nbsp;&nbsp;2. To make a loud noise.<br>&nbsp;&nbsp;&nbsp;3. To shatter, as if by an explosion.<br>&nbsp;&nbsp;&nbsp;4. To open up a hole in, usually by means of a sudden and imprecise method (such as an explosion).<br>&nbsp;&nbsp;&nbsp;5. To curse; to damn.<br>&nbsp;&nbsp;&nbsp;6. (sci-fi) To shoot, especially with an energy weapon (as opposed to one which fires projectiles).<br>&nbsp;&nbsp;&nbsp;7. To shoot; kick the ball in hope of scoring a goal.<br>&nbsp;&nbsp;&nbsp;8. To criticize or reprimand severely; to verbally discipline or punish.<br>&nbsp;&nbsp;&nbsp;9. To blight or wither.<br>&nbsp;&nbsp;&nbsp;10. To be blighted or withered.<br>&nbsp;&nbsp;&nbsp;11. To blow, for example on a trumpet.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly British) To show displeasure; damn<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An immature or undifferentiated cell (e.g., lymphoblast, myeloblast).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To run a nucleotide sequence (for nucleic acids) or an amino acid sequence (for proteins) through a BLAST (Basic Local Alignment Search Tool).<br>", "etymology": "First recorded before 1000; 1955–60  blast fordef 7a; Middle English (noun and verb); Old English blǣst (noun) “a blowing”; akin to Old Norse blāstr, Old High German blāst; blow 2", "example": "The blasts then spirited these isotopes away before additional nuclear reactions could destroy them.", "synonym": "bang"}, {"word": "cromlech", "definitionA": "(no longer in technical use) a megalithic chamber tomb.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dolmen or ancient underground tomb in Wales, usually made with stones disposed in a circular shape.<br>", "etymology": "1595–1605; < Welsh, equivalent to crom bent, curved, crooked (feminine of crwm ) + lech, combining form of llech flat stone", "example": "The old woman still sat on the cromlech, and when she saw me her voice rose afresh with more hard words, which I would not notice.", "synonym": "boulder"}]
