[{"word": "scud", "definitionA": "to run or move quickly or hurriedly.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of scudding.<br>&nbsp;&nbsp;&nbsp;2. Clouds or rain driven by the wind.<br>&nbsp;&nbsp;&nbsp;3. A loose formation of small ragged cloud fragments (or fog) not attached to a larger higher cloud layer.<br>&nbsp;&nbsp;&nbsp;4. A gust of wind.<br>&nbsp;&nbsp;&nbsp;5. A scab on a wound.<br>&nbsp;&nbsp;&nbsp;6. A small flight of larks, or other birds, less than a flock.<br>&nbsp;&nbsp;&nbsp;7. Any swimming amphipod.<br>&nbsp;&nbsp;&nbsp;8. A swift runner.<br>&nbsp;&nbsp;&nbsp;9. A form of garden hoe.<br>&nbsp;&nbsp;&nbsp;10. A slap; a sharp stroke.<br>&nbsp;&nbsp;&nbsp;11. Pornography.<br>&nbsp;&nbsp;&nbsp;12. The drink Irn-Bru.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To race along swiftly (especially used of clouds).<br>&nbsp;&nbsp;&nbsp;2. To run, or be driven, before a high wind with no sails set.<br>&nbsp;&nbsp;&nbsp;3. To hit or slap.<br>&nbsp;&nbsp;&nbsp;4. To speed.<br>&nbsp;&nbsp;&nbsp;5. To skim flat stones so they skip along the water.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Naked.<br>", "etymology": "First recorded in 1525–35; of obscure origin; possibly from Middle Low German or Middle Dutch schudden “to shake”", "example": "If they were, then we could all run out and purchase a tank, a grenade launcher, a bazooka, a SCUD missile and a nuclear warhead.", "synonym": "cloud"}, {"word": "incandescent", "definitionA": "(of light) produced by incandescence.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An incandescent lamp or bulb<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Emitting light as a result of being heated<br>&nbsp;&nbsp;&nbsp;2. Shining very brightly<br>&nbsp;&nbsp;&nbsp;3. Showing intense emotion, as of a performance, etc.<br>", "etymology": "1785–95; < Latin incandēscent- (stem of incandēscēns ), present participle of incandēscere to glow. See in- 2, candescent", "example": "Some bulbs mimic bright blue daylight, while others try to recreate the warm glow of incandescent bulbs.", "synonym": null}, {"word": "fallacious", "definitionA": "containing a fallacy; logically unsound:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Characterized by fallacy; false or mistaken.<br>&nbsp;&nbsp;&nbsp;2. Deceptive or misleading.<br>", "etymology": "First recorded in 1500–10, fallacious is from the Latin word fallāciōsus deceitful, deceptive. See fallacy, -ous", "example": "But such disparagement was itself a kneejerk reaction, and it was fallacious.", "synonym": null}, {"word": "disingenuous", "definitionA": "lacking in frankness, candor, or sincerity; falsely or hypocritically ingenuous; insincere:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not honourable; unworthy of honour<br>&nbsp;&nbsp;&nbsp;2. Not ingenuous; not frank or open<br>&nbsp;&nbsp;&nbsp;3. Assuming a pose of naïveté to make a point or for deception.<br>", "etymology": "First recorded in 1645–55; dis- 1 + ingenuous", "example": "To shield one’s pet hypothesis of an alien object by suggesting that it is not being taken seriously because of a flaw in how we do science is playing a disingenuous game with the facts.", "synonym": "artful"}, {"word": "altruistic", "definitionA": "unselfishly concerned for or devoted to the welfare of others ( egoistic ).", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Regardful of others; beneficent; unselfish<br>", "etymology": "First recorded in 1850–55; altru(ism) + -istic", "example": "Because while chimps can be altruistic, they’re responding to the immediate emotion.", "synonym": null}, {"word": "cubicle", "definitionA": "a small space or compartment partitioned off.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small separate part or one of the compartments of a room, especially in a work environment.<br>&nbsp;&nbsp;&nbsp;2. A small enclosure at a swimming pool etc. used to provide personal privacy when changing.<br>&nbsp;&nbsp;&nbsp;3. A small enclosure in a public toilet for individual use.<br>", "etymology": "1400–50; late Middle English < Latin cubiculum bedroom, equivalent to cub ( āre ) to lie down + -i- -i- + -culum -cle 2", "example": "Amazon officials said the structure is intended to be an alternative workspace, not a traditional office building, where employees would be able to air out ideas and find downtime beyond their cubicles.", "synonym": "cubbyhole"}, {"word": "candescent", "definitionA": "glowing; incandescent.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Glowing with heat; white-hot, incandescent<br>", "etymology": "1815–25; < Latin candēscent- (stem of candescēns, present participle of candēscere to become bright), equivalent to cand- bright ( candid ) + -ēscent- -escent", "example": "Then he saw, pale and candescent in the blackness, three or four great lilies, the authors of that perfume.", "synonym": null}, {"word": "oviparous", "definitionA": "producing eggs that mature and hatch after being expelled from the body, as birds, most reptiles and fishes, and the monotremes.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Egg-laying; depositing eggs that develop and hatch outside the body as a reproductive strategy.<br>", "etymology": "From the Latin word ōviparus, dating back to 1640–50. See ovi-, -parous", "example": "It is an oviparous animal, and its eggs scarcely exceed in size those of a goose.", "synonym": null}, {"word": "viviparous", "definitionA": "Zoology. bringing forth living young rather than eggs, as most mammals and some reptiles and fishes.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of an animal or animal species) Being born alive, as are most mammals, some reptiles, and a few fish (as opposed to being laid as an egg and subsequently hatching, as do most birds and many other species).<br>&nbsp;&nbsp;&nbsp;2. (of a plant or plant species) Arising from an embryo that develops from the outset (rather than from a true seed that then germinates).<br>", "etymology": "First recorded in 1640–50, viviparous is from the Latin word vīviparus bringing forth living young. See vivi-, -parous", "example": "The female is viviparous, and produces vast numbers of embryos, which appear in the circulating blood.", "synonym": null}, {"word": "follicle", "definitionA": "Anatomy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small cavity or sac, such as a hair follicle.<br>&nbsp;&nbsp;&nbsp;2. A type of primitive dry fruit produced by certain flowering plants.<br>", "etymology": "First recorded in 1640–50, follicle is from the Latin word folliculus small bag, shell, pod. See follis, -cle 1", "example": "The research team also detected the thick-thin skin variation before the embryos even developed hair follicles.", "synonym": "corpuscle"}, {"word": "ovulate", "definitionA": "to produce and discharge eggs from an ovary or ovarian follicle.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To produce eggs or ova<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Containing, or bearing, an ovule.<br>", "etymology": "First recorded in 1860–65; ovule + -ate 1", "example": "Some of us with two x-chromosomes might have done a pregnancy test or two, or needed to figure out when they’re ovulating, but there’s not much to that.", "synonym": null}]