[{"word": "shambles", "definitionA": "a place of great disorder", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To walk while shuffling or dragging the feet.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Work done in a poor fashion<br>&nbsp;&nbsp;&nbsp;2. A scene of great disorder or ruin<br>&nbsp;&nbsp;&nbsp;3. A great mess or clutter<br>&nbsp;&nbsp;&nbsp;4. A scene of bloodshed, carnage or devastation<br>&nbsp;&nbsp;&nbsp;5. A slaughterhouse<br>&nbsp;&nbsp;&nbsp;6. A butcher's shop<br>", "etymology": "C14 shamble table used by meat vendors, from Old English sceamel stool, from Late Latin scamellum a small bench, from Latin scamnum stool", "example": "And as a guarantee of a Third World economy in shambles, Scotland is oil-rich.", "synonym": "anarchy"}, {"word": "adjudicate", "definitionA": "to pronounce or decree by judicial sentence.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To settle a legal case or other dispute.<br>&nbsp;&nbsp;&nbsp;2. To act as a judge.<br>", "etymology": "First recorded in 1690–1700; from Latin adjūdicātus (past participle of adjūdicāre ); ad-, judge, -ate 1", "example": "The sciences, when they look at human thought, feeling, and behavior, do not appeal to philosophical ideas like good reasons for believing moral claims to be true, or attempt to adjudicate the soundness of moral arguments.", "synonym": "adjudge"}, {"word": "deliverance", "definitionA": "an act or instance of delivering.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Act of delivering or conveying something.<br>&nbsp;&nbsp;&nbsp;2. Delivery in childbirth.<br>&nbsp;&nbsp;&nbsp;3. Extrication from danger, imprisonment, rescue etc.<br>", "etymology": "1250–1300; Middle English deliveraunce < Old French delivrance, equivalent to delivr ( er ) to deliver + -ance -ance", "example": "Together, the trio finds ecstasy in small things—like homegrown tomatoes—and deliverance after brutal heartbreak.", "synonym": "acquittal"}, {"word": "stipulation", "definitionA": "a condition, demand, or promise in an agreement or contract.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of stipulating; a contracting or bargaining; an agreement.<br>&nbsp;&nbsp;&nbsp;2. Something that is stated or stipulated as a condition of an agreement.<br>&nbsp;&nbsp;&nbsp;3. The situation, arrangement, and structure of the stipules.<br>&nbsp;&nbsp;&nbsp;4. A goal to be achieved in a chess problem; for example, to checkmate Black within a specified number of moves.<br>", "etymology": "First recorded in 1545–55, stipulation is from the Latin word stipulātiōn- (stem of stipulātiō ). See stipulate 1, -ion", "example": "In an effort to ensure the federal money is distributed equitably, local governments have imposed a patchwork of stipulations.", "synonym": "agreement"}, {"word": "abysmal", "definitionA": "of or like an abyss; immeasurably deep or great.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to, or resembling an abyss.<br>&nbsp;&nbsp;&nbsp;2. Extremely bad; terrible.<br>", "etymology": "First recorded in 1650–60; abysm + -al 1", "example": "For decades, the world has turned a blind eye to India’s abysmal human rights record.", "synonym": null}, {"word": "lackluster ", "definitionA": "lacking lack brilliance or radiance; dull:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lack of brightness or points of interest.<br>&nbsp;&nbsp;&nbsp;2. A person or thing of no particular brilliance or intelligence.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking brilliance or intelligence.<br>&nbsp;&nbsp;&nbsp;2. Having no shine or lustre; dull.<br>&nbsp;&nbsp;&nbsp;3. Not exceptional; not worthy of special merit, attention, or interest; having no vitality.<br>", "etymology": "irst recorded in 1590–1600; lack + luster 1", "example": "Paris as depicted by contemporary photography appears… lackluster.", "synonym": null}, {"word": "verbatim ", "definitionA": "in exactly the same words; word for word:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A word-for-word report of a speech.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a document) Corresponding with the original word for word.<br>&nbsp;&nbsp;&nbsp;2. (of a person) Able to take down a speech word for word, especially in shorthand.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Word for word; in exactly the same words as were used originally.<br>&nbsp;&nbsp;&nbsp;2. Orally; verbally.<br>", "etymology": "irst recorded in 1475–85; from Medieval Latin verbātim, from verb(um) “word” + -ātim, adverb suffix", "example": "I have it on good authority these quotes are 100 percent accurate, if not 100 percent verbatim.", "synonym": null}, {"word": "aspersion ", "definitionA": "a damaging or derogatory remark or criticism; slander:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An attack on somebody's reputation or good name, often in the phrase to cast aspersions upon….<br>&nbsp;&nbsp;&nbsp;2. A sprinkling, especially of holy water.<br>&nbsp;&nbsp;&nbsp;3. (in plural) slander, calumny<br>", "etymology": "irst recorded in 1570–80; from Latin aspersiōn- (stem of aspersiō ) “a sprinkling”; asperse, -ion", "example": "And Tobin, by somehow completely ignoring the definition of the word \"aspersion,\" said this wasn't one.", "synonym": "abuse"}, {"word": "beguile", "definitionA": "to influence by trickery, flattery, etc.; mislead; delude.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deceive or delude (using guile).<br>&nbsp;&nbsp;&nbsp;2. To charm, delight or captivate.<br>&nbsp;&nbsp;&nbsp;3. To cause (time) to seem to pass quickly, by way of pleasant diversion.<br>", "etymology": "First recorded in 1175–1225, beguile is from the Middle English word bigilen. See be-, guile", "example": "Elicited by sunlight at dusk or dawn, and juxtaposed with more emphatic hues, shades of pink can beguile and tantalize.", "synonym": "betray"}, {"word": "minstrel", "definitionA": "a medieval poet and musician who sang or recited while accompanying himself on a stringed instrument, either as a member of a noble household or as an itinerant troubadour.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A medieval traveling entertainer who would sing and recite poetry, often to his own musical accompaniment.<br>&nbsp;&nbsp;&nbsp;2. One of a troupe of entertainers who wore black makeup (blackface) to present a so-called minstrel show, being a variety show of song, dance and banjo music.<br>", "etymology": "1175–1225; Middle English ministrel < Old French < Late Latin ministeriālis servant (noun use of adj.); ministerial", "example": "What kind of minstrel show he gave to win his freedom is not known.", "synonym": "balladeer"}, {"word": "numinous", "definitionA": "of, relating to, or like a numen; spiritual or supernatural.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to a numen (divinity); indicating the presence of a divinity.<br>&nbsp;&nbsp;&nbsp;2. Evoking a sense of the mystical, sublime, or transcendent; awe-inspiring.<br>", "etymology": "First recorded in 1640–50; from Latin nūmin- (stem of nūmen ) numen + -ous", "example": "My friend Brenda describes it as “numinous,” and that alone is reason to keep it even if it doesn’t fit this body.", "synonym": null}, {"word": "debilitate", "definitionA": "to make weak or feeble; enfeeble:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make feeble; to weaken.<br>", "etymology": "First recorded in 1525–35; from Latin dēbilitātus (past participle of dēbilitāre ), equivalent to dēbilit-, stem of dēbilis “weak” + -ātus -ate 1", "example": "A debilitating pandemic swept through the global economy, upending long-established ways of doing business.", "synonym": "blunt"}, {"word": "fungible", "definitionA": "Law, Commerce. (especially of goods) being of such nature or kind as to be freely exchangeable or replaceable, in whole or in part, for another of like nature or kind:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly in the plural) Any fungible item.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able to be substituted for something of equal value or utility; interchangeable, exchangeable, replaceable.<br>", "etymology": "First recorded in 1640–50; from Medieval Latin fungibilis, equivalent to Latin fung(ī) “to perform, discharge, execute” + -ibilis -ible", "example": "He posts videos mainly about the cryptocurrency market and non-fungible tokens and boasts about a quarter of a million followers.", "synonym": "convertible"}, {"word": "denouement ", "definitionA": "the final resolution of the intricacies of a plot, as of a drama or novel.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (authorship, often used metaphorically) The conclusion or resolution of a plot.<br>", "etymology": "irst recorded in 1745–55; from French: literally, “an untying,” equivalent to dénouer “to untie,” Old French desnoer ( des- + noer “to knot,” from Latin nōdāre, derivative of nōdus “knot”) + -ment; de-, -ment", "example": "For anyone who cared to watch, the event and its denouement provided a graphic demonstration that the Iron Curtain was crumbling.", "synonym": "close"}, {"word": "spontaneous ", "definitionA": "coming or resulting from a natural impulse or tendency; without effort or premeditation; natural and unconstrained; unplanned:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Self-generated; happening without any apparent external cause.<br>&nbsp;&nbsp;&nbsp;2. Done by one's own free choice, or without planning.<br>&nbsp;&nbsp;&nbsp;3. Proceeding from natural feeling or native tendency without external or conscious constraint<br>&nbsp;&nbsp;&nbsp;4. Arising from a momentary impulse<br>&nbsp;&nbsp;&nbsp;5. Controlled and directed internally; self-active; spontaneous movement characteristic of living things<br>&nbsp;&nbsp;&nbsp;6. Produced without being planted or without human cultivation or labor.<br>&nbsp;&nbsp;&nbsp;7. Random.<br>&nbsp;&nbsp;&nbsp;8. Sudden, without warning.<br>", "etymology": "irst recorded in 1650–60; from Late Latin spontāneus, equivalent to Latin spont(e) “willingly” + -āneus ( -ān(us) -an + -eus -eous )", "example": "The premise of the sketch was that sex was too spontaneous to be regulated, and the quiz show played that idea to the hilt.", "synonym": null}, {"word": "gauze", "definitionA": "any thin and often transparent fabric made from any fiber in a plain or open weave.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin fabric with a loose, open weave.<br>&nbsp;&nbsp;&nbsp;2. A similar bleached cotton fabric used as a surgical dressing.<br>&nbsp;&nbsp;&nbsp;3. A thin woven metal or plastic mesh.<br>&nbsp;&nbsp;&nbsp;4. Wire gauze, used as fence.<br>&nbsp;&nbsp;&nbsp;5. Mist or haze<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To apply a dressing of gauze<br>&nbsp;&nbsp;&nbsp;2. To mist; to become gauze-like.<br>", "etymology": "First recorded in 1555–65; from French gaze; ultimate origin unknown", "example": "Treated by an officer carrying the quick-clot gauze, the man survived a wound to the abdomen.", "synonym": "cast"}, {"word": "concupiscent", "definitionA": "lustful or sensual:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Amorous; lustful.<br>", "etymology": "First recorded in 1400–50; from Latin concupiscent- (stem of concupiscēns, present participle of concupiscere “to conceive an ardent desire for”), equivalent to concupere “to desire greatly” (equivalent of con- intensive prefix + cupere “to desire”) + -escent inchoative suffix; con-, -escent", "example": "It is true of cynical, profligate, and concupiscent art as well.", "synonym": null}, {"word": "irruption", "definitionA": "a breaking or bursting in; a violent incursion or invasion.", "definitionB": "No definition found", "etymology": "1570–80; < Latin irruptiōn- (stem of irruptiō ), equivalent to irrupt ( us ), past participle of irrumpere to burst into ( ir- 1, rupture ) + -iōn- -ion", "example": "He made but one fierce and rapid irruption into the neighborhood of the \"red sea,\" and returned sick and shuddering therefrom.", "synonym": "attack"}, {"word": "coruscate", "definitionA": "to emit vivid flashes of light; sparkle; scintillate; gleam:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give off light; to reflect in flashes; to sparkle.<br>&nbsp;&nbsp;&nbsp;2. To exhibit brilliant technique or style.<br>", "etymology": "First recorded in 1695–1705; from Latin coruscātus, past participle of coruscāre “to quiver, flash”; coruscant", "example": null, "synonym": "beam"}, {"word": "sniffle", "definitionA": "to sniff repeatedly, as from a head cold or in repressing tears:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act, or the sound of sniffling; the condition of having a runny or wet nose, as from a cold or allergies.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a whimpering or sniffing sound when breathing, because of a runny nose.<br>&nbsp;&nbsp;&nbsp;2. To utter with a whimpering or sniffing sound.<br>", "etymology": "First recorded in 1625–35; sniff + -le", "example": "Those cases can be as modest as a few days of sniffles, but, in other circumstances, can spawn debilitating headaches and fatigue.", "synonym": "blow"}, {"word": "ideate", "definitionA": "to form an idea, thought, or image of.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To apprehend in thought so as to fix and hold in the mind; to memorize.<br>&nbsp;&nbsp;&nbsp;2. To generate an idea.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Produced by an idea.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The actual existence supposed to correspond with an idea; the correlate in real existence to the idea as a thought or existence.<br>", "etymology": "First recorded in 1600–10; ide(a) + -ate 1", "example": null, "synonym": "analyze"}, {"word": "ethnocentric", "definitionA": "Sociology. demonstrating a belief in the inherent superiority of one’s own ethnic group or culture:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to ethnocentrism.<br>", "etymology": "ethno- ( def ) + -centric ( def )", "example": "Schools in Oregon and Washington now teach a nuanced story of cultural collision between ethnocentric missionaries and a small, panicked tribe.", "synonym": null}, {"word": "guidon", "definitionA": "a small flag or streamer carried as a guide, for marking or signaling, or for identification.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small pennant or banner carried by infantry soldiers to direct troop movement.<br>&nbsp;&nbsp;&nbsp;2. A soldier assigned to carry such a banner.<br>", "etymology": "1540–50; < Middle French < Italian guidone, equivalent to guid ( are ) to guide + -one noun suffix", "example": "We had H guidon with us which was one of the flags that was the first in Richmond.", "synonym": "banner"}, {"word": "fulvous", "definitionA": "tawny; dull yellowish-gray or yellowish-brown.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tawny-coloured.<br>", "etymology": "1655–65; < Latin fulvus deep yellow, tawny, reddish-yellow; -ous", "example": "They vary exceedingly in colour, and pass through the intermediate gradations from a dark brown to a pale fulvous, and a grayish.", "synonym": null}, {"word": "poseur", "definitionA": "a person who attempts to impress others by assuming or affecting a manner, degree of elegance, sentiment, etc., other than their true one.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who affects some behaviour, style, attitude or other condition, often to impress or influence others.<br>", "etymology": "From French, dating back to 1880–85; pose 1, -eur", "example": "The boxer with the moniker “Money” grasped that going a few rounds with this pugilistic poseur would deliver a Brinks truck of cash to his bank account.", "synonym": "hypocrite"}, {"word": "battologize", "definitionA": "to repeat (a word, phrase, mannerism, etc.) excessively.", "definitionB": "No definition found", "etymology": "First recorded in 1625–35; battolog(y) + -ize", "example": null, "synonym": null}, {"word": "wheedle", "definitionA": "to endeavor to influence (a person) by smooth, flattering, or beguiling words or acts:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A coaxing person.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cajole or attempt to persuade by flattery.<br>&nbsp;&nbsp;&nbsp;2. To obtain by flattery, guile, or trickery.<br>", "etymology": "First recorded in 1655–65; origin uncertain", "example": "Many times he would approach a patient and wheedle his great head under the patient's hand.", "synonym": "banter"}, {"word": "ferocious", "definitionA": "savagely fierce, as a wild beast, person, action, or aspect; violently cruel:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Marked by extreme and violent energy.<br>&nbsp;&nbsp;&nbsp;2. Extreme or intense.<br>", "etymology": "First recorded in 1640–50; from Latin ferōc-, stem of ferōx “savage, fierce” ( fer(us) “wild” ( feral 1, fierce ) + -ōx “having such an appearance”; akin to eye ( def ), oculus ( def ), -opsis ) + -ious", "example": "The four different creatures molds have ferocious detailed faces, foot handles, and reusable sticks.", "synonym": null}, {"word": "clamor", "definitionA": "a loud uproar, as from a crowd of people:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A great outcry or vociferation; loud and continued shouting or exclamation.<br>&nbsp;&nbsp;&nbsp;2. Any loud and continued noise.<br>&nbsp;&nbsp;&nbsp;3. A continued public expression, often of dissatisfaction or discontent; a popular outcry.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cry out and/or demand.<br>&nbsp;&nbsp;&nbsp;2. To demand by outcry.<br>&nbsp;&nbsp;&nbsp;3. To become noisy insistently.<br>&nbsp;&nbsp;&nbsp;4. To influence by outcry.<br>&nbsp;&nbsp;&nbsp;5. To silence.<br>", "etymology": "First recorded in 1350–1400; Middle English clamor (from Anglo-French ), from Latin, equivalent to clām- ( claim ) + -or -or 1; Middle English clamour, from Middle French, from Latin clāmōr- (stem of clāmor )", "example": "In the initial weeks of vaccinations, Maryland and Virginia gave about 16,000 doses to the District to cover such workers but have not provided more doses since as their own residents clamor for vaccinations.", "synonym": "babel"}, {"word": "quell", "definitionA": "to suppress; put an end to; extinguish:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A subduing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To subdue, to put down; to silence or force (someone) to submit.<br>&nbsp;&nbsp;&nbsp;2. To suppress, to put an end to (something); to extinguish.<br>&nbsp;&nbsp;&nbsp;3. To kill.<br>&nbsp;&nbsp;&nbsp;4. To be subdued or abated; to diminish.<br>&nbsp;&nbsp;&nbsp;5. To die.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A source, especially a spring.<br>&nbsp;&nbsp;&nbsp;2. An emotion or sensation which rises suddenly.<br>", "etymology": "First recorded before 900; Middle English quellen, Old English cwellan “to kill”; akin to Old Norse kvelja “to torment,” German quälen “to vex”; kill 1", "example": "The Terps’ tournament aspirations haven’t evaporated, but Maryland’s performance did little to quell the concerns brought on by its loss to Penn State on Friday.", "synonym": "kill"}, {"word": "analogous", "definitionA": "having analogy; corresponding in some particular:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having analogy; corresponding to something else; bearing some resemblance or proportion (often followed by \"to\".)<br>&nbsp;&nbsp;&nbsp;2. Functionally similar, but arising through convergent evolution rather than being homologous.<br>", "etymology": "First recorded in 1640–50; from Latin analogus, from Greek análogos “proportionate,” equivalent to ana- ana- + lógos “ratio”", "example": "Sharon Hood, a Forest Service research ecologist in Montana, explains that flora have immune systems analogous to those of fauna, and in fire-adapted ecosystems, fire stimulates that immunity.", "synonym": null}]