[{"word": "cochlea", "definitionA": "a spiral-shaped cavity forming a division of the internal ear in humans and in most other mammals.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The complex, spirally coiled, tapered cavity of the inner ear in which sound vibrations are converted into nerve impulses.<br>&nbsp;&nbsp;&nbsp;2. A spiral-shaped shell, especially that of a snail.<br>", "etymology": "1530–40; < Latin < Greek kochlíās snail (with spiral shell), screw, probably akin to kónchē conch", "example": "It’s the type IV collagen in the basement membrane of my cochlea, or inner ear, that is abnormal and contributes to sensorineural hearing loss.", "synonym": null}, {"word": "abet", "definitionA": "to encourage, support, or countenance by aid or approval, usually in wrongdoing:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Fraud or cunning.<br>&nbsp;&nbsp;&nbsp;2. An act of abetting; of helping; of giving aid.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To urge on, stimulate (a person to do) something desirable.<br>&nbsp;&nbsp;&nbsp;2. To incite; to assist or encourage by aid or countenance in crime.<br>&nbsp;&nbsp;&nbsp;3. To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action); to maintain.<br>&nbsp;&nbsp;&nbsp;4. To back up one's forecast of a doubtful issue, by staking money, etc., to bet.<br>", "etymology": "First recorded in 1275–1325; Middle English abette (source of Old French abeter, unless the latter, of Germanic origin, is the source of the Middle English), unattested Old English ābǣtan “to hound on,” equivalent to ā- a- 3 + bǣtan “to hunt, chase with dogs, pasture”; bait; akin to bite", "example": "A spokesperson for the department said the following day that the charge for the officer who observed the destruction was changed to aiding and abetting the crime, also a misdemeanor.", "synonym": "advocate"}, {"word": "groggy", "definitionA": "staggering, as from exhaustion or blows:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Slowed or weakened, as by drink, sleepiness, etc.<br>&nbsp;&nbsp;&nbsp;2. Of a horse: bearing wholly on its heels when trotting.<br>", "etymology": "First recorded in 1760–70; grog + -y 1", "example": "My alarm blares its generic Apple chime, and I keep hitting snooze—only to wake up groggy, drained, and unmotivated to make the most of the dwindling daylight.", "synonym": null}, {"word": "grog", "definitionA": "a mixture of rum and water, often flavored with lemon, sugar, and spices and sometimes served hot.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (original meaning) An alcoholic beverage made with rum and water, especially that once issued to sailors of the Royal Navy.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Any alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;3. A glass or serving of an alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;4. An alcoholic beverage made with hot water or tea, sugar and rum, sometimes also with lemon or lime juice and spices, particularly cinnamon.<br>&nbsp;&nbsp;&nbsp;5. A type of pre-fired clay that has been ground and screened to a specific particle size.<br>", "etymology": "1760–70; from Old Grog (alluding to his grogram cloak), the nickname of Edward Vernon (died 1757), British admiral, who in 1740 ordered the alcoholic mixture to be served, instead of pure spirits, to sailors.", "example": "If all this jesting and jousting about historically documented misogyny, maternal misery and decapitation isn’t your goblet of grog after a while, “Six” smartly pivots in the final wife’s number, “I Don’t Need Your Love.”", "synonym": "alcohol"}, {"word": "grogram", "definitionA": "a coarse fabric of silk, of silk and mohair or wool, or of wool, formerly in use.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A strong, rough fabric made up of a mixture of silk, and mohair or wool.<br>&nbsp;&nbsp;&nbsp;2. A garment made from this fabric.<br>", "etymology": "From Middle French gros grain, dating back to 1555–65. See grosgrain", "example": "Madam from the vicarage, in her grogram, learned in syrups, salves, and possets?", "synonym": null}, {"word": "grosgrain", "definitionA": "a heavy, corded ribbon or cloth of silk or rayon.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A silk fabric having narrow, horizontal ribs.<br>&nbsp;&nbsp;&nbsp;2. A close-woven fabric (usually made from silk or rayon) having narrow horizontal ribs.<br>&nbsp;&nbsp;&nbsp;3. A ribbon made of this fabric.<br>", "etymology": "First recorded in 1865–70, grosgrain is from French gros grain “large grain”", "example": "If I am remembering correctly, he wore a silk cravat overflowing a grosgrain waistcoat from his London tailor.", "synonym": null}, {"word": "grifter", "definitionA": "a person who operates a side show at a circus, fair, etc., especially a gambling attraction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A con artist; someone who pulls confidence games.<br>", "etymology": "First recorded in 1910–15; grift + -er 1", "example": "He does seem to have undergone several personal changes, picking up mixed martial arts fighting, dressing like an obnoxious dudebro — complete with gold chains — and talking like a masculinity grifter.", "synonym": "fraud"}, {"word": "ignoramus", "definitionA": "an extremely ignorant person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A totally ignorant person—unknowledgeable, uneducated, or uninformed; a fool.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A grand jury's ruling on an indictment when the evidence is determined to be insufficient to send the case to trial.<br>", "etymology": "1570–80; < Latin ignōrāmus we ignore (1st person plural present indicative of ignōrāre to be ignorant of, ignore ); hence name of an ignorant lawyer in the play Ignoramus (1615) by the English playwright G. Ruggle, whence current sense", "example": "It's a difficult discussion, because progressives are already constantly badgered by right-wing accusations that they're an \"elite\" who \"looks down\" at Trump voters as ignoramuses.", "synonym": "blockhead"}, {"word": "congruity ", "definitionA": "the state or quality of being congruous; harmony; appropriateness:", "definitionB": "No definition found", "etymology": "350–1400; Middle English congruite < Middle French < Late Latin congruitāt- (stem of congruitās ), equivalent to Latin congru ( us ) congruous + -itāt- -ity", "example": "This is neither a penalty nor the sole point of congruity \"FBoy Island\" shares with Grindr and the general outlook of dating app consumers, or even what makes the HBO Max series extraordinary.", "synonym": "accord"}, {"word": "swanky", "definitionA": "elegant or ostentatious; swank. swink.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An active and clever young fellow.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Poor thin beer or any sloppy drink, even sweetened water and vinegar.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Rather posh, elegant, ritzy.<br>", "etymology": "First recorded in 1835–45; swank 1 + -y 1", "example": "If you go to the location now, you’ll find a swanky clothing store and a shop that sells “bespoke,” and “sustainably sourced” hats.", "synonym": null}, {"word": "swank", "definitionA": "dashing smartness, as in dress or appearance; style.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fashionably elegant person.<br>&nbsp;&nbsp;&nbsp;2. Ostentation; bravado.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To swagger, to show off.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fashionably elegant, posh.<br>", "etymology": "1800–10; compare Scots swank lively, perhaps ultimately representing back formation from Old English swancor lithe; akin to Middle Dutch swanc supple, Middle High German swanken to sway", "example": "However, a Times report found it has instead generated billions of dollars’ worth of tax breaks for the wealthy often in pursuit of luxury high-rises, high-end hotels and swank office space.", "synonym": "absolute"}, {"word": "subpoena", "definitionA": "the usual writ for the summoning of witnesses or the submission of evidence, as records or documents, before a court or other deliberative body.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A writ requiring a defendant to appear in court to answer a plaintiff's claim.<br>&nbsp;&nbsp;&nbsp;2. A writ requiring someone to appear in court to give testimony.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To summon with a subpoena.<br>", "etymology": "First recorded in 1375–1425; late Middle English, from Latin sub poenā “under penalty” (the first words of the writ)", "example": "Earlier this summer, I was subpoenaed to watch it as part of a deposition in the civil suit.", "synonym": "command"}, {"word": "disdain", "definitionA": "to look upon or treat with contempt; despise; scorn.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A feeling of contempt or scorn.<br>&nbsp;&nbsp;&nbsp;2. That which is worthy to be disdained or regarded with contempt and aversion.<br>&nbsp;&nbsp;&nbsp;3. The state of being despised; shame.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To regard (someone or something) with strong contempt.<br>&nbsp;&nbsp;&nbsp;2. To be indignant or offended.<br>", "etymology": "First recorded in 1300–50; (for the verb) Middle English disdainen, from Anglo-French de(s)deigner, equivalent to dis- 1 + deign; noun derivative of the verb", "example": "\"Once again, Elon Musk and the Trump Administration have shown their utter disdain for federal employees and the critical services they provide to the American people,\" Everett Kelley, union president, said in a statement.", "synonym": "contumely"}, {"word": "hegemon", "definitionA": "a person, nation, etc., that has or exercises hegemony.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dominating leader or force, especially that which dominates a separate political entity; a hegemonist.<br>", "etymology": "First recorded in 1900–05, hegemon is from the Greek word hēgemṓn leader, guide", "example": "The U.S. has been the undisputed economic hegemon in Latin America for most of the region’s post-independence history.", "synonym": null}]