[{"word": "apologetic", "definitionA": "containing an apology or excuse for a fault, failure, insult, injury, etc.:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having the character of apology; regretfully excusing<br>&nbsp;&nbsp;&nbsp;2. Defending by words or arguments; said or written in defense.<br>", "etymology": "First recorded in 1400–50; late Middle English apologetik “a formal defense,” from Middle French or directly from Late Latin apologēticus “written defense, defensive,” Greek apologētikós “fit for defense,” equivalent to apologē- (variant stem of apologeîsthai “to speak in defense”; apologia ) + -tikos -tic", "example": "Unidentified students interviewed afterwards told reporters that the comedian seemed not necessarily apologetic about the controversy he had stirred.", "synonym": null}, {"word": "disburse", "definitionA": "to pay out (money), especially for expenses; expend.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pay out, expend; usually from a public fund or treasury.<br>", "etymology": "First recorded in 1520–30; from Middle French desbourser, Old French desborser, equivalent to des- dis- 1 + -borser, derivative of borse purse, from Late Latin bursa “bag”", "example": "It has already raised and disbursed several hundreds of thousands of dollars in grants to groups it has vetted.", "synonym": "acquit"}, {"word": "disabuse", "definitionA": "to free (a person) from deception or error.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To free (someone) of a misconception or misapprehension; to unveil a falsehood held by (somebody).<br>", "etymology": "From the French word désabuser, dating back to 1605–15. See dis- 1, abuse", "example": "Nothing could be farther from the truth, and a closer look at data can help disabuse us of this notion.", "synonym": "correct"}, {"word": "tardigrade", "definitionA": "Also called  bear animalcule, water bear. any microscopic, chiefly herbivorous invertebrate of the phylum Tardigrada, living in water, on mosses, lichens, etc.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sluggish; moving slowly.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A member of the animal phylum Tardigrada.<br>&nbsp;&nbsp;&nbsp;2. Sloth.<br>", "etymology": "First recorded in 1615–25, tardigrade is from the Latin word tardigradus slow-paced. See tardy, -grade", "example": "Likewise, space rocks flying around the solar system usually smash into planets and moons at thousands of meters per second — far too fast for tardigrades to survive.", "synonym": null}, {"word": "jounce", "definitionA": "to move joltingly or roughly up and down; bounce.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The fourth derivative of the position vector with respect to time; the time derivative of jerk.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To jolt; to shake, especially by rough riding or by driving over obstructions.<br>", "etymology": "1400–50; late Middle English; apparently blend of joll to bump (now obsolete) and bounce", "example": "Harvey Cheyne's wife, she was sick back, an' we did n't want to jounce her.", "synonym": "bounce"}, {"word": "mettle", "definitionA": "courage and fortitude:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quality of endurance and courage.<br>&nbsp;&nbsp;&nbsp;2. Good temperament and character.<br>&nbsp;&nbsp;&nbsp;3. Metal; a metallic substance.<br>", "etymology": "1575–85; spelling variant of metal, in metaphoric usages", "example": "Bryson DeChambeau to test his long-driving mettle in professional event after Ryder CupJust after midnight on the Saturday before the Masters, Rahm’s wife, Kelley, gave birth to the couple’s first child, a son they named Kepa.", "synonym": "animation"}, {"word": "beatify", "definitionA": "to make blissfully happy.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make blissful.<br>&nbsp;&nbsp;&nbsp;2. To pronounce or regard as happy, or supremely blessed, or as conferring happiness.<br>&nbsp;&nbsp;&nbsp;3. To carry out the third of four steps in canonization, making someone a blessed.<br>", "etymology": "First recorded in 1525–35; from Middle French beatifier, from Late Latin beātificāre; beatific ( def )", "example": "This tendency to beatify certain figures is something mainstream conservatives now share with extremist ideologies elsewhere.", "synonym": "deify"}, {"word": "yarmulke", "definitionA": "a skullcap worn by Orthodox Jewish males, also worn by most Conservative and some Reform Jewish males during prayer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A skullcap worn by religious Jewish males (especially during prayer).<br>", "etymology": "First recorded in 1845–50 as jarmolka; from Yiddish yarmlke, from Polish jarmułka, jamułka (earlier jałmurka, ) or Ukrainian yarmúlka, from Turkic; compare Turkish yağmurluk “rain gear,” equivalent to yağmur “rain” + -luk noun suffix; or from Medieval Latin almutia, armutia, aumucia, almucia “(furred) hood, hooded cape”; almuce ( def ), amice 2", "example": "That’s how he knows that of the 218 rabbis who delivered prayers in the “modern TV era,” 180 — 83 percent — wore yarmulkes.", "synonym": null}, {"word": "digress", "definitionA": "to deviate or wander away from the main topic or purpose in speaking or writing; depart from the principal line of argument, plot, study, etc.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To step or turn aside; to deviate; to swerve; especially, to turn aside from the main subject of attention, or course of argument, in writing or speaking.<br>&nbsp;&nbsp;&nbsp;2. To turn aside from the right path; to transgress; to offend.<br>", "etymology": "First recorded in 1520–30; from Latin dīgressus “departed,” past participle of dīgredī “to go off, depart, digress,” from dī- di- 2 + -gredī (combining form of gradī “to go”; grade )", "example": "Eszterhas describes how Gibson often would digress from the topic at hand to rant about Grigorieva.", "synonym": "aberrate"}, {"word": "plantigrade", "definitionA": "walking on the whole sole of the foot, as humans and bears.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A plantigrade animal; an animal that walks with the entire sole of the foot on the ground.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of an animal: walking with the entire sole of the foot on the ground.<br>", "etymology": "First recorded in 1825–35; from French plantigrade (noun), from New Latin plantigradus, equivalent to Latin plant(a) “sole of the foot” + -i- + -gradus; -i-, -grade", "example": "In considering this question, the first fact to appear is that the apes and lemurs are plantigrade animals.", "synonym": null}, {"word": "digitigrade", "definitionA": "walking on the toes, as most quadruped mammals.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly in the plural) A digitigrade animal; an animal that walks on its toes, such as a cat or a dog.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of an animal: walking on the toes, putting the weight of the body mainly on the ball of the foot, with the back of the foot, or heel, raised.<br>&nbsp;&nbsp;&nbsp;2. Of feet or a manner of walking: of, resembling, or pertaining to that of a digitigrade animal.<br>&nbsp;&nbsp;&nbsp;3. (specifically) Belonging to the Digitigrada of the taxonomic order Carnivora.<br>", "etymology": "From French, dating back to 1825–35; digiti-, -grade", "example": "It is digitigrade: it has five toes on the fore, and four toes on its hinder feet; its marsupial bones are simply rudimental.", "synonym": null}]