[{"word": "gluttony", "definitionA": "excessive eating and drinking.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The vice of eating to excess.<br>", "etymology": "First recorded in 1175–1225; Middle English glotonie, glutonie, from Old French glotonie; equivalent to glutton 1 + -y 3", "example": null, "synonym": "appetence"}, {"word": "esplanade ", "definitionA": "any open, level space, especially one serving for public walks or drives.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A clear space between a citadel and the nearest houses of the town.<br>&nbsp;&nbsp;&nbsp;2. The glacis of the counterscarp, or the slope of the parapet of the covered way toward the country.<br>&nbsp;&nbsp;&nbsp;3. A grass plat; a lawn.<br>&nbsp;&nbsp;&nbsp;4. Any clear, level space used for public walks or drives; especially, a terrace by the seaside.<br>", "etymology": "675–85; < French < Italian spianata, noun use of feminine past participle of spianare < Latin explānāre to level; -ade 1", "example": null, "synonym": "avenue"}, {"word": "ecstatic", "definitionA": "of, relating to, or characterized by ecstasy or a state of sudden, intense, overpowering emotion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (in the plural) Transports of delight; words or actions performed in a state of ecstasy.<br>&nbsp;&nbsp;&nbsp;2. A person in a state of ecstasy.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Feeling or characterized by ecstasy.<br>&nbsp;&nbsp;&nbsp;2. Extremely happy.<br>&nbsp;&nbsp;&nbsp;3. Relating to, or caused by, ecstasy or excessive emotion.<br>", "etymology": "First recorded in 1620–30; from Middle French extatique, and Medieval Latin ecstaticus, from Greek ekstatikós, derivative of ecstasy + -ic ( def )", "example": "But I can recall the ecstatic joy of going to the mailbox with my mother — or on her orders — because there was almost always a letter from someone.", "synonym": "crazy"}, {"word": "wuther", "definitionA": "(of wind) to blow fiercely.", "definitionB": "No definition found", "etymology": "1846; variant of dial. and Scots whither, Middle English ( Scots ) quhediren; compare Old Norse hvitha squall of wind", "example": null, "synonym": null}, {"word": "pelagic", "definitionA": "of or relating to the open seas or oceans.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any organism that lives in the open sea rather than in coastal or inland waters.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Living in the open sea rather than in coastal or inland waters.<br>&nbsp;&nbsp;&nbsp;2. Of or pertaining to oceans.<br>", "etymology": "1650–60; < Latin pelagicus < Greek pelagikós, equivalent to pélag ( os ) the sea + -ikos -ic", "example": "\"Higher swells, sea surface temperatures are much warmer and they're having difficulty getting flying fish now at the beginning of our pelagic season.\"", "synonym": null}, {"word": "amphigory", "definitionA": "a meaningless or nonsensical piece of writing, especially one intended as a parody.", "definitionB": "No definition found", "etymology": "First recorded in 1800–10; from French amphigouri, equivalent to amphi- a prefix meaning “two; both” ( amphi- ) + gouri; perhaps modeled on French equivalent of phantasmagoria", "example": null, "synonym": "balderdash"}, {"word": "phantasm", "definitionA": "an apparition or specter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something seen but having no physical reality; a phantom or apparition.<br>", "etymology": "First recorded in 1175–1225; from Latin phantasma, from Greek phántasma “image, vision” (akin to phantázein “to bring before the mind”); replacing Middle English fantesme, from Old French, from Latin as above", "example": null, "synonym": "apparition"}, {"word": "phantasmagoria", "definitionA": "a shifting series of phantasms, illusions, or deceptive appearances, as in a dream or as created by the imagination.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A popular 18th- and 19th-century form of theatre entertainment whereby ghostly apparitions are formed.<br>&nbsp;&nbsp;&nbsp;2. A series of events involving rapid changes in light intensity and colour.<br>&nbsp;&nbsp;&nbsp;3. A dreamlike state where real and imagined elements are blurred together.<br>", "etymology": "1795–1805; < French fantasmagorie, compound based on fantasme phantasm; second element perhaps representing Greek agorá assembly, gathering; -ia", "example": null, "synonym": "aberration"}, {"word": "ebony", "definitionA": "a hard, heavy, durable wood, most highly prized when black, from various tropical trees of the genus Diospyros, as D. ebenum of southern India and Sri Lanka, used for cabinetwork, ornamental objects, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hard, dense, deep black wood from various subtropical and tropical trees, especially of the genus Diospyros.<br>&nbsp;&nbsp;&nbsp;2. A tree that yields such wood.<br>&nbsp;&nbsp;&nbsp;3. A deep, dark black colour.<br>&nbsp;&nbsp;&nbsp;4. A black key on a piano or other keyboard instrument.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Made of ebony wood.<br>&nbsp;&nbsp;&nbsp;2. A deep, dark black colour.<br>&nbsp;&nbsp;&nbsp;3. Dark-skinned; black; especially in reference to African-Americans.<br>", "etymology": "First recorded in 1590–1600; earlier hebeny; ebon; -y perhaps after ivory", "example": null, "synonym": "jet"}, {"word": "pang", "definitionA": "a sudden feeling of mental or emotional distress or longing:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (often in the plural) A paroxysm of extreme physical pain or anguish; a feeling of sudden and transitory agony; a throe.<br>&nbsp;&nbsp;&nbsp;2. (often in the plural) A sudden sharp feeling of an emotional or mental nature, as of joy or sorrow.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cause to have great pain or suffering; to torment, to torture.<br>", "etymology": "First recorded in 1495–1505; origin uncertain", "example": null, "synonym": "bite"}, {"word": "prong", "definitionA": "one of the pointed tines of a fork.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin, pointed, projecting part, as of an antler or a fork or similar tool. A tine.<br>&nbsp;&nbsp;&nbsp;2. A branch; a fork.<br>&nbsp;&nbsp;&nbsp;3. The penis.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pierce or poke with, or as if with, a prong<br>", "etymology": "1400–50; late Middle English pronge, prange pain, affliction, pointed instrument; akin to Old Swedish prang gorge, narrow street, Middle Low German prange stake, prangen to press, Gothic anaprangan to oppress", "example": "A hospital near the border had already staked a fixator, a long metal rod with steel prongs on either end, into her leg to stabilize the bone and help control the bleeding.", "synonym": "fork"}]