[{"word": "wassail", "definitionA": "a salutation wishing health to a person, used in England in early times when presenting a cup of drink or when drinking to the person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A toast to health, usually on a festive occasion.<br>&nbsp;&nbsp;&nbsp;2. The beverage served during a wassail, especially one made of ale or wine flavoured with spices, sugar, roasted apples, etc.<br>&nbsp;&nbsp;&nbsp;3. Revelry.<br>&nbsp;&nbsp;&nbsp;4. A festive or drinking song or glee.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To toast, to drink to the health of another.<br>&nbsp;&nbsp;&nbsp;2. To drink wassail.<br>&nbsp;&nbsp;&nbsp;3. To go from house to house at Christmastime, singing carols.<br>", "etymology": "1175–1225; Middle English was-hail, equivalent to was be ( Old English wæs, variant of wes, imperative of wesan to be; akin to was ) + hail hale 1, in good health (< Old Norse heill hale); replacing Old English wæs hāl be hale or whole. See whole, heal", "example": "In apple-growing regions like Kent and Devonshire, farmers would additionally toast or salute the apple tree and pour wassail over its roots in preparation for a good harvest year.", "synonym": "bash"}, {"word": "hail", "definitionA": "to cheer, salute, or greet; welcome.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Balls or pieces of ice falling as precipitation, often in connection with a thunderstorm.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Of hail, to fall from the sky.<br>&nbsp;&nbsp;&nbsp;2. To send or release hail.<br>&nbsp;&nbsp;&nbsp;3. To pour down in rapid succession.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To greet; give salutation to; salute.<br>&nbsp;&nbsp;&nbsp;2. To name; to designate; to call.<br>&nbsp;&nbsp;&nbsp;3. To call out loudly in order to gain the attention of<br>&nbsp;&nbsp;&nbsp;4. To signal in order to initiate communication with.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Healthy, whole, safe.<br>", "etymology": "First recorded in 1150–1200; Middle English verb heilen, hailen, derivative of hail “healthy, sound,” from Old Norse heill; cognate with Old English hǣl; heal, wassail", "example": "Higgins, who hails from the Contra Costa County city of Pittsburg, was arrested on suspicion of organized retail theft, possession of stolen property and conspiracy.", "synonym": "broadside"}, {"word": "homophone", "definitionA": "Phonetics. a word pronounced the same as another but differing in meaning, whether spelled the same way or not, as heir and air.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A word which is pronounced the same as another word but differs in spelling or meaning or origin.<br>&nbsp;&nbsp;&nbsp;2. A letter or group of letters which are pronounced the same as another letter or group of letters.<br>", "etymology": "First recorded in 1615–25; back formation from homophonous", "example": "Maybe it’s not surprising that someone who named her nursery using a provocative homophone would advocate a bit of daring.", "synonym": null}, {"word": "frolic", "definitionA": "merry play; merriment; gaiety; fun.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Gaiety; merriment.<br>&nbsp;&nbsp;&nbsp;2. A playful antic.<br>&nbsp;&nbsp;&nbsp;3. A social gathering.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make merry; to have fun; to romp; to behave playfully and uninhibitedly.<br>&nbsp;&nbsp;&nbsp;2. To cause to be merry.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Merry, joyous, full of mirth; later especially, frolicsome, sportive, full of playful mischief.<br>&nbsp;&nbsp;&nbsp;2. Free; liberal; bountiful; generous.<br>", "etymology": "1530–40; < Dutch vrolijk joyful (cognate with German fröhlich ), equivalent to vro glad + -lijk -ly", "example": "He was born in the Santa Monica Mountains around 2010, and he must have had many adorable moments as a frolicking cub.", "synonym": "antic"}, {"word": "paraplegia", "definitionA": "paralysis of both lower limbs due to spinal disease or injury. Compare quadriplegia ( def ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A condition where the lower half of a patient's body is paralyzed and cannot move.<br>", "etymology": "First recorded in 1580–90; from New Latin, from Ionic Greek (Hippocrates) paraplēgíē; “hemiplegia”; para- 1, -plegia", "example": "The plaintiff, Darwin Boggs, has paraplegia and uses a wheelchair when traveling in public, the suit said.", "synonym": null}, {"word": "catechism", "definitionA": "an elementary book containing a summary of the principles of the Christian religion, especially as maintained by a particular church, in the form of questions and answers", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A book, in question and answer form, summarizing the basic principles of Christianity.<br>&nbsp;&nbsp;&nbsp;2. A basic manual in some subject.<br>&nbsp;&nbsp;&nbsp;3. A set of questions designed to determine knowledge.<br>", "etymology": "1495–1505; < Late Latin catēchismus apparently equivalent to catēch ( izāre ) to catechize + -ismus -ism", "example": "I’ve just spent a week tramping across Venice, a city of more than 250 churches, and where did I encounter the most doctrinaire catechism?", "synonym": "exam"}, {"word": "fulgent", "definitionA": "shining brightly; dazzling; resplendent:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Shining brilliantly; radiant.<br>", "etymology": "1375–1425; late Middle English < Latin fulgent- (stem of fulgēns, present participle of fulgēre ), equivalent to fulg- flash + -ent- -ent", "example": "Her voice was rich and fulgent, and she clasped her hands as if in supplication.", "synonym": null}, {"word": "festoon", "definitionA": "a string or chain of flowers, foliage, ribbon, etc., suspended in a curve between two points.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ornament such as a garland or chain which hangs loosely from two tacked spots.<br>&nbsp;&nbsp;&nbsp;2. A bas-relief, painting, or structural motif resembling such an ornament.<br>&nbsp;&nbsp;&nbsp;3. A raised cable with light globes attached.<br>&nbsp;&nbsp;&nbsp;4. A cloud on Jupiter that hangs out of its home belt or zone into an adjacent area forming a curved finger-like image or a complete loop back to its home belt or zone.<br>&nbsp;&nbsp;&nbsp;5. (acarology) Any of a series of wrinkles on the backs of some ticks.<br>&nbsp;&nbsp;&nbsp;6. A specific style of electric light bulb consisting of a cylindrical enclosure with two points of contact on either end providing power to the filament or diode.<br>&nbsp;&nbsp;&nbsp;7. Two sets of rollers used to create a buffer of material on web handling equipment.<br>&nbsp;&nbsp;&nbsp;8. Any of various papilionid butterflies of the genus Zerynthia.<br>&nbsp;&nbsp;&nbsp;9. Texturing applied to a denture to simulate human tissue.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To decorate with ornaments, such as garlands or chains, which hang loosely from two tacked spots.<br>&nbsp;&nbsp;&nbsp;2. To make festoons.<br>&nbsp;&nbsp;&nbsp;3. To decorate or bedeck abundantly.<br>&nbsp;&nbsp;&nbsp;4. To apply texturing to (a denture) to simulate human tissue.<br>", "etymology": "1670–80; < French feston < Italian festone decoration for a feast, derivative of festa festa", "example": "The massive crater left by the Beirut strike was lit up in red and festooned with Hezbollah flags.", "synonym": "garnish"}, {"word": "catechesis", "definitionA": "oral religious instruction, formerly especially before baptism or confirmation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Religious instruction given orally to catechumens.<br>", "etymology": "1745–55; < Late Latin < Greek katḗchēsis oral teaching, equivalent to katēchē- (variant stem of katēcheîn to teach by word of mouth; catechist ) + -sis -sis", "example": "He said it was written as a catechesis for teenagers, with the contributions of his young collaborators, and he improved them by providing “a little editing.”", "synonym": null}, {"word": "pivot", "definitionA": "a pin, point, or short shaft on the end of which something rests and turns, or upon and about which something rotates or oscillates.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thing on which something turns; specifically a metal pointed pin or short shaft in machinery, such as the end of an axle or spindle.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Something or someone having a paramount significance in a certain situation.<br>&nbsp;&nbsp;&nbsp;3. Act of turning on one foot.<br>&nbsp;&nbsp;&nbsp;4. The officer or soldier who simply turns in his place while the company or line moves around him in wheeling.<br>&nbsp;&nbsp;&nbsp;5. A player with responsibility for co-ordinating their team in a particular jam.<br>&nbsp;&nbsp;&nbsp;6. An element of a set to be sorted that is chosen as a midpoint, so as to divide the other elements into two groups to be dealt with recursively.<br>&nbsp;&nbsp;&nbsp;7. A pivot table.<br>&nbsp;&nbsp;&nbsp;8. Any of a row of captioned elements used to navigate to subpages, rather like tabs.<br>&nbsp;&nbsp;&nbsp;9. An element of a matrix that is used as a focus for row operations, such as dividing the row by the pivot, or adding multiples of the row to other rows making all other values in the pivot column 0.<br>&nbsp;&nbsp;&nbsp;10. A quarterback.<br>&nbsp;&nbsp;&nbsp;11. A shift during a general election in a political candidate's messaging to reflect plans and values more moderate than those advocated during the primary.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To turn on an exact spot.<br>&nbsp;&nbsp;&nbsp;2. To make a sudden or swift change in strategy, policy, etc.<br>", "etymology": "First recorded in 1350–1400; < French, Middle French, Old French “hinge, pivot”; further origin uncertain, perhaps related to Catalan piu, Occitan pivèu “spindle, pivot,” and Provençal pua “tooth on a heckle (flax comb)”", "example": "The trial pivoted on whether Darrow had finalized such a plan.", "synonym": "axle"}, {"word": "succulent ", "definitionA": "full of juice; juicy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A succulent plant.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Juicy or lush.<br>&nbsp;&nbsp;&nbsp;2. Luscious or delectable.<br>&nbsp;&nbsp;&nbsp;3. Having fleshy leaves or other tissues that store water.<br>", "etymology": "595–1605; < Late Latin sūculentus, equivalent to Latin sūc ( us ), succus juice + -ulentus -ulent", "example": "China has become a major source of demand for wild succulents in the last few years, but an internet campaign there to educate people about the illegal succulent trade has seen some results.", "synonym": "divine"}, {"word": "poach", "definitionA": "to cook (eggs, fish, fruits, etc.) in a hot liquid that is kept just below the boiling point.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of cooking in simmering liquid.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cook something in simmering liquid.<br>&nbsp;&nbsp;&nbsp;2. To be cooked in simmering liquid<br>&nbsp;&nbsp;&nbsp;3. To become soft or muddy.<br>&nbsp;&nbsp;&nbsp;4. To make soft or muddy.<br>&nbsp;&nbsp;&nbsp;5. To stab; to pierce; to spear, as fish.<br>&nbsp;&nbsp;&nbsp;6. To force, drive, or plunge into anything.<br>&nbsp;&nbsp;&nbsp;7. To begin and not complete.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of taking something unfairly, as in tennis doubles where one player returns a shot that their partner was better placed to return.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To take game or fish illegally.<br>&nbsp;&nbsp;&nbsp;2. To take anything illegally or unfairly.<br>&nbsp;&nbsp;&nbsp;3. To entice (an employee or customer) to switch from a competing company to one's own.<br>", "etymology": "First recorded in 1350–1400; Middle English noun poche “poached eggs (in sauce),” from Old French pochié, past participle of pochier “to bag (the yolk inside the white),” derivative of poche “bag, pocket,” from Middle Dutch poke poke 2", "example": "Abel is accused of using confidential company information to poach clients and lay the groundwork for a competing PR firm.", "synonym": "appropriate"}, {"word": "stymie", "definitionA": "to hinder, block, or thwart.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A situation where an opponent's ball is directly in the way of one's own ball and the hole, on the putting green (abolished 1952).<br>&nbsp;&nbsp;&nbsp;2. (by extension) An obstacle or obstruction.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To thwart or stump; to cause to fail or to leave hopelessly puzzled, confused, or stuck.<br>&nbsp;&nbsp;&nbsp;2. To bring into the position of, or impede by, a stymie.<br>", "etymology": "First recorded in 1855–60; origin uncertain", "example": "Ministers have insisted the move was necessary to put the country's finances on a firmer footing - but they have faced opposition criticism that the move will stymie efforts to boost the UK's economic fortunes.", "synonym": "balk"}, {"word": "despondency", "definitionA": "state of being despondent; depression of spirits from loss of courage or hope; dejection.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The loss of hope or confidence; despair or dejection.<br>&nbsp;&nbsp;&nbsp;2. A feeling of depression or disheartenment.<br>", "etymology": "First recorded in 1645–55; despond + -ency", "example": "Certainly, hope is an important psychological motivator for many people, and relying solely on doom-and-gloom messaging could push some people into despondency.", "synonym": "depression"}, {"word": "dispensation", "definitionA": "an act or instance of dispensing; distribution.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of dispensing or dealing out; distribution; often used of the distribution of good and evil by God to man, or more generically, of the acts and modes of his administration.<br>&nbsp;&nbsp;&nbsp;2. That which is dispensed, dealt out, or appointed; that which is enjoined or bestowed<br>&nbsp;&nbsp;&nbsp;3. A system of principles, promises, and rules ordained and administered; scheme; economy; as, the Patriarchal, Mosaic, and Christian dispensations.<br>&nbsp;&nbsp;&nbsp;4. The relaxation of a law in a particular case; permission to do something forbidden, or to omit doing something enjoined; specifically, in the Roman Catholic Church, exemption from some ecclesiastical law or obligation to God which a man has incurred of his own free will (oaths, vows, etc.).<br>", "etymology": "1325–75; Middle English dispensacioun < Medieval Latin dispēnsātiōn- (stem of dispēnsātiō ) a pardon, relaxation, Late Latin: order, system, divine grace, Latin: distribution, equivalent to dispēnsāt ( us ) (past participle of dispēnsāre to dispense; -ate 1 ) + -iōn- -ion", "example": "The study utilized data on drug prescriptions in the United Kingdom, and dispensation and self-reported data on drug use in Sweden, as well as electronic health records data for diagnoses.", "synonym": "allotment"}, {"word": "dispensable", "definitionA": "capable of being dispensed with or done without; not necessary or essential.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able to be done without; able to be expended; easily replaced.<br>&nbsp;&nbsp;&nbsp;2. Capable of being dispensed; distributable.<br>&nbsp;&nbsp;&nbsp;3. (of a law, rule, vow, etc.) Subject to dispensation; possible to relax, exempt from, or annul.<br>&nbsp;&nbsp;&nbsp;4. (nutrition, of an amino acid) Not essential to be taken in as part of an organism's diet, as it can be synthesized de novo.<br>", "etymology": "1525–35; < Medieval Latin dispēnsābilis, equivalent to Latin dispēns ( āre ) to distribute by weight ( dispense ) + -ābilis -able", "example": "\"Decision makers are content to let this continue. To them, Palestinians are dispensable.\"", "synonym": null}, {"word": "periphery", "definitionA": "the external boundary of any surface or area.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The outside boundary, parts or surface of something.<br>&nbsp;&nbsp;&nbsp;2. A first-rank administrative division of Greece, subdivided in provinces.<br>", "etymology": "First recorded in 1350–1400; from Late Latin peripherīa, from Greek periphéreia “circumference,” literally, “a bearing round,” from peri- peri- + phér(ein) “to bear” + -eia -y 3; replacing Middle English periferie, from Medieval Latin periferīa, variant spelling of Late Latin peripherīa", "example": "From that moment on she was always hanging around the periphery of Trump World in one way or another.", "synonym": "ambit"}, {"word": "ruff", "definitionA": "a neckpiece or collar of lace, lawn, or the like, gathered or drawn into deep, full, regular folds, worn in the 16th and 17th centuries.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A circular frill or ruffle on a garment, especially a starched, fluted frill at the neck in Elizabethan and Jacobean England (1560s–1620s).<br>&nbsp;&nbsp;&nbsp;2. Anything formed with plaits or flutings like a frill.<br>&nbsp;&nbsp;&nbsp;3. Senses relating to animals.<br>&nbsp;&nbsp;&nbsp;4. A collar on a shaft or other piece to prevent endwise motion.<br>&nbsp;&nbsp;&nbsp;5. An exhibition of haughtiness or pride.<br>&nbsp;&nbsp;&nbsp;6. Tumultuous or wanton conduct or procedure.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To shape (fabric, etc.) into a ruff; to adorn (a garment, etc.) with a ruff.<br>&nbsp;&nbsp;&nbsp;2. Of a falcon, hawk, etc.: to hit (the prey) without fixing or grabbing hold of it.<br>&nbsp;&nbsp;&nbsp;3. To ruffle; to disorder.<br>&nbsp;&nbsp;&nbsp;4. Of a bird: to ruffle its feathers.<br>&nbsp;&nbsp;&nbsp;5. To boast, to brag.<br>&nbsp;&nbsp;&nbsp;6. To speak in a loud and domineering manner; to bluster, to swagger.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Arripis georgianus, a fish found in cool waters off the southern coast of Australia; the Australian herring or tommy ruff.<br>&nbsp;&nbsp;&nbsp;2. A bottom-dwelling carnivorous fish of the family Sparidae found in temperate and tropical waters; a porgy or sea bream.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Gymnocephalus cernua, a small Eurasian freshwater fish.<br>&nbsp;&nbsp;&nbsp;2. Other species in the same genus.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An instance of ruffing, or an opportunity to ruff, when unable to follow suit.<br>&nbsp;&nbsp;&nbsp;2. A game similar to whist and its predecessor.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To play a trump card to a trick when unable to follow suit (that is, to play a card of the same suit as the previous or leading card).<br>&nbsp;&nbsp;&nbsp;2. Especially in the form ruff out: to defeat (a card, etc.) by ruffing, thus establishing the master card in the suit led.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low, vibrating beat of a drum, quieter than a roll; a ruffle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beat a ruff or ruffle, as on a drum.<br>&nbsp;&nbsp;&nbsp;2. Of a drum, etc.: to have a ruff or ruffle beaten on it.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. The bark of a dog; arf, woof.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not smooth; uneven.<br>&nbsp;&nbsp;&nbsp;2. Approximate; hasty or careless; not finished.<br>&nbsp;&nbsp;&nbsp;3. Turbulent.<br>&nbsp;&nbsp;&nbsp;4. Difficult; trying.<br>&nbsp;&nbsp;&nbsp;5. Crude; unrefined<br>&nbsp;&nbsp;&nbsp;6. Violent; not careful or subtle<br>&nbsp;&nbsp;&nbsp;7. Loud and hoarse; offensive to the ear; harsh; grating.<br>&nbsp;&nbsp;&nbsp;8. Not polished; uncut; said of a gem.<br>&nbsp;&nbsp;&nbsp;9. Harsh-tasting.<br>&nbsp;&nbsp;&nbsp;10. Somewhat ill; sick<br>&nbsp;&nbsp;&nbsp;11. Unwell due to alcohol; hungover<br>", "etymology": "First recorded in 1515–25; perhaps back formation from ruffle 1", "example": "A seductive dance in a see-through embroidered shirt, crimson ruff and gold leather belt allows George to beguile the king.", "synonym": "dicky"}, {"word": "gruff", "definitionA": "low and harsh; hoarse:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak gruffly.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having a rough, surly, and harsh demeanor and nature.<br>&nbsp;&nbsp;&nbsp;2. Hoarse-voiced.<br>", "etymology": "First recorded in 1525–35; from Middle Dutch grof “coarse”; cognate with German grob", "example": "\"Cyril\", as he is known to some, is said to be a portly man with a very gruff voice.", "synonym": null}, {"word": "magnate", "definitionA": "a person of great influence, importance, or standing in a particular enterprise, field of business, etc.:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Powerful industrialist; captain of industry.<br>&nbsp;&nbsp;&nbsp;2. A person of rank, influence or distinction in any sphere.<br>", "etymology": "1400–50; back formation from Middle English magnates (plural) < Late Latin magnātēs leading people, equivalent to Latin magn ( us ) magn- + -ātēs, plural of -ās noun suffix", "example": "All of these characters — even the more objectively callous ones like Father, a retired energy industry magnate writing a revisionist biography to absolve his culpability — teem with empathy.", "synonym": "bigwig"}, {"word": "lacuna", "definitionA": "a gap or missing part, as in a manuscript, series, or logical argument; hiatus.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small opening; a small pit or depression.<br>&nbsp;&nbsp;&nbsp;2. A small blank space; a gap or vacancy; a hiatus.<br>&nbsp;&nbsp;&nbsp;3. An absent part, especially in a book or other piece of writing, often referring to an ancient manuscript or similar.<br>&nbsp;&nbsp;&nbsp;4. Any gap, break, hole, or lack in a set of things; something missing.<br>&nbsp;&nbsp;&nbsp;5. A space visible between cells, allowing free passage of light.<br>&nbsp;&nbsp;&nbsp;6. A language gap, which occurs when there is no direct translation in the target language for a lexical term found in the source language.<br>", "etymology": "First recorded in 1655–65; from Latin lacūna “ditch, pit, hole, gap, deficiency,” akin to lacus “basin, tub, vat, lake”; lake 1. lagoon", "example": "This lacuna brings to mind the last words in my 2011 Death By China film uttered by former Congressman Dana Rohrabacher: “China has been treating us like fools. And that’s because we have been fools.”", "synonym": "break"}, {"word": "bereft", "definitionA": "a simple past tense and past participle of bereave.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deprive by or as if by violence; to rob; to strip; to benim.<br>&nbsp;&nbsp;&nbsp;2. To take away by destroying, impairing, or spoiling; take away by violence.<br>&nbsp;&nbsp;&nbsp;3. To deprive of power; prevent.<br>&nbsp;&nbsp;&nbsp;4. To take away someone or something that is important or close; deprive.<br>&nbsp;&nbsp;&nbsp;5. To destroy life; cut off.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a person) Pained by the loss of someone.<br>&nbsp;&nbsp;&nbsp;2. Deprived of, lacking, stripped of, robbed of.<br>", "etymology": "First recorded in 1525–35; be- + reft", "example": "\"It didn't strip the Syrian military of specific capabilities only - it sent it back to the starting line, bereft of any significant strategic capabilities,\" wrote Yoav Limor in the Israel Hayom newspaper.", "synonym": null}, {"word": "pew", "definitionA": "(in a church) one of a number of fixed, benchlike seats with backs, accessible by aisles, for the use of the congregation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One of the long benches in a church, seating several persons, usually fixed to the floor and facing the chancel.<br>&nbsp;&nbsp;&nbsp;2. An enclosed compartment in a church which provides seating for a group of people, often a prominent family.<br>&nbsp;&nbsp;&nbsp;3. Any structure shaped like a church pew, such as a stall, formerly used by money lenders, etc.; a box in a theatre; or a pen or sheepfold.<br>&nbsp;&nbsp;&nbsp;4. A chair; a seat.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To furnish with pews.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of disgust in response to an unpleasant odor.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Representative of the sound made by the firing of a gun.<br>", "etymology": "1350–1400; Middle English puwe < Middle French puie balcony < Latin podia, plural (taken as singular) of podium balcony. See podium", "example": "Producer Ted Dowd was forced to lie on the floor behind the pews and raise a biro every time John was supposed to hit the drum.", "synonym": "bench"}]