[{"word": "iota", "definitionA": "a very small quantity; jot; whit.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The ninth letter of the Greek alphabet.<br>&nbsp;&nbsp;&nbsp;2. A jot; a very small, insignificant quantity.<br>", "etymology": "1600–10; < Latin iōta < Greek iôta < Semitic; compare Hebrew yōdh yod", "example": null, "synonym": "atom"}, {"word": "fop", "definitionA": "a man who is excessively vain and concerned about his dress, appearance, and manners.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A vain man; a dandy.<br>", "etymology": "1400–50; late Middle English foppe, fop; akin to fob 2", "example": null, "synonym": "beau"}, {"word": "scintilla", "definitionA": "a minute particle; spark; trace:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small spark or flash.<br>&nbsp;&nbsp;&nbsp;2. A small or trace amount.<br>", "etymology": "1685–95; < Latin: spark", "example": "Once you’ve finished with your nostrils, you have to put the swab in and squeeze and swirl it at the same time, which requires just a scintilla more skill than the others.", "synonym": "atom"}, {"word": "scintillate", "definitionA": "to emit sparks.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give off sparks; to shine as if emanating sparks; to twinkle or glow.<br>&nbsp;&nbsp;&nbsp;2. To throw off like sparks.<br>", "etymology": "First recorded in 1615–25, scintillate is from the Latin word scintillātus (past participle of scintillāre to send out sparks, flash). See scintilla, -ate 1", "example": "Scintillate, scintillate, globule orific, Fain would I fathom thy nature's specific.", "synonym": "flash"}, {"word": "scintillation", "definitionA": "the act of scintillating; sparkling.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A flash of light; a spark.<br>&nbsp;&nbsp;&nbsp;2. The twinkling of a star or other celestial body caused by turbulence in the Earth's atmosphere.<br>&nbsp;&nbsp;&nbsp;3. The flash of light produced by something (especially a phosphor) when it absorbs ionizing radiation.<br>", "etymology": "First recorded in 1615–25, scintillation is from the Latin word scintillātiōn- (stem of scintillātiō ). See scintillate, -ion", "example": "Miriam retorted with the first scintillation of gaiety she had shown on this occasion.", "synonym": "beam"}, {"word": "scintillant", "definitionA": "scintillating; scintillating; sparkling.", "definitionB": "No definition found", "etymology": "First recorded in 1600–10, scintillant is from the Latin word scintillant- (stem of scintillāns, present participle of scintillāre to send out sparks; flash). See scintilla, -ant", "example": "He has spoken no musical thought, in all his long and scintillant career, that the world will long remember.", "synonym": "burnished"}, {"word": "fob", "definitionA": "a small pocket just below the waistline in pants, designed for a watch, keys, change, etc. Compare watch pocket ( def ).", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A little pocket near the waistline of a pair of trousers or in a waistcoat or vest to hold a pocketwatch; a watch pocket.<br>&nbsp;&nbsp;&nbsp;2. A short chain or ribbon to connect such a pocket to the watch.<br>&nbsp;&nbsp;&nbsp;3. A small ornament attached to such a chain. (See Usage Notes below)<br>&nbsp;&nbsp;&nbsp;4. A hand-held remote control device used to lock/unlock motor cars etc.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cheat, to deceive, to trick, to take in, to impose upon someone.<br>&nbsp;&nbsp;&nbsp;2. To beat; to maul.<br>", "etymology": "First recorded in 1645–55; origin uncertain; compare dialectal German Fuppe, Low German Fobke “pocket”", "example": "The plastic charging case checks in at roughly the same size as a car key fob.", "synonym": "buck"}, {"word": "hark", "definitionA": "to listen attentively; hearken.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (Scots) A whisper<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To listen attentively; often used in the imperative.<br>", "etymology": "1175–1225; Middle English herken, earlier herkien, Old English *heorcian; cognate with Old Frisian herkia, harkia; akin to Middle Dutch harken, Middle High German, German horchen. See hearken, hear", "example": null, "synonym": "listen"}, {"word": "hearken", "definitionA": "Literary. to give heed or attention to what is said; listen.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (obsolete except poetic) To hear (something) with attention; to have regard to (something).<br>&nbsp;&nbsp;&nbsp;2. To listen; to attend or give heed to what is uttered; to hear with attention, compliance, or obedience.<br>&nbsp;&nbsp;&nbsp;3. To enquire; to seek information.<br>", "etymology": "1150–1200; Middle English hercnen, Old English he ( o ) rcnian, suffixed form of assumed *heorcian; hark, -en 1", "example": "These non-aligned nations don’t hearken to America’s frequent invocation of the “free world.”", "synonym": "apprehend"}, {"word": "revanche", "definitionA": "the policy of a state intent on regaining areas of its original territory that have been lost to other states as a result of war, a treaty signed under duress, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Revenge or retaliation.<br>&nbsp;&nbsp;&nbsp;2. The political policy of regaining lost territory.<br>", "etymology": "1855–60; < French: revenge", "example": "En revanche, I am a feeble wretch, with eyes that threaten to get bloodshot on the slightest provocation.", "synonym": "counterblow"}, {"word": "stirpiculture", "definitionA": "the production of special stocks or strains by careful breeding.", "definitionB": "No definition found", "etymology": "1865–70, Americanism; < Latin stirpi- (stem of stirps ) stock, stem + culture", "example": "Stirpiculture in this extended sense was not unknown to the ancients, both in theory and in practice.", "synonym": null}, {"word": "sentient", "definitionA": "having the power of perception by the senses; conscious.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lifeform with the capability to feel sensation, such as pain.<br>&nbsp;&nbsp;&nbsp;2. An intelligent, self-aware being.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Experiencing sensation, thought, or feeling.<br>&nbsp;&nbsp;&nbsp;2. Able to consciously perceive through the use of sense faculties.<br>&nbsp;&nbsp;&nbsp;3. Possessing human-like awareness and intelligence.<br>", "etymology": "First recorded in 1595–1605; from Latin sentient-, stem of sentiēns “feeling,” present participle of sentīre “to feel” sense ( def )", "example": "And, of course, those people working in animal laboratories, animal research, they don’t want to think animals are sentient.", "synonym": null}, {"word": "pandemonium", "definitionA": "wild uproar or unrestrained disorder; tumult or chaos.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A place where all demons live; Hell.<br>&nbsp;&nbsp;&nbsp;2. Chaos; tumultuous or lawless violence.<br>&nbsp;&nbsp;&nbsp;3. An outburst; loud, riotous uproar, especially of a crowd.<br>", "etymology": "1660–70; after Pandaemonium, Milton's name in Paradise Lost for the capital of hell; pan-, demon, -ium", "example": "However, as the pandemonium across the SEO community indicates, this isn’t always the case in practice.", "synonym": "babel"}, {"word": "florist", "definitionA": "a retailer of flowers, ornamental plants, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who sells flowers.<br>&nbsp;&nbsp;&nbsp;2. A person who cultivates flowers.<br>&nbsp;&nbsp;&nbsp;3. A person who studies or writes about flowers.<br>&nbsp;&nbsp;&nbsp;4. A florist's shop.<br>", "etymology": "First recorded in 1615–25; flor- + -ist", "example": "An entire city full of restaurateurs, florists and others did the same.", "synonym": null}]
