[{"word": "infarction", "definitionA": "the formation of an infarct.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The process which causes an infarct.<br>&nbsp;&nbsp;&nbsp;2. An infarct.<br>", "etymology": "First recorded in 1680–90; infarct + -ion", "example": "The engorgement of the obstructed territory has received the name of hemorrhagic infarction.", "synonym": "bar"}, {"word": "myocardial", "definitionA": "of or relating to the muscular tissue of the heart", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to the myocardium, the thick muscular wall of the heart.<br>", "etymology": null, "example": "He finally died, after sixteen months, with all the symptoms of chronic myocardial insufficiency.", "synonym": null}, {"word": "farce", "definitionA": "a light, humorous play in which the plot depends upon a skillfully exploited situation rather than upon the development of character.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A style of humor marked by broad improbabilities with little regard to regularity or method.<br>&nbsp;&nbsp;&nbsp;2. A motion picture or play featuring this style of humor.<br>&nbsp;&nbsp;&nbsp;3. A situation abounding with ludicrous incidents.<br>&nbsp;&nbsp;&nbsp;4. A ridiculous or empty show.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Forcemeat, stuffing.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stuff with forcemeat.<br>&nbsp;&nbsp;&nbsp;2. To fill full; to stuff.<br>&nbsp;&nbsp;&nbsp;3. To make fat.<br>&nbsp;&nbsp;&nbsp;4. To swell out; to render pompous.<br>", "etymology": "First recorded in 1300–50; (for the noun) Middle English fars “stuffing,” from Middle French farce, from Vulgar Latin farsa (unrecorded), noun use of feminine of Latin farsus, earlier fartus “stuffed,” past participle of farcīre “to stuff”; (for the verb) Middle English farsen, from Old French farcir, from Latin farcīre", "example": "She’s since taken a diplomatic approach to this absolute farce, apologizing to her fans and sponsors, explaining her side to reporters, and doing everything she can to make sure she will get to race again.", "synonym": "buffoonery"}, {"word": "sepsis", "definitionA": "local or generalized invasion of the body by pathogenic microorganisms or their toxins:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A serious medical condition in which the whole body is inflamed, causing injury to its own tissues and organs as a response to infection.<br>", "etymology": "First recorded in 1855–60; from Greek sêpsis “decay”; compare sḗpein “to make rotten”", "example": "Former president Bill Clinton was discharged from the hospital Sunday, his medical team confirmed, five days after he was admitted for an infection of the bloodstream, a condition known as sepsis.", "synonym": null}, {"word": "scurry", "definitionA": "to go or move quickly or in haste.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dash.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To run with quick light steps, to scamper.<br>", "etymology": "First recorded in 1800–10; extracted from hurry-scurry", "example": "It has also caused a panicked scurry for antiviral drug remdesivir, which became a popular therapy option as India’s case count kept surging past all previous records.", "synonym": "barrel"}, {"word": "debauchery", "definitionA": "excessive indulgence in sensual pleasures; intemperance.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Indulgence in sensual pleasures; scandalous activities involving sex, alcohol, or drugs without inhibition.<br>&nbsp;&nbsp;&nbsp;2. Seduction from duty.<br>", "etymology": "First recorded in 1635–45; debauch + -ery", "example": "They woke up with missing tracks after a night of debauchery in the desert, reminded us to never send emails after recreational drug use, and kept it real about how things can change when your homegirl becomes a whole parent.", "synonym": "bender"}, {"word": "faux", "definitionA": "artificial or imitation; fake:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fake or artificial<br>", "etymology": "1670–80; < French; Old French fals < Latin falsus false", "example": "Things like wear and tear of fabric are less likely with quality mesh, leather, or faux leather.", "synonym": "counterfeit"}, {"word": "adjuvant", "definitionA": "serving to help or assist; auxiliary:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who helps or facilitates; an assistant, a helper.<br>&nbsp;&nbsp;&nbsp;2. Something that enhances the effectiveness of a medical treatment; a supplementary treatment.<br>&nbsp;&nbsp;&nbsp;3. An additive (as in a drug) that aids or modifies the action of the principal ingredient.<br>&nbsp;&nbsp;&nbsp;4. (pesticide science) An additive (often a separate product) that enhances the efficacy of pesticide products, but has little or no pesticidal activity itself.<br>&nbsp;&nbsp;&nbsp;5. A substance enhancing the immune response to an antigen.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Helping; helpful; assisting.<br>&nbsp;&nbsp;&nbsp;2. Designating a supplementary form of treatment, especially a cancer therapy administered after removal of a primary tumour.<br>", "etymology": "First recorded in 1570–80; from Latin adjuvant- (stem of adjuvāns, adjective use of present participle of adjuvāre ), equivalent to prefix ad- + juv- (stem of juvāre “to help”) + -ant; ad- ( def ), aid, -ant", "example": "Other vaccines, for example protein subunit types, make use of an adjuvant, which is a substance that jumpstarts the immune system.", "synonym": "accessory"}, {"word": "adjutant", "definitionA": "Military. a staff officer who assists the commanding officer in issuing orders.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lower-ranking officer who assists a higher-ranking officer with administrative affairs.<br>&nbsp;&nbsp;&nbsp;2. An assistant.<br>&nbsp;&nbsp;&nbsp;3. Any bird of the genus Leptoptilos, a branch of the stork family (Ciconiidae) native to India and Southeast Asia.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Assistant; who helps a higher-ranking officer.<br>", "etymology": "1590–1600; < Latin adjūtant- (stem of adjūtāns, present participle of adjūtāre to help, assist), equivalent to ad- ad- + jū- (variant stem of juvāre to help) + -t- frequentative suffix + -ant- -ant", "example": "The wartime state, along with legions of self-appointed adjutants, regularly reminded women that to “keep the home fires burning,” they had to stoke the coals of romance with regular loving letters to men in uniform.", "synonym": "aide"}, {"word": "debauch", "definitionA": "to corrupt by sensuality, intemperance, etc.; seduce.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An individual act of debauchery.<br>&nbsp;&nbsp;&nbsp;2. An orgy.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To morally corrupt (someone); to seduce.<br>&nbsp;&nbsp;&nbsp;2. To debase (something); to lower the value of (something).<br>&nbsp;&nbsp;&nbsp;3. To indulge in revelry.<br>", "etymology": "First recorded in 1585–95; from French débaucher “to entice away from duty, debauch,” Old French desbauchier “to disperse, scatter,” equivalent to des- dis- 1 + -bauchier, derivative of bauc, bauch beam (from Germanic; balcony, balk; compare French ébaucher “to rough-hew”); hence, presumably, “to hew (beams),” becoming “to split, separate,” becoming “to separate from work or duty”", "example": "The French House is an iconic Soho watering hole, scene of many an artistic, theatrical or literary debauch.", "synonym": "abuse"}, {"word": "balk", "definitionA": "to stop, as at an obstacle, and refuse to proceed or to do something specified (usually followed by at ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An uncultivated ridge formed in the open field system, caused by the action of ploughing.<br>&nbsp;&nbsp;&nbsp;2. The wall of earth at the edge of an excavation.<br>&nbsp;&nbsp;&nbsp;3. Beam, crossbeam; squared timber; a tie beam of a house, stretching from wall to wall, especially when laid so as to form a loft, \"the balks\".<br>&nbsp;&nbsp;&nbsp;4. A hindrance or disappointment; a check.<br>&nbsp;&nbsp;&nbsp;5. A sudden and obstinate stop; a failure.<br>&nbsp;&nbsp;&nbsp;6. An omission.<br>&nbsp;&nbsp;&nbsp;7. A deceptive motion; a feint.<br>&nbsp;&nbsp;&nbsp;8. The area of the table lying behind the line from which the cue ball is initially shot, and from which a ball in hand must be played.<br>&nbsp;&nbsp;&nbsp;9. The area of the table lying behind the baulk line.<br>&nbsp;&nbsp;&nbsp;10. The rope by which fishing nets are fastened together.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pass over or by.<br>&nbsp;&nbsp;&nbsp;2. To omit, miss or overlook by chance.<br>&nbsp;&nbsp;&nbsp;3. To miss intentionally; to avoid.<br>&nbsp;&nbsp;&nbsp;4. To stop, check, block.<br>&nbsp;&nbsp;&nbsp;5. To stop short and refuse to go on.<br>&nbsp;&nbsp;&nbsp;6. To refuse suddenly.<br>&nbsp;&nbsp;&nbsp;7. To disappoint; to frustrate.<br>&nbsp;&nbsp;&nbsp;8. To engage in contradiction; to be in opposition.<br>&nbsp;&nbsp;&nbsp;9. To leave or make balks in.<br>&nbsp;&nbsp;&nbsp;10. To leave heaped up; to heap up in piles.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To indicate to fishermen, by shouts or signals from shore, the direction taken by the shoals of herring.<br>", "etymology": "First recorded before 900; Middle English; Old English balca “covering, beam, ridge”; cognate with Old Norse bǫlkr “bar, partition,” Dutch balk, Old Saxon balko, German Balken, Old Norse bjalki “beam,” Old English bolca “plank”; perhaps akin to Latin sufflāmen, Slovenian blazína, Lithuanian balžíenas “beam.” See balcony", "example": "Sidebar: the Electoral College is the balk rule of government.", "synonym": "cramp"}, {"word": "waive", "definitionA": "to refrain from claiming or insisting on; give up; forgo:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To relinquish (a right etc.); to give up claim to; to forego.<br>&nbsp;&nbsp;&nbsp;2. To put aside, avoid.<br>&nbsp;&nbsp;&nbsp;3. To outlaw (someone).<br>&nbsp;&nbsp;&nbsp;4. To abandon, give up (someone or something).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move from side to side; to sway.<br>&nbsp;&nbsp;&nbsp;2. To stray, wander.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A woman put out of the protection of the law; an outlawed woman.<br>&nbsp;&nbsp;&nbsp;2. A waif; a castaway.<br>", "etymology": "First recorded in 1250–1300; Middle English weyven, from Anglo-French weyver “to make a homeless child (of someone) by forsaking or outlawing (that person)”; waif ( def )", "example": "Starting Monday, teams were able to start waiving players and making moves to reshape their rosters.", "synonym": "cede"}, {"word": "feckless", "definitionA": "ineffective; incompetent; futile:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking purpose.<br>&nbsp;&nbsp;&nbsp;2. Without skill, ineffective, incompetent.<br>&nbsp;&nbsp;&nbsp;3. Lacking the courage to act in any meaningful way.<br>&nbsp;&nbsp;&nbsp;4. Lacking vitality.<br>", "etymology": "First recorded in 1590–1600; originally Scots, from feck ( late Middle English ( Scots ) fek, shortened from effeck, Scots form of effect ) + -less", "example": "My “artist formerly known as Bill Cosby” thing feels especially feckless and mealymouthed now.", "synonym": null}, {"word": "fauces", "definitionA": "Anatomy. the cavity at the back of the mouth, leading into the pharynx.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The narrow passage from the mouth to the pharynx, situated between the soft palate and the base of the tongue.<br>&nbsp;&nbsp;&nbsp;2. The throat of a calyx, corolla, etc.<br>&nbsp;&nbsp;&nbsp;3. That portion of the interior of a spiral shell which can be seen by looking into the aperture.<br>", "etymology": "1375–1425; late Middle English < Latin", "example": "The mucous membranes become dry and insensitive, especially those of the fauces.", "synonym": "gorge"}]