[{"word": "eschatology ", "definitionA": "any system of doctrines concerning last, or final, matters, as death, the Judgment, the afterlife, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. System of doctrines concerning final matters, such as death.<br>&nbsp;&nbsp;&nbsp;2. The study of the end times — the end of the world, notably in Christian and Islamic theology, the second coming of Christ, the Apocalypse or the Last Judgment.<br>", "etymology": "irst recorded in 1835–45; from Greek éschato(s) “last” + -logy", "example": "Chávez imported more than just personnel and advice; he imported the Cuban Revolution's eschatology virtually whole.", "synonym": null}, {"word": "chthonian", "definitionA": "of or relating to the deities, spirits, and other beings dwelling under the earth.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dweller in the mythical underworld.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to the underworld; being beneath the earth.<br>", "etymology": "First recorded in 1840–50; from Greek chthóni(os) ( chthon-, stem of chthṓn “earth” + -ios adjective suffix) + -an; akin to Latin humus “earth” ( humus )", "example": "As a chthonian power, she is worshipped at the Samothracian mysteries, and is closely connected with Demeter.", "synonym": "lower"}, {"word": "infernal", "definitionA": "hellish; fiendish; diabolical:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An inhabitant of the infernal regions.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to hell, or the world of the dead; hellish.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Of or relating to a fire or inferno.<br>&nbsp;&nbsp;&nbsp;3. Stygian, gloomy.<br>&nbsp;&nbsp;&nbsp;4. Diabolical or fiendish.<br>&nbsp;&nbsp;&nbsp;5. (as an expletive, not vulgar) Very annoying; damned.<br>", "etymology": "First recorded in 1325–75; Middle English, from Late Latin infernālis, equivalent to Latin infern(us) “situated below, of the underworld” ( inferior ) + -ālis -al 1", "example": "Today’s jet engines are built of superalloys, which can withstand infernal temperatures.", "synonym": "lower"}, {"word": "interdict", "definitionA": "Civil Law. any prohibitory act or decree of a court or an administrative officer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A papal decree prohibiting the administration of the sacraments from a political entity under the power of a single person (e.g., a king or an oligarchy with similar powers). Extreme unction/Anointing of the Sick is excepted.<br>&nbsp;&nbsp;&nbsp;2. An injunction.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To exclude (someone or somewhere) from participation in church services; to place under a religious interdict.<br>&nbsp;&nbsp;&nbsp;2. To forbid (an action or thing) by formal or legal sanction.<br>&nbsp;&nbsp;&nbsp;3. To forbid (someone) from doing something.<br>&nbsp;&nbsp;&nbsp;4. To impede (an enemy); to interrupt or destroy (enemy communications, supply lines etc).<br>", "etymology": "First recorded in 1250–1300; (noun) from Latin interdictum “prohibition,” noun use of neuter of interdictus, past participle of interdīcere “to forbid,” equivalent to inter- “between, among, together” + -dic- (variant stem of dīcere “to speak”) + -tus past participle suffix; replacing Middle English enterdit, from Old French, from Latin, as above; (verb) from Latin interdictus; replacing Middle English enterditen, from Old French entredire (past participle entredit ), from Latin, as above; inter-", "example": "Foreign security sector support can and should include efforts to interdict poachers.", "synonym": "ban"}, {"word": "forlorn", "definitionA": "desolate or dreary; unhappy or miserable, as in feeling, condition, or appearance.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To abandon, forsake.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A forlorn hope.<br>&nbsp;&nbsp;&nbsp;2. A member of a forlorn hope.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abandoned, deserted, left behind.<br>&nbsp;&nbsp;&nbsp;2. Miserable, as when lonely after being abandoned.<br>&nbsp;&nbsp;&nbsp;3. Unlikely to succeed; hopeless.<br>", "etymology": "First recorded before 1150; Middle English foreloren “lost completely,” past participle of forlesen “to lose completely,” Old English forlēosan; cognate with Old High German firliosan ( German verlieren ), Gothic fraliusan; equivalent to for- + lorn", "example": "Each mini-chapter here begins with a question, followed by what feels like a personal answer written specifically to the forlorn rather than to the world — in a story, really, but one that’s relatable.", "synonym": null}, {"word": "jumble", "definitionA": "to mix in a confused mass; put or throw together without order:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mixture of unrelated things.<br>&nbsp;&nbsp;&nbsp;2. Items for a rummage sale.<br>&nbsp;&nbsp;&nbsp;3. A rummage sale.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mix or confuse.<br>&nbsp;&nbsp;&nbsp;2. To meet or unite in a confused way.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small, thin, sugared cake, usually ring-shaped.<br>", "etymology": "1520–30; perhaps blend of joll to bump (now dial.) and tumble", "example": "When tested on a jumble of polyethylene, PET and EVOH beads, the solvent washes recovered more than 95 percent of each material — hinting that these solvents could be used to strip plastic components off bulkier items than packaging films.", "synonym": "chaos"}, {"word": "distraught ", "definitionA": "distracted; deeply agitated.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Deeply hurt, saddened, or worried; distressed.<br>&nbsp;&nbsp;&nbsp;2. Mad; insane.<br>", "etymology": "irst recorded in 1350–1400; Middle English variant of obsolete distract “distracted,” by association with straught, old past participle of stretch; distract", "example": "Distraught, confused and ashamed, both men broke down in the courtroom, weeping like children and begging for forgiveness.", "synonym": null}, {"word": "eureka", "definitionA": "(initial capital letter) I have found (it): the reputed exclamation of Archimedes when, after long study, he discovered a method of detecting the amount of alloy mixed with the gold in the crown of the king of Syracuse.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An alloy of copper and nickel whose resistivity is constant over a wide temperature range<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An exclamation indicating sudden discovery.<br>", "etymology": "1560–70; < Greek heúrēka, 1st person singular perfect indicative of heurískein to find, discover", "example": "That decades-long durability makes it a hard product to beat, but if you’re looking to cut the size of your stove, Eureka!", "synonym": "abruptness"}, {"word": "plunger", "definitionA": "Machinery. a pistonlike reciprocating part moving within the cylinder of a pump or hydraulic device.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device that is used to remove blockages from the drain of a basin or tub, by suction.<br>&nbsp;&nbsp;&nbsp;2. The internal piece of a syringe that pushes out or pulls in any contents.<br>&nbsp;&nbsp;&nbsp;3. The sliding activator of an exploder, an electrical generator used to trigger electrical detonators such as blasting caps.<br>&nbsp;&nbsp;&nbsp;4. The part of a cafetière that is pushed down to remove grounds from coffee.<br>&nbsp;&nbsp;&nbsp;5. One who plunges; a diver.<br>&nbsp;&nbsp;&nbsp;6. A horse that plunges, or throws itself suddenly forward.<br>&nbsp;&nbsp;&nbsp;7. A cavalryman.<br>&nbsp;&nbsp;&nbsp;8. A device similar to a piston but without a mechanism; a long solid cylinder used, instead of a piston or bucket, as a forcer in pumps.<br>&nbsp;&nbsp;&nbsp;9. The moving portion of a solenoid.<br>&nbsp;&nbsp;&nbsp;10. The spring-loaded assembly that propels the ball onto the table.<br>&nbsp;&nbsp;&nbsp;11. A reckless gambler.<br>&nbsp;&nbsp;&nbsp;12. A boiler in which clay is beaten by a wheel to a creamy consistency.<br>&nbsp;&nbsp;&nbsp;13. The firing pin of a breechloader.<br>", "etymology": "First recorded in 1605–15; plunge + -er 1", "example": "The casing and plunger materials may break or bend if they’re not used carefully.", "synonym": "player"}, {"word": "careen", "definitionA": "(of a vehicle) to lean, sway, or tip to one side while in motion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The position of a ship laid on one side.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To heave a ship down on one side so as to expose the other, in order to clean it of barnacles and weed, or to repair it below the water line.<br>&nbsp;&nbsp;&nbsp;2. To tilt on one side.<br>&nbsp;&nbsp;&nbsp;3. To lurch or sway violently from side to side.<br>&nbsp;&nbsp;&nbsp;4. To tilt or lean while in motion.<br>&nbsp;&nbsp;&nbsp;5. (chiefly US) To career, to move rapidly straight ahead, to rush carelessly.<br>&nbsp;&nbsp;&nbsp;6. (chiefly US) To move swiftly and in an uncontrolled way.<br>", "etymology": "1585–95  careen fordef 9; < Middle French carine < Latin carīna keel, nutshell; akin to Greek káryon nut", "example": "Rollerbladers careen down its immaculate sidewalks while couples stroll leisurely past.", "synonym": "bend"}, {"word": "fret", "definitionA": "to feel or express worry, annoyance, discontent, or the like:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Agitation of the surface of a fluid by fermentation or some other cause; a rippling on the surface of water.<br>&nbsp;&nbsp;&nbsp;2. Agitation of the mind marked by complaint and impatience; disturbance of temper; irritation.<br>&nbsp;&nbsp;&nbsp;3. Herpes; tetter.<br>&nbsp;&nbsp;&nbsp;4. (in the plural) The worn sides of riverbanks, where ores or stones containing them accumulate after being washed down from higher ground, which thus indicate to miners the locality of veins of ore.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Especially when describing animals: to consume, devour, or eat.<br>&nbsp;&nbsp;&nbsp;2. To chafe or irritate; to worry.<br>&nbsp;&nbsp;&nbsp;3. To make rough, to agitate or disturb; to cause to ripple.<br>&nbsp;&nbsp;&nbsp;4. In the form fret out: to squander, to waste.<br>&nbsp;&nbsp;&nbsp;5. To gnaw; to consume, to eat away.<br>&nbsp;&nbsp;&nbsp;6. To be chafed or irritated; to be angry or vexed; to utter peevish expressions through irritation or worry.<br>&nbsp;&nbsp;&nbsp;7. To be worn away; to chafe; to fray.<br>&nbsp;&nbsp;&nbsp;8. To be anxious, to worry.<br>&nbsp;&nbsp;&nbsp;9. To be agitated; to rankle; to be in violent commotion.<br>&nbsp;&nbsp;&nbsp;10. To have secondary fermentation (fermentation occurring after the conversion of sugar to alcohol in beers and wine) take place.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ornamental pattern consisting of repeated vertical and horizontal lines, often in relief.<br>&nbsp;&nbsp;&nbsp;2. A saltire interlaced with a mascle.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To decorate or ornament, especially with an interlaced or interwoven pattern, or with carving or relief (raised) work.<br>&nbsp;&nbsp;&nbsp;2. To form a pattern on; to variegate.<br>&nbsp;&nbsp;&nbsp;3. To cut through with a fretsaw, to create fretwork.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ferrule, a ring.<br>&nbsp;&nbsp;&nbsp;2. One of the pieces of metal, plastic or wood across the neck of a guitar or other string instrument that marks where a finger should be positioned to depress a string as it is played.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bind, to tie, originally with a loop or ring.<br>&nbsp;&nbsp;&nbsp;2. Musical senses.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A channel, a strait; a fretum.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A channel or passage created by the sea.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A fog or mist at sea, or coming inland from the sea.<br>", "etymology": "First recorded before 900; Middle English freten, freoten, vreten “to eat up, consume greedily, devour,” Old English fretan “to eat up, consume, devour”; cognate with Old Saxon fretan, Gothic fra-itan, Old High German frezzan ( German fressen “to feed, devour”), from Germanic fra-etan, equivalent to fra- for- ( def ) + etan eat ( def )", "example": "There is however a not-paranoid or market-driven reason to fret, albeit a VERY small one.", "synonym": "affront"}, {"word": "posterity", "definitionA": "succeeding or future generations collectively:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. All the future generations, especially the descendants of a specific person.<br>", "etymology": "First recorded in 1350–1400; Middle English posterite, from Old French postérité, from Latin posteritāt-, stem of posteritās, noun derivative of posterus “coming after”; posterior, -ity", "example": "Less than half of these tech firms, in fact, have formally recorded their leader’s story for posterity.", "synonym": "breed"}, {"word": "strafe", "definitionA": "to attack (ground troops or installations) by airplanes with machine-gun fire.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An attack of machine-gun or cannon fire from a low-flying aircraft.<br>&nbsp;&nbsp;&nbsp;2. A sideways movement without turning.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To attack (ground targets) with automatic gunfire from a low-flying aircraft.<br>&nbsp;&nbsp;&nbsp;2. To sidestep; to move sideways without turning (a core mechanic of most first-person shooters).<br>", "etymology": "First recorded in 1910–15; from German strafen “to punish”", "example": "A visitor held the bones straight while I was doing this and Strafe did not struggle a particle.", "synonym": "blitz"}, {"word": "gavage", "definitionA": "forced feeding, as by a flexible tube and a force pump.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A process of force-feeding a goose for foie gras<br>&nbsp;&nbsp;&nbsp;2. A process of force-feeding cattle for veal<br>&nbsp;&nbsp;&nbsp;3. Feeding by means of a tube passed into the stomach<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stuff or glut with something<br>", "etymology": "1885–90; < French, equivalent to gav ( er ) to stuff ( Old French (dial.) gave gullet, throat) + -age -age", "example": "To that end, the controversial technique of gavage, which entails forcibly cramming food into the mouths of geese and ducks, dates from circa 2500 BC.", "synonym": null}, {"word": "assiduous", "definitionA": "constant in application or effort; working diligently at a task; persevering; industrious; meticulous:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Hard-working, diligent or regular (in attendance or work); industrious.<br>", "etymology": "First recorded in 1530–40; from Latin assiduus, equivalent to assid(ēre) “to sit near or beside, dwell close to” ( assess ) + -uus adjective suffix; -ous", "example": "Yang also ran up the score in conservative Jewish precincts of Brooklyn, after an assiduous effort to win Orthodox votes.", "synonym": null}, {"word": "indolent", "definitionA": "having or showing a disposition to avoid exertion; slothful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Habitually lazy, procrastinating, or resistant to physical labor<br>&nbsp;&nbsp;&nbsp;2. Inducing laziness<br>&nbsp;&nbsp;&nbsp;3. Causing little or no physical pain; progressing slowly; inactive (of an ulcer, etc.)<br>&nbsp;&nbsp;&nbsp;4. Healing slowly<br>", "etymology": "First recorded in 1655–65; from Latin indolent- (stem of indolēns ), equivalent to in- in- 3 + dolent- (stem of dolēns ), present participle of dolēre “to be painful, be in pain”; dole 2, -ent", "example": "It also sheds light on which patterns are linked to more indolent forms of the disease, where intervening with invasive surgery or toxic radiation or chemotherapy might do more harm than good.", "synonym": null}, {"word": "druthers", "definitionA": "one's own way, choice, or preference:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (often jocular) Wishes, preferences, or ways.<br>", "etymology": "1870–75; plural of druther, ( I, you, etc.) 'd rather (contraction of would rather )", "example": "Given his druthers he lives on a diet of wine, bread, fish, and olive oil.", "synonym": "attraction"}, {"word": "indignation", "definitionA": "strong displeasure at something considered unjust, offensive, insulting, or base; righteous anger.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An anger aroused by something perceived as an indignity, notably an offense or injustice.<br>&nbsp;&nbsp;&nbsp;2. A self-righteous anger or disgust.<br>", "etymology": "First recorded in 1325–75; Middle English indignacio(u)n, from Latin indignātiōn-, stem of indignātiō “anger, displeasure,” from indignāt(us) “deemed unworthy, scorned” (past participle of indignārī “to deem unworthy, take offense”; indignant ) + -iō -ion", "example": "It depends on its propagators having the space to twist truths, to omit pertinent information, to revel in faux indignation, and to get away with it.", "synonym": "animus"}, {"word": "rhapsody", "definitionA": "Music. an instrumental composition irregular in form and suggestive of improvisation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ancient Greek epic poem (or part of one) suitable for uninterrupted recitation.<br>&nbsp;&nbsp;&nbsp;2. A random collection or medley; a miscellany or confused string of stories, words etc.<br>&nbsp;&nbsp;&nbsp;3. An exalted or exaggeratedly enthusiastic expression of feeling in speech or writing.<br>&nbsp;&nbsp;&nbsp;4. An instrumental composition of irregular form often incorporating improvisation.<br>", "etymology": "1535–45; < Latin rhapsōdia < Greek rhapsōidía recital of epic poetry, equivalent to rhapsōid ( ós ) rhapsodist + -ia -y 3", "example": "I read Proust for his mad rhapsodies and not for his “therapeutic effect.”", "synonym": "balderdash"}]