[{"word": "dependable", "definitionA": "capable of being depended on; worthy of trust; reliable:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A reliable person or thing.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Able, or easily able to be depended on.<br>", "etymology": "First recorded in 1725–35; depend + -able", "example": "Never, that is, until this fan-free denatured year, with one more of our dependable normal delights subtracted.", "synonym": null}, {"word": "extemporaneous", "definitionA": "done, spoken, performed, etc., without special advance preparation; impromptu:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Without preparation or advanced thought; offhand.<br>", "etymology": "First recorded in 1650–60, from Late Latin extemporāneus “on the spur of the moment”; extempore, -an, -eous", "example": "Kennedy realizes he’s got to go on television and preempt Wallace, and he does so and gives a largely extemporaneous speech, in which he elevates the civil rights movement to a moral issue.", "synonym": null}, {"word": "fractious", "definitionA": "refractory or unruly:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Given to troublemaking.<br>&nbsp;&nbsp;&nbsp;2. Irritable; argumentative; quarrelsome.<br>", "etymology": "First recorded in 1715–25; fracti(on) + -ous", "example": "The post Google’s delayed cookie cull is an inevitable intermission to its fractious pursuit of privacy protections appeared first on Digiday.", "synonym": null}, {"word": "privation", "definitionA": "lack of the usual comforts or necessaries of life:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The state of being deprived of or lacking an attribute formerly or properly possessed; the loss or absence of such an attribute.<br>&nbsp;&nbsp;&nbsp;2. The state of being very poor, and lacking the basic necessities of life.<br>&nbsp;&nbsp;&nbsp;3. The act of depriving someone of such basic necessities; deprivation.<br>&nbsp;&nbsp;&nbsp;4. Degradation or suspension from an office.<br>", "etymology": "1350–1400; Middle English (from Middle French privacion ) from Latin prīvātiōn- (stem of prīvātiō ) “a taking away.” See private, -ion", "example": "If SpaceX or similar providers are willing, high-speed internet from the sky could be a powerful way to provide connectivity to people or populations suffering the privations of war or authoritarian government.", "synonym": "destitution"}, {"word": "cadaver", "definitionA": "a dead body, especially a human body to be dissected; corpse.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A dead body; especially the corpse of a human to be dissected.<br>", "etymology": "1350–1400; Middle English < Latin cadāver dead body, corpse; akin to cadere to fall, perish ( decay, chance )", "example": "We’ve shown that medical students are disgusted by cadavers.", "synonym": "body"}, {"word": "glitter", "definitionA": "to reflect light with a brilliant, sparkling luster; sparkle with reflected light.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bright, sparkling light; shininess or brilliance.<br>&nbsp;&nbsp;&nbsp;2. A shiny, decorative adornment, sometimes sprinkled on glue to make simple artwork.<br>&nbsp;&nbsp;&nbsp;3. Glitz.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sparkle with light; to shine with a brilliant and broken light or showy luster; to gleam.<br>&nbsp;&nbsp;&nbsp;2. To be showy, specious, or striking, and hence attractive.<br>", "etymology": "First recorded in 1300–50; Middle English, from Old Norse glitra; compare Old English glitenian, German gleissen “to shine, glitter”", "example": "Five hundred of the shells were handmade, designed to explode with twinkling gold glitter and a weeping willow-esque effect.", "synonym": "beam"}, {"word": "roost", "definitionA": "a perch upon which birds or fowls rest at night.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The place where a bird sleeps (usually its nest or a branch).<br>&nbsp;&nbsp;&nbsp;2. A group of birds roosting together.<br>&nbsp;&nbsp;&nbsp;3. A bedroom<br>&nbsp;&nbsp;&nbsp;4. The inner roof of a cottage.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of birds or bats) To settle on a perch in order to sleep or rest<br>&nbsp;&nbsp;&nbsp;2. To spend the night<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tidal race.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To rout out of bed; to rouse<br>&nbsp;&nbsp;&nbsp;2. To harass, to treat in a rough way.<br>&nbsp;&nbsp;&nbsp;3. To arrest<br>&nbsp;&nbsp;&nbsp;4. To drive strongly<br>", "etymology": "before 1100; Middle English roost (noun), Old English hrōst; cognate with Middle Dutch roest", "example": "The study showed that the social bonds formed in roosts extended into the hunt.", "synonym": "birdhouse"}, {"word": "aneurysm", "definitionA": "a permanent cardiac or arterial dilatation usually caused by weakening of the vessel wall.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An abnormal blood-filled swelling of an artery or vein, resulting from a localized weakness in the wall of the vessel.<br>", "etymology": "First recorded in 1650–60; from Greek aneúrysma “dilation,” equivalent to aneurys- (variant stem of aneurýnein “to dilate,” from an- an- 3 + eurýnein “to widen, broaden”; eury- ) + -ma, noun suffix", "example": "For some patients, it can even go away completely—like it reportedly did after about a week for Game of Thrones star Emilia Clarke, who developed the disorder after having a brain aneurysm.", "synonym": null}, {"word": "euryphagous", "definitionA": "(of an animal) able to subsist on a wide variety of foods.", "definitionB": "No definition found", "etymology": "First recorded in 1925–30; eury- + -phagous", "example": "The crow is euryphagous and, as shown by this study, the diets of crows a few miles apart may differ.", "synonym": null}, {"word": "eurypterid", "definitionA": "any aquatic arthropod of the extinct order Eurypterida, from the Paleozoic Era, closely related to trilobites and scorpions.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A large, prehistoric, carnivorous arthropod, of the class †Eurypterida, thought to be one of the first animals to venture onto land.<br>", "etymology": "From the New Latin word Eurypteridae, dating back to 1870–75. See eury-, -pterous, -id 2", "example": "The continuation of the dwindling process, already initiated in the Eurypterid, would easily result in the tentacles of Ammocœtes.", "synonym": null}, {"word": "sleazy", "definitionA": "contemptibly low, mean, or disreputable:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Marked by low quality; inferior; inadequate.<br>&nbsp;&nbsp;&nbsp;2. Raunchy or perverted in nature; tastelessly sexual<br>&nbsp;&nbsp;&nbsp;3. Untrustworthy<br>&nbsp;&nbsp;&nbsp;4. Thin and flimsy<br>", "etymology": "First recorded in 1635–45  sleazy fordef 3; of obscure origin; probably unrelated to Silesia; first recorded in 1941  sleazy fordefs 1, 2; perhaps a distinct word", "example": "Or as Joey, the sleazy, besieged used car salesman in Cadillac Man.", "synonym": null}, {"word": "jumble", "definitionA": "to mix in a confused mass; put or throw together without order:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mixture of unrelated things.<br>&nbsp;&nbsp;&nbsp;2. Items for a rummage sale.<br>&nbsp;&nbsp;&nbsp;3. A rummage sale.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mix or confuse.<br>&nbsp;&nbsp;&nbsp;2. To meet or unite in a confused way.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small, thin, sugared cake, usually ring-shaped.<br>", "etymology": "1520–30; perhaps blend of joll to bump (now dial.) and tumble", "example": "When tested on a jumble of polyethylene, PET and EVOH beads, the solvent washes recovered more than 95 percent of each material — hinting that these solvents could be used to strip plastic components off bulkier items than packaging films.", "synonym": "chaos"}, {"word": "quadriga", "definitionA": "a two-wheeled chariot drawn by four horses harnessed abreast.", "definitionB": "No definition found", "etymology": "1720–30; < Latin quadrīga, earlier plural quadrīgae, contraction of quadrijugae a team of four; quadri-, yoke 1", "example": "The god is standing upright in his quadriga, conducted by Mercury and holding in his arms the form of Vibia.", "synonym": null}, {"word": "parry", "definitionA": "to ward off (a thrust, stroke, weapon, etc.), as in fencing; avert.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A defensive or deflective action; an act of parrying.<br>&nbsp;&nbsp;&nbsp;2. A simple defensive action designed to deflect an attack, performed with the forte of the blade.<br>&nbsp;&nbsp;&nbsp;3. (combat sports and martial arts) A defensive move intended to change the direction of an incoming strike to make it miss its intended target, rather than block and absorb it; and typically performed with an open hand in a downward or sideways slapping motion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To avoid, deflect, or ward off (an attack, a blow, an argument, etc.).<br>", "etymology": "1665–75; < French parez, imperative of parer to ward off, set off < Latin parāre to set. See parade", "example": "“There are chances to attack everywhere,” says Parry, who adds that Zwift places great emphasis on designing races for their entertainment value.", "synonym": "anticipate"}, {"word": "hoopla", "definitionA": "bustling excitement or activity; commotion; hullabaloo; to-do.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bustling to-do, excited speech or noise.<br>&nbsp;&nbsp;&nbsp;2. A carnival game in which the player attempts to throw hoops around pegs.<br>", "etymology": "First recorded in 1865–70, hoopla is from the French word houp-là! command (as to a child) to move, take a step", "example": "We’ve heard very little from Congress in the last two years on energy, despite all of the initial hoopla, and it’s not clear what energy policy is going to look like after the November election.", "synonym": "action"}, {"word": "amanuensis", "definitionA": "a person employed to write what another dictates or to copy what has been written by another; secretary.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One employed to take dictation, or copy manuscripts.<br>&nbsp;&nbsp;&nbsp;2. A clerk, secretary or stenographer, or scribe.<br>", "etymology": "1610–20; < Latin ( servus ) āmanuēnsis, equivalent to ā- a- 4 + manu-, stem of manus hand + -ēnsis -ensis", "example": "At Newsweek he dueled with his economic nemesis, Paul Samuelson, the amanuensis of the Keynesian revolution.", "synonym": "copyist"}, {"word": "bumfuzzle", "definitionA": "to confuse or fluster.", "definitionB": "No definition found", "etymology": "First recorded in 1900–05; origin uncertain; from bum- (as in the initial syllable of Scottish bumbaze, bombaze “to confuse” ( bamboozle ) + fuzzle “to confuse” (perhaps a blend of fuddle and fuzzy ( def ) )", "example": null, "synonym": null}, {"word": "cynical", "definitionA": "distrusting or disparaging the motives of others; like or characteristic of a cynic.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to the belief that human actions are motivated only or primarily by base desires or selfishness.<br>&nbsp;&nbsp;&nbsp;2. Skeptical of the integrity, sincerity, or motives of others.<br>&nbsp;&nbsp;&nbsp;3. Bitterly or jadedly distrustful or contemptuous; mocking.<br>&nbsp;&nbsp;&nbsp;4. Showing contempt for accepted moral standards by one's actions.<br>&nbsp;&nbsp;&nbsp;5. Like the actions of a snarling dog, especially in reference to facial nerve paralysis.<br>", "etymology": "First recorded in 1580–90; cynic + -al 1", "example": "He writes that criticism of his performance on nursing homes was the organized and cynical work of Republicans looking to avoid accountability for their own failures in the face of the crisis.", "synonym": null}, {"word": "bamboozle", "definitionA": "to deceive or get the better of (someone) by trickery, flattery, or the like; humbug; hoodwink (often followed by into ):", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To con, defraud, trick, to make a fool of, to humbug or impose on someone.<br>&nbsp;&nbsp;&nbsp;2. To confuse, frustrate or perplex.<br>", "etymology": "First recorded in 1695–1705; origin uncertain", "example": "“To find out I had to sit out, that’s when I kind of felt bamboozled, because y’all told me to go,” he said, adding that he “absolutely” would not have taken the trip had he known it would cause him to miss five days of practice.", "synonym": "baffle"}]