[{"word": "intercession", "definitionA": "an act or instance of interceding.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of intervening or mediating between two parties.<br>&nbsp;&nbsp;&nbsp;2. A prayer to God on behalf of another person.<br>", "etymology": "1400–50; late Middle English < Latin intercessiōn- (stem of intercessiō ), equivalent to intercess ( us ) past participle of intercēdere to intercede (equivalent to interced- variant stem + -tus past participle suffix, with -dt- > -ss- ) + -iōn- -ion", "example": "Without his intercession, the Fire Nation plunged the world into a century of bloody conquests that began when they wiped out Aang’s entire culture, hoping to kill him, too.", "synonym": "appeal"}, {"word": "embroider", "definitionA": "to decorate with ornamental needlework.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stitch a decorative design on fabric with needle and thread of various colours.<br>&nbsp;&nbsp;&nbsp;2. To add imaginary detail to a narrative to make it more interesting or acceptable.<br>", "etymology": "1350–1400; em- 1 + broider; replacing Middle English embroderen, frequentative of embroden < Middle French embro ( u ) der, equivalent to em- em- 1 + Old French brosder, derivative of brosd < Germanic ( brad )", "example": "According to legend, Tyre is the place where purple pigment was first created - the dye crushed out of snail shells to embroider royal robes.", "synonym": "beautify"}, {"word": "sequin", "definitionA": "a small shining disk or spangle used for ornamentation, as on clothing, accessories, or theatrical costumes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of various small gold coins minted in Italy and Turkey.<br>&nbsp;&nbsp;&nbsp;2. A sparkling spangle used for the decoration of ornate clothing.<br>", "etymology": "First recorded in 1575–85; from French sequin, from Italian zecchino, equivalent to zecc(a) “mint” (from Arabic sikkah “die, coin”) + -ino -ine 2", "example": "Many of the younger members swathed in sequins and tulle skirts.", "synonym": "bangle"}, {"word": "brad", "definitionA": "a slender wire nail having either a small, deep head or a projection to one side of the head end.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thin, small nail, with a slight projection at the top on one side instead of a head, or occasionally with a small domed head, similar to that of an escutcheon pin.<br>&nbsp;&nbsp;&nbsp;2. (elementary school usage) A paper fastener, a fastening device formed of thin, soft metal, such as shim brass, with a round head and a flat, split shank, which is spread after insertion in a hole in a stack of pages, in much the same way as a cotter pin or a split rivet.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To attach using a brad.<br>&nbsp;&nbsp;&nbsp;2. To upset the end of a rod inserted in a hole so as to prevent it from being pulled out, as when riveting.<br>", "etymology": "1425–75; late Middle English brad, dialectal variant of Middle English brod ( d ) sprout, shoot, nail < Old Norse braddr, cognate with Old English brord spike ( braird )", "example": "Starting with the centermost box, hold the top molding piece level and attach it to the wall with your brad nailer, adding a nail every 12 inches.", "synonym": "bar"}, {"word": "braird", "definitionA": "the first sprouts or shoots of grass, corn, or other crops; new growth.", "definitionB": "No definition found", "etymology": "1400–50; late Middle English breird, variant of brerd a sprout, to sprout, Old English brerd edge, top; akin to brad", "example": "Braird, a 51-year-old engineer who hails from the Paqueta Island deep within the Guanabara Bay and has worked at Cedae for more than 15 years, also expressed surprise when asked about illnesses resulting from the pathogens lurking in Rio’s polluted waterways.", "synonym": null}, {"word": "orthostatic", "definitionA": "relating to or caused by erect posture.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Relating to orthostasis / orthostatism<br>&nbsp;&nbsp;&nbsp;2. Relating to an orthostat<br>", "etymology": "First recorded in 1900–05; ortho- + static", "example": "Others can develop something called POTS, which stands for postural orthostatic tachycardia syndrome, and can cause sharp spikes in the heart rate and dizziness.", "synonym": null}, {"word": "hypotension ", "definitionA": "decreased or lowered blood pressure.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The disease or disorder of abnormally low blood pressure.<br>", "etymology": "irst recorded in 1890–95; hypo- + tension", "example": "As a result, nanoparticles are attacked by immune cells triggering side effects that include shortness of breath, elevated heart rate, fever, hypotension, and, in rare cases, anaphylactic shock.", "synonym": null}, {"word": "metastasize", "definitionA": "Pathology. (of malignant cells or disease-producing organisms) to spread to other parts of the body by way of the blood or lymphatic vessels or membranous surfaces.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a disease or tumour) To spread to other sites in the body; to undergo metastasis.<br>", "etymology": "First recorded in 1905–10; metastas(is) + -ize", "example": "AJ: Dr. King predicted that if America did not address the cancer of bigotry, it would metastasize and bring down the nation.", "synonym": "clarify"}, {"word": "intransigent", "definitionA": "refusing to agree or compromise; uncompromising; inflexible.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who is intransigent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to compromise or moderate a position; unreasonable<br>", "etymology": "1875–80; < Spanish intransigente, equivalent to in- in- 3 + transigente (present participle of transigir to compromise) < Latin trānsigent- (stem of trānsigēns, present participle of trānsigere to come to an agreement); transact", "example": "Furthermore, the practice is tightly bound to the seemingly intransigent social marginalization of women.", "synonym": null}, {"word": "contusion", "definitionA": "an injury, as from a blow with a blunt instrument, in which the subsurface tissue is injured but the skin is not broken; bruise.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A wound, such as a bruise, in which the skin is not broken, often having broken blood vessels and discolouration.<br>&nbsp;&nbsp;&nbsp;2. The act of bruising.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Middle French, from Latin contūsiōn-, stem of contūsiō; equivalent to contuse + -ion", "example": "The statement went on to say that no weapons were alleged to be involved, but the victim reported a contusion to their right thigh.", "synonym": "bang"}, {"word": "spur", "definitionA": "a U -shaped device that slips over and straps to the heel of a riding boot and has a blunt or pointed metal part projecting from the back: used by a mounted rider to urge a horse forward by pressing the projection against the horse’s flank.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A rigid implement, often roughly y-shaped, that is fixed to one's heel for the purpose of prodding a horse. Often worn by, and emblematic of, the cowboy or the knight.<br>&nbsp;&nbsp;&nbsp;2. A jab given with the spurs.<br>&nbsp;&nbsp;&nbsp;3. Anything that inspires or motivates, as a spur does a horse.<br>&nbsp;&nbsp;&nbsp;4. An appendage or spike pointing rearward, near the foot, for instance that of a rooster.<br>&nbsp;&nbsp;&nbsp;5. Any protruding part connected at one end, for instance a highway that extends from another highway into a city.<br>&nbsp;&nbsp;&nbsp;6. Roots, tree roots.<br>&nbsp;&nbsp;&nbsp;7. A mountain that shoots from another mountain or range and extends some distance in a lateral direction, or at right angles.<br>&nbsp;&nbsp;&nbsp;8. A spiked iron worn by seamen upon the bottom of the boot, to enable them to stand upon the carcass of a whale to strip off the blubber.<br>&nbsp;&nbsp;&nbsp;9. A brace strengthening a post and some connected part, such as a rafter or crossbeam; a strut.<br>&nbsp;&nbsp;&nbsp;10. The short wooden buttress of a post.<br>&nbsp;&nbsp;&nbsp;11. A projection from the round base of a column, occupying the angle of a square plinth upon which the base rests, or bringing the bottom bed of the base to a nearly square form. It is generally carved in leafage.<br>&nbsp;&nbsp;&nbsp;12. Ergotized rye or other grain.<br>&nbsp;&nbsp;&nbsp;13. A wall in a fortification that crosses a part of a rampart and joins to an inner wall.<br>&nbsp;&nbsp;&nbsp;14. A piece of timber fixed on the bilgeways before launching, having the upper ends bolted to the vessel's side.<br>&nbsp;&nbsp;&nbsp;15. A curved piece of timber serving as a half to support the deck where a whole beam cannot be placed.<br>&nbsp;&nbsp;&nbsp;16. A branch of a vein.<br>&nbsp;&nbsp;&nbsp;17. A very short branch line of a railway line.<br>&nbsp;&nbsp;&nbsp;18. A short thin side shoot from a branch, especially one that bears fruit or, in conifers, the shoots that bear the leaves.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To prod (especially a horse) on the side or flank, with the intent to urge motion or haste, to gig.<br>&nbsp;&nbsp;&nbsp;2. To urge or encourage to action, or to a more vigorous pursuit of an object<br>&nbsp;&nbsp;&nbsp;3. To put spurs on.<br>&nbsp;&nbsp;&nbsp;4. To press forward; to travel in great haste.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tern.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A spurious tone, one that interferes with a signal in a circuit and is often masked underneath that signal.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The track of an animal, such as an otter; a spoor.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To ask, to inquire<br>", "etymology": "First recorded before 900; (for the noun) Middle English noun spore, spor(re), Old English spora, spura; cognate with Old High German sporo, Old Norse spori “spur”; verb derivative of the noun; akin to spurn", "example": "The protesters, spurred on by a figurehead pro-Western president and four opposition groups, say the government is illegitimate; the opposition won’t enter parliament because of the “falsified elections”.", "synonym": "activation"}, {"word": "complaisant", "definitionA": "inclined or disposed to please; obliging; agreeable or gracious; compliant:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Compliant.<br>&nbsp;&nbsp;&nbsp;2. Willing to do what pleases others; obliging.<br>&nbsp;&nbsp;&nbsp;3. Polite; showing respect.<br>", "etymology": "1640–50; < French (present participle of complaire ) < Latin complacent- (stem of complacēns, present participle of complacēre; complacent )", "example": "Private institutional investors such as BlackRock and Vanguard tend to be more complaisant about CEO pay — except for European funds.", "synonym": null}, {"word": "eschew", "definitionA": "to abstain or keep away from; shun; avoid:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To avoid; to shun, to shy away from.<br>", "etymology": "1300–50; Middle English eschewen < Old French eschiver, eschever < Germanic; compare Old High German sciuhen, German scheuchen, shy 2", "example": "Those I came of age with largely eschewed politics, out of a sense of progressive purity.", "synonym": "abjure"}, {"word": "subterfuge", "definitionA": "an artifice or expedient used to evade a rule, escape a consequence, hide something, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An indirect or deceptive device or stratagem; a blind. Refers especially to war and diplomatics.<br>&nbsp;&nbsp;&nbsp;2. Deception; misrepresentation of the true nature of an activity.<br>", "etymology": "1565–75; < Late Latin subterfugium, equivalent to Latin subterfug ( ere ) to evade ( subter below + fugere to flee) + -ium -ium", "example": "Using that intelligence, plus a little subterfuge, security passes can be copied, and the Red Team can enter the premises posing as an employee.", "synonym": "artifice"}, {"word": "flabbergast", "definitionA": "to overcome with surprise and bewilderment; astound.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An awkward person.<br>&nbsp;&nbsp;&nbsp;2. Overwhelming confusion, shock, or surprise.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To overwhelm with bewilderment; to amaze, confound, or stun, especially in a ludicrous manner.<br>", "etymology": "1765–75; variant of flabagast (perhaps flabb(y) + aghast )", "example": "So Stabolito said he was “flabbergasted” to learn that the U.S.", "synonym": "abash"}]