[{"word": "insinuate", "definitionA": "to suggest or hint slyly:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hint; to suggest tacitly (usually something bad) while avoiding a direct statement.<br>&nbsp;&nbsp;&nbsp;2. To creep, wind, or flow into; to enter gently, slowly, or imperceptibly, as into crevices.<br>&nbsp;&nbsp;&nbsp;3. (by extension) To ingratiate; to obtain access to or introduce something by subtle, cunning or artful means.<br>", "etymology": "First recorded in 1520–30; from Latin insinuātus, past participle of insinuāre “to work in, instill.” See in- 2, sinuous, -ate 1", "example": "They listen to Pepsi-branded transistor radios, fence with disc jockey Murray the K, who insinuates himself into their inner sanctum.", "synonym": "allude"}, {"word": "incantation", "definitionA": "the chanting or uttering of words purporting to have magical power.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act or process of using formulas and/or usually rhyming words, sung or spoken, with occult ceremonies, for the purpose of raising spirits, producing enchantment, or creating other magical results.<br>&nbsp;&nbsp;&nbsp;2. A formula of words used as above.<br>&nbsp;&nbsp;&nbsp;3. Any esoteric command or procedure.<br>", "etymology": "1350–1400; Middle English < Late Latin incantātiōn- (stem of incantātiō ), equivalent to incantāt ( us ) past participle of incantāre to put a spell on, bewitch ( enchant, -ate 1 ) + -iōn- -ion", "example": "The amalgamation of memory, historical fact and artifice yield an engrossing incantation.", "synonym": "abracadabra"}, {"word": "seance", "definitionA": "a meeting in which a spiritualist attempts to communicate with the spirits of the dead.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A ceremony where people try to communicate with the spirits of dead people, usually led by a medium.<br>&nbsp;&nbsp;&nbsp;2. The sitting of an assembly to discuss a matter.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hold a séance (communication with spirits).<br>", "etymology": "1795–1805; < French: session, equivalent to sé-, base of seoir to sit 1 (< Latin sedēre ) + -ance -ance", "example": "L7 is perhaps best known for the crossover hit “Pretend We’re Dead,” but magician Rob Zabrecky actually communes with the deceased at the Magic Castle’s Houdini Séance Room.", "synonym": null}, {"word": "gully", "definitionA": "a small valley or ravine originally worn away by running water and serving as a drainageway after prolonged heavy rains.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trench, ravine or narrow channel which was worn by water flow, especially on a hillside.<br>&nbsp;&nbsp;&nbsp;2. A small valley.<br>&nbsp;&nbsp;&nbsp;3. A drop kerb.<br>&nbsp;&nbsp;&nbsp;4. A road drain.<br>&nbsp;&nbsp;&nbsp;5. A fielding position on the off side about 30 degrees behind square, between the slips and point; a fielder in such a position<br>&nbsp;&nbsp;&nbsp;6. A grooved iron rail or tram plate.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To flow noisily.<br>&nbsp;&nbsp;&nbsp;2. To wear away into a gully or gullies.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (northern UK) A large knife.<br>", "etymology": "First recorded in 1530–40; apparently a variant of gullet, with -y replacing French -et", "example": "Harry Brook chopped on from his first ball and Root, so assured for 32, cut to gully.", "synonym": "channel"}, {"word": "gally", "definitionA": "to frighten or scare.", "definitionB": "No definition found", "etymology": "1695–1705; compare earlier gallow, apparently representing Old English agælwan to frighten", "example": "“Gally is Gally — he’s got marks all over his face every game,” Richardson said.", "synonym": null}, {"word": "parlor", "definitionA": "Older Use. a room for the reception and entertainment of visitors to one's home; living room.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The living room of a house, or a room for entertaining guests; a room for talking; a sitting-room or drawing room<br>&nbsp;&nbsp;&nbsp;2. The apartment in a monastery or nunnery where the residents are permitted to meet and converse with each other or with visitors from the outside.<br>&nbsp;&nbsp;&nbsp;3. A comfortable room in a public house.<br>&nbsp;&nbsp;&nbsp;4. A covered open-air patio.<br>&nbsp;&nbsp;&nbsp;5. A shop or other business selling goods specified by context.<br>&nbsp;&nbsp;&nbsp;6. A shed used for milking cattle.<br>", "etymology": "1175–1225; Middle English parlur < Anglo-French; Old French parleor, equivalent to parl ( er ) to speak ( parle ) + -eor -or 2", "example": "One ex-soldier was dishonorably discharged from the Soldiers’ Home for running a gambling parlor just outside the gates.", "synonym": "reception"}, {"word": "limey", "definitionA": "a British sailor.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An Englishman or other Briton, or a person of British descent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Resembling limes (the fruit); lime-like.<br>&nbsp;&nbsp;&nbsp;2. Of, or pertaining to, limes (the fruit).<br>", "etymology": "First recorded in 1885–90; lime-juicer, -y 2", "example": "Or make a meal of appetizers and salads: consider bright, refreshing, limey chicken or pork laab with lots of purple-edged shallot, sweet onion and peppery scallions.", "synonym": null}, {"word": "paraphrase", "definitionA": "a restatement of a text or passage giving the meaning in another form, as for clearness; rewording.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A restatement of a text in different words, often to clarify meaning.<br>&nbsp;&nbsp;&nbsp;2. One of a certain number of Scripture passages turned into verse for use in the service of praise.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To restate something as, or to compose a paraphrase.<br>", "etymology": "First recorded in 1540–50; from Middle French, from Latin paraphrasis, from Greek paráphrasis; para- 1 + phrase", "example": "To paraphrase the debut album of Williams' old boyband, Ape That and Party.", "synonym": "digest"}, {"word": "instar", "definitionA": "an insect in any one of its periods of postembryonic growth between molts.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any one of the several stages of postembryonic development which an arthropod undergoes, between molts, before it reaches sexual maturity.<br>&nbsp;&nbsp;&nbsp;2. An arthropod at a specified one of these stages of development.<br>&nbsp;&nbsp;&nbsp;3. (by extension) A stage in development.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stud or adorn with stars or other brilliants; to star.<br>&nbsp;&nbsp;&nbsp;2. To make a star of; set as a star.<br>", "etymology": "First recorded in 1890–95; from New Latin, Latin īnstar “counterpart, equivalent”", "example": "All the other planthoppers wait until their fifth instar before transforming.", "synonym": null}, {"word": "lesser", "definitionA": "smaller, as in size or importance; inferior:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A thing that is of smaller size, value, importance etc.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of two (or, rarely, more than two) things: the smaller in size (littler), in value, in importance etc.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Small in size.<br>&nbsp;&nbsp;&nbsp;2. Insignificant, trivial.<br>&nbsp;&nbsp;&nbsp;3. Very young.<br>&nbsp;&nbsp;&nbsp;4. (of a sibling) Younger.<br>&nbsp;&nbsp;&nbsp;5. (also Little) Used with the name of a place, especially of a country or its capital, to denote a neighborhood whose residents or storekeepers are from that place.<br>&nbsp;&nbsp;&nbsp;6. Small in amount or number, having few members.<br>&nbsp;&nbsp;&nbsp;7. Short in duration; brief.<br>&nbsp;&nbsp;&nbsp;8. Small in extent of views or sympathies; narrow; shallow; contracted; mean; illiberal; ungenerous.<br>", "etymology": "First recorded in 1175–1225; Middle English lasser, lesser; less, -er 4", "example": "Where, the lesser “prestige” of the TV movie aside, we have long enjoyed some of our most memorable films.", "synonym": null}, {"word": "prevaricate", "definitionA": "to speak falsely or misleadingly; deliberately misstate or create an incorrect impression; lie.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deviate, transgress; to go astray (from).<br>&nbsp;&nbsp;&nbsp;2. To shift or turn from direct speech or behaviour; to evade the truth; to waffle or be (intentionally) ambiguous.<br>&nbsp;&nbsp;&nbsp;3. To collude, as where an informer colludes with the defendant, and makes a sham prosecution.<br>&nbsp;&nbsp;&nbsp;4. To undertake something falsely and deceitfully, with the purpose of defeating or destroying it.<br>", "etymology": "1575–85; < Latin praevāricātus, past participle of praevāricārī to straddle something, (of an advocate) collude with an opponent's advocate, equivalent to prae- pre- + vāricāre to straddle, derivative of vārus bent outwards, bow-legged", "example": "But regardless of any issue — foreign or domestic — none justifies placing a narcissistic, prevaricating con man in the Oval Office.", "synonym": "belie"}, {"word": "missive", "definitionA": "a written message; letter.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A written message; a letter, note or memo.<br>&nbsp;&nbsp;&nbsp;2. (in the plural) Letters sent between two parties in which one makes an offer and the other accepts it.<br>&nbsp;&nbsp;&nbsp;3. One who is sent; a messenger.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Specially sent; intended or prepared to be sent.<br>&nbsp;&nbsp;&nbsp;2. Serving as a missile; intended to be thrown.<br>", "etymology": "1400–50; late Middle English ( letter ) missive < Medieval Latin ( littera ) missīva sent (letter), equivalent to Latin miss ( us ) (past participle of mittere to send) + -īva, feminine of -īvus -ive", "example": "Each missive includes art, music, poetry, a devotional writing and a piece of scripture that all relate to each other and revolve around themes of hope, peace, joy and love.", "synonym": "dispatch"}, {"word": "swatch", "definitionA": "a sample of cloth or other material.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A piece, pattern, or sample, generally of cloth or a similar material.<br>&nbsp;&nbsp;&nbsp;2. A selection of such samples bound together.<br>&nbsp;&nbsp;&nbsp;3. A clump or portion of something.<br>&nbsp;&nbsp;&nbsp;4. A demonstration, an example, a proof.<br>&nbsp;&nbsp;&nbsp;5. A tag or other small object attached to another item as a means of identifying its owner; a tally; specifically the counterfoil of a tally.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To create a swatch, especially a sample of knitted fabric.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A channel or passage of water between sandbanks, or between a sandbank and a seashore.<br>", "etymology": "First recorded in 1505–15; akin to switch", "example": "It was nominated for seven Grammys, referenced in the US presidential election, turned into a paint swatch, and named \"word of the year\" by Collins Dictionary.", "synonym": "example"}, {"word": "barque", "definitionA": "a variant of bark 3.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sailing vessel of three or more masts, with all masts but the sternmost square-rigged, the sternmost being fore-and-aft-rigged<br>&nbsp;&nbsp;&nbsp;2. Any small sailing vessel<br>&nbsp;&nbsp;&nbsp;3. A sailing vessel or boat of any kind<br>", "etymology": "C15: from Old French, from Old Provençal barca , from Late Latin, of unknown origin", "example": "Divers can explore the wreck of the Zephyr, a wooden barque that sunk just offshore in 1872.", "synonym": null}, {"word": "reticence", "definitionA": "the state of being reticent, or reserved, especially with regard to speaking freely; restraint:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An abrupt breaking-off in speech, often indicated in print using an ellipsis (…) or an em dash (—).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Avoidance of saying or reluctance to say too much; discretion, tight-lippedness; an instance of acting in this manner.<br>&nbsp;&nbsp;&nbsp;2. A silent and reserved nature.<br>&nbsp;&nbsp;&nbsp;3. Followed by of: discretion or restraint in the use of something.<br>&nbsp;&nbsp;&nbsp;4. Often followed by to: hesitancy or reluctance (to do something).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deliberately not listen or pay attention to; to disregard, to ignore.<br>", "etymology": "First recorded in 1600–10; from French réticence, from Latin reticentia, equivalent to reticent-, stem of reticēns (present participle of reticēre “to be silent”) + -ia -y 3( def ); reticent ( def )", "example": "As Fernandez tries to remember the events of that bright and sunny morning 83 years ago, the details are fragmented by the passage of time, the reticence of trauma.", "synonym": "closeness"}, {"word": "impugn", "definitionA": "to challenge as false (another's statements, motives, etc.); cast doubt upon.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To assault, attack.<br>&nbsp;&nbsp;&nbsp;2. To verbally assault, especially to argue against an opinion, motive, or action; to question the truth or validity of.<br>", "etymology": "1325–75; Middle English impugnen < Middle French impugner < Latin impugnāre to attack, equivalent to im- im- 1 + pugnāre to fight, derivative of pugnus fist; pugnacious", "example": "That’s not to say that a cynic would be shocked if somebody donated to charity or helped a stranger, but they might suspect or impugn the person’s motives.", "synonym": "attack"}, {"word": "novation", "definitionA": "Law. the substitution of a new obligation for an old one, usually by the substitution of a new debtor or of a new creditor.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Replacement of a contract with one or more new contracts, in particular in financial markets the replacement of a contract between a particular buyer and seller with contracts between the clearing house and each party.<br>&nbsp;&nbsp;&nbsp;2. A new contract between the original contracting parties whereby the first obligation is extinguished and a new obligation is substituted.<br>", "etymology": "1525–35; < Latin novātiōn- (stem of novātiō ) a renewing, equivalent to novāt ( us ) (past participle of novāre to renew, derivative of novus new ) + -iōn- -ion", "example": "Another is “novation”, where an existing contract is transferred to a different legal entity.", "synonym": null}, {"word": "snoop", "definitionA": "to prowl or pry; go about in a sneaking, prying way.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of snooping<br>&nbsp;&nbsp;&nbsp;2. One who snoops<br>&nbsp;&nbsp;&nbsp;3. A private detective<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To be devious and cunning so as not to be seen.<br>&nbsp;&nbsp;&nbsp;2. To secretly spy on or investigate, especially into the private personal life of others.<br>", "etymology": "1825–35, Americanism; < Dutch snoepen to take and eat food on the sly", "example": "Sometimes animal activists come snooping around, Mark said: “We do things differently, and some people don’t understand.”", "synonym": "busybody"}, {"word": "sneak", "definitionA": "to go in a stealthy or furtive manner; slink; skulk.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who sneaks; one who moves stealthily to acquire an item or information.<br>&nbsp;&nbsp;&nbsp;2. A cheat; a con artist.<br>&nbsp;&nbsp;&nbsp;3. An informer; a tell-tale.<br>&nbsp;&nbsp;&nbsp;4. A ball bowled so as to roll along the ground; a daisy-cutter<br>&nbsp;&nbsp;&nbsp;5. A sneaker; a tennis shoe.<br>&nbsp;&nbsp;&nbsp;6. A play where the quarterback receives the snap and immediately dives forward.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To creep or go stealthily; to come or go while trying to avoid detection, as a person who does not wish to be seen.<br>&nbsp;&nbsp;&nbsp;2. To take something stealthily without permission.<br>&nbsp;&nbsp;&nbsp;3. (ditransitive) To stealthily bring someone something.<br>&nbsp;&nbsp;&nbsp;4. To hide, especially in a mean or cowardly manner.<br>&nbsp;&nbsp;&nbsp;5. (with on) To inform an authority of another's misdemeanours.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. In advance; before release to the general public.<br>&nbsp;&nbsp;&nbsp;2. In a stealthy or surreptitious manner.<br>", "etymology": "1590–1600; variant of Middle English sniken, Old English snīcan “to creep”; cognate with Old Norse snīkja “to hanker after”", "example": "If the Broncos lose then Miami can pinch their place, and if they both lose then the Bengals will sneak in with a win.", "synonym": "cheater"}, {"word": "scoundrel", "definitionA": "an unprincipled, dishonorable person; villain.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mean, worthless fellow; a rascal; a villain; a person without honour or virtue.<br>", "etymology": "First recorded in 1580–90; origin uncertain", "example": "Rogers cross-examined prosecution witnesses blisteringly, portraying them as scoundrels who were lying about Darrow to save themselves.", "synonym": "blackguard"}, {"word": "cohort", "definitionA": "a group or company:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A group of people supporting the same thing or person.<br>&nbsp;&nbsp;&nbsp;2. A demographic grouping of people, especially those in a defined age group, or having a common characteristic.<br>&nbsp;&nbsp;&nbsp;3. Any division of a Roman legion, normally of about 500 men.<br>&nbsp;&nbsp;&nbsp;4. An accomplice; abettor; associate.<br>&nbsp;&nbsp;&nbsp;5. Any band or body of warriors.<br>&nbsp;&nbsp;&nbsp;6. A natural group of orders of organisms, less comprehensive than a class.<br>&nbsp;&nbsp;&nbsp;7. A colleague.<br>&nbsp;&nbsp;&nbsp;8. A set of individuals in a program, especially when compared to previous sets of individuals within the same program.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To associate with such a group<br>", "etymology": "First recorded in 1475–85; from Middle French cohorte, from Latin cohort- (stem of cohors ) “farmyard, armed force (originally, from a particular place or camp), cohort, retinue,” equivalent to co- “with, together” + hort- (akin to hortus “garden”); replacing late Middle English cohors, from Latin; co-, com-", "example": "His numbers went up in that cohort of our fellow citizens and in those unlikely areas.", "synonym": "accomplice"}, {"word": "conflate", "definitionA": "to fuse into one entity; merge:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (biblical criticism) A conflate text, one which conflates multiple version of a text together.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bring (things) together and fuse (them) into a single entity.<br>&nbsp;&nbsp;&nbsp;2. To mix together different elements.<br>&nbsp;&nbsp;&nbsp;3. (by extension) To fail to properly distinguish or keep separate (things); to mistakenly treat (them) as equivalent.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (biblical criticism) Combining elements from multiple versions of the same text.<br>", "etymology": "First recorded in 1600–10; from Latin conflātus “fused together,” past participle of conflāre “to fuse together,” from con- con- + flāre “to blow” ( blow 2 )", "example": "“To just conflate the two and kind of go, ‘You are an actor, therefore you’re a liar,’ it’s just daft.", "synonym": "blend"}, {"word": "assay", "definitionA": "to examine or analyze:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Trial, attempt.<br>&nbsp;&nbsp;&nbsp;2. Examination and determination; test.<br>&nbsp;&nbsp;&nbsp;3. The qualitative or quantitative chemical analysis of something.<br>&nbsp;&nbsp;&nbsp;4. Trial by danger or by affliction; adventure; risk; hardship; state of being tried.<br>&nbsp;&nbsp;&nbsp;5. Tested purity or value.<br>&nbsp;&nbsp;&nbsp;6. The act or process of ascertaining the proportion of a particular metal in an ore or alloy; especially, the determination of the proportion of gold or silver in bullion or coin.<br>&nbsp;&nbsp;&nbsp;7. The alloy or metal to be assayed.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To attempt (something).<br>&nbsp;&nbsp;&nbsp;2. To try, attempt (to do something).<br>&nbsp;&nbsp;&nbsp;3. To analyze or estimate the composition or value of (a metal, ore etc.).<br>&nbsp;&nbsp;&nbsp;4. To test the abilities of (someone) in combat; to fight.<br>&nbsp;&nbsp;&nbsp;5. To affect.<br>&nbsp;&nbsp;&nbsp;6. To try tasting, as food or drink.<br>", "etymology": "1250–1300; Middle English < Middle French; variant of essay", "example": "We set up an inhibition assay in test tubes.", "synonym": "appraisal"}, {"word": "forfeit", "definitionA": "a fine; penalty.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A penalty for or consequence of a misdemeanor.<br>&nbsp;&nbsp;&nbsp;2. A thing forfeited; that which is taken from somebody in requital of a misdeed committed; that which is lost, or the right to which is alienated, by a crime, breach of contract, etc.<br>&nbsp;&nbsp;&nbsp;3. Something deposited and redeemable by a sportive fine as part of a game.<br>&nbsp;&nbsp;&nbsp;4. Injury; wrong; mischief.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To suffer the loss of something by wrongdoing or non-compliance<br>&nbsp;&nbsp;&nbsp;2. To lose a contest, game, match, or other form of competition by voluntary withdrawal, by failing to attend or participate, or by violation of the rules<br>&nbsp;&nbsp;&nbsp;3. To be guilty of a misdeed; to be criminal; to transgress.<br>&nbsp;&nbsp;&nbsp;4. To fail to keep an obligation.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lost or alienated for an offense or crime; liable to penal seizure.<br>", "etymology": "First recorded in 1250–1300; Middle English forfet, from Old French (past participle of forfaire “to commit crime, to lose possession or right through a criminal act”), from Medieval Latin forīs factum “penalty,” past participle of forīs facere “to transgress,” equivalent to Latin forīs “outside, wrongly” + facere “to make, do”", "example": "And the fact is, Republicans don’t want to forfeit their demagogic prop.", "synonym": "cost"}, {"word": "foible", "definitionA": "a minor weakness or failing of character; slight flaw or defect:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quirk, idiosyncrasy, or mannerism; unusual habit or way (usage is typically plural), that is slightly strange or silly.<br>&nbsp;&nbsp;&nbsp;2. A weakness or failing of character.<br>&nbsp;&nbsp;&nbsp;3. Part of a sword between the middle and the point, weaker than the forte.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Weak; feeble.<br>", "etymology": "First recorded in 1640–50; from French, obsolete form of faible feeble", "example": "The saying — believed to be a witticism about Parker’s own romantic foibles — has been used on the show in some form at least a dozen times since 1985, according to the fan-operated J! archive.", "synonym": "characteristic"}, {"word": "ply", "definitionA": "to work with or at diligently; employ busily; use:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A layer of material.<br>&nbsp;&nbsp;&nbsp;2. A strand that, twisted together with other strands, makes up rope or yarn.<br>&nbsp;&nbsp;&nbsp;3. Short for plywood.<br>&nbsp;&nbsp;&nbsp;4. In two-player sequential games, a \"half-turn\" or a move made by one of the players.<br>&nbsp;&nbsp;&nbsp;5. A condition, a state.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bend; to fold; to mould; to adapt, to modify; to change (a person's) mind, to cause (a person) to submit.<br>&nbsp;&nbsp;&nbsp;2. To bend, to flex; to be bent by something, to give way or yield (to a force, etc.).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bent; a direction.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To work at (something) diligently.<br>&nbsp;&nbsp;&nbsp;2. To wield or use (a tool, a weapon, etc.) steadily or vigorously.<br>&nbsp;&nbsp;&nbsp;3. To press upon; to urge persistently.<br>&nbsp;&nbsp;&nbsp;4. To persist in offering something to, especially for the purpose of inducement or persuasion.<br>&nbsp;&nbsp;&nbsp;5. To travel over (a route) regularly.<br>&nbsp;&nbsp;&nbsp;6. To work diligently.<br>&nbsp;&nbsp;&nbsp;7. To manoeuvre a sailing vessel so that the direction of the wind changes from one side of the vessel to the other; to work to windward, to beat, to tack.<br>", "etymology": "First recorded in 1350–1400; Middle English plien, shortened variant of ap(p)lien apply", "example": "\"It was all young kids out. Lots of 19, 20, 21-year-olds,\" recalled Derrick Albert, a local DJ who plies his trade each night at the corner of Canal and Bourbon streets.", "synonym": "dispense"}]