[{"word": "moit", "definitionA": "a foreign particle found in wool, as a burr, twig, or seed.", "definitionB": "No definition found", "etymology": "1860–65; originally spelling variant (N England) of mote 1, with silent -i-, which served only to mark the o long; but by spelling pronunciation -oi- now has its usual value", "example": "“Es there a chance, friend Schiem, that Oi moit buy a foin wee peg from yeh? Moi coosin and Oi messed our danner today.....”", "synonym": null}, {"word": "mote", "definitionA": "a small particle or speck, especially of dust.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small particle; a speck.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. May or might.<br>&nbsp;&nbsp;&nbsp;2. Must.<br>&nbsp;&nbsp;&nbsp;3. Forming subjunctive expressions of wish: may.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A meeting for discussion.<br>&nbsp;&nbsp;&nbsp;2. A body of persons who meet for discussion, especially about the management of affairs.<br>&nbsp;&nbsp;&nbsp;3. A place of meeting for discussion.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A tiny computer for remote sensing; a component element of smartdust.<br>", "etymology": "before 1000; Middle English, Old English mot speck; cognate with Dutch mot grit, sawdust, Norwegian mutt speck", "example": "That is said with nary a mote of sarcasm.", "synonym": "atom"}, {"word": "pram", "definitionA": "perambulator.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small vehicle, usually covered, in which a newborn baby is pushed around in a lying position; a perambulator.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A flat-bottomed barge used on shallow shores to convey cargo to and from ships that cannot enter the harbour.<br>&nbsp;&nbsp;&nbsp;2. A similar barge used as platform for cannons in shallow waters which seagoing warships cannot enter.<br>&nbsp;&nbsp;&nbsp;3. A type of dinghy with a flat bow.<br>", "etymology": "First recorded in 1880–85; by shortening", "example": "I trundled home from the hospital in a daze, with my daughter in her pram.", "synonym": "cradle"}, {"word": "drub", "definitionA": "to beat with a stick or the like; cudgel; flog; thrash.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Carbonaceous shale; small coal; slate, dross, or rubbish in coal.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beat (someone or something) with a stick.<br>&nbsp;&nbsp;&nbsp;2. To defeat someone soundly; to annihilate or crush.<br>&nbsp;&nbsp;&nbsp;3. To forcefully teach something.<br>&nbsp;&nbsp;&nbsp;4. To criticize harshly; to excoriate.<br>", "etymology": "1625–35; perhaps by uncertain mediation < Arabic ḍarb blow, beating", "example": "Australia needed a response after a comprehensive drubbing by India in the first Test in Perth - and Starc duly provided the impetus.", "synonym": "beat"}, {"word": "ambigram", "definitionA": "a representation, typically of a word or number, that when viewed upside down or in mirror image forms the same word or number, or a different word or number, either coincidentally due to the natural form of the characters, as with “swims” or “dollop,” or intentionally, using calligraphy or graphic design.", "definitionB": "No definition found", "etymology": "ambi- ( def ) + -gram 1( def ); coined by U.S. cognitive scientist and physicist Douglas R. Hofstadter (born 1945) in his anthology Metamagical Themas (1985)", "example": "The date is also interesting because depending on the way its written, it may form a palindrome, or even an ambigram.", "synonym": null}, {"word": "endocrine", "definitionA": "secreting internally into the blood or lymph.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The secretion of an endocrine gland.<br>&nbsp;&nbsp;&nbsp;2. An endocrine gland.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Producing internal secretions that are transported around the body by the bloodstream.<br>&nbsp;&nbsp;&nbsp;2. Pertaining to the endocrine glands or their secretions.<br>", "etymology": "1910–15; endo- + -crine < Greek krī́nein to separate", "example": "No longer able to clean the blood of impurities, the Frankensteined kidney becomes a \"pathological neuro-immune endocrine organ,\" as the UVA researchers describe it in a new scientific paper, that can cause serious health problems.", "synonym": null}, {"word": "gooey", "definitionA": "like or covered with goo; sticky; viscid.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or relating to goo<br>&nbsp;&nbsp;&nbsp;2. Soft, sticky and viscous<br>", "etymology": "An Americanism dating back to 1905–10; goo + -ey 1", "example": "Gels with less silver liquified after 3-5 days, and those with more silver remained a gooey solid.", "synonym": null}, {"word": "dactyl", "definitionA": "Prosody. a foot of three syllables, one long followed by two short in quantitative meter, or one stressed followed by two unstressed in accentual meter, as in gently and humanly. : ", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A poetical foot of three syllables (— ⏑ ⏑), one long followed by two short, or one accented followed by two unaccented.<br>", "etymology": "1350–1400; Middle English < Latin dactylus < Greek dáktylos finger, a dactyl, referring to the three joints of the finger", "example": "They aren’t exactly Homeric dactyls, but they seem intended to mirror that ancient literary form, and they give “Everyday Life” an easily digestible if slightly pretentious rhythm.", "synonym": "appendage"}, {"word": "pterodactyl", "definitionA": "any of a number of genera of flying reptiles of the extinct order Pterosauria, from the Jurassic and Cretaceous periods, having a highly reduced tail and teeth and a birdlike beak.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pterosaur in the genus Pterodactylus.<br>&nbsp;&nbsp;&nbsp;2. Any pterosaur.<br>", "etymology": "1820–30; < New Latin Pterodactylus genus name, equivalent to Greek pteró ( n ) wing + -daktylos -dactylous", "example": "Steven Waters set the men's record last year, completing the London event in four hours, 15 minutes and two seconds while wearing an inflatable pterodactyl costume.", "synonym": null}, {"word": "apogee", "definitionA": "Astronomy.  the point in the orbit of a heavenly body, especially the moon, or of a man-made satellite at which it is farthest from the earth. Compare perigee.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The point, in an orbit about the Earth, that is furthest from the Earth: the apoapsis of an Earth orbiter.<br>&nbsp;&nbsp;&nbsp;2. (more generally) The point, in an orbit about any planet, that is farthest from the planet: the apoapsis of any satellite.<br>&nbsp;&nbsp;&nbsp;3. (possibly obsolete outside astrology) The point, in any trajectory of an object in space, where it is furthest from the Earth.<br>&nbsp;&nbsp;&nbsp;4. The highest point.<br>", "etymology": "1585–95; alteration (after French apogée ) of earlier apogaeum < Latin < Greek apógaion ( diástema ) off-earth (distance), neuter of apógaios (adj.), equivalent to apo- apo- + gáïos of the earth, derivative of gaîa, variant of gê the earth", "example": "The Moon's furthest point from the Earth is known as apogee.", "synonym": "acme"}, {"word": "polydactyl", "definitionA": "having many or several digits.", "definitionB": "No definition found", "etymology": "From the Greek word polydáktylos, dating back to 1860–65. See poly-, -dactyl", "example": "She was also polydactyl, with an extra toe on each paw, and had an underdeveloped jaw and no teeth which caused her tongue to always hang out.", "synonym": null}]