[{"word": "lackadaisical ", "definitionA": "without interest, vigor, or determination; listless; halfhearted:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showing no interest, vigor, determination, or enthusiasm.<br>&nbsp;&nbsp;&nbsp;2. Lazy; slothful; indolent.<br>", "etymology": "irst recorded in 1760–70; lackadais(y) (variant of lackaday ) + -ical", "example": "Their defense is lackadaisical, their forwards frequently inept.", "synonym": null}, {"word": "lacklustre", "definitionA": "lacking force, brilliance, or vitality", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lack of brightness or points of interest.<br>&nbsp;&nbsp;&nbsp;2. A person or thing of no particular brilliance or intelligence.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking brilliance or intelligence.<br>&nbsp;&nbsp;&nbsp;2. Having no shine or lustre; dull.<br>&nbsp;&nbsp;&nbsp;3. Not exceptional; not worthy of special merit, attention, or interest; having no vitality.<br>", "etymology": null, "example": "Pippa Middleton has parted company with her literary agent following the lacklustre reception to her first book.", "synonym": null}, {"word": "euphoria ", "definitionA": "a state of intense happiness and self-confidence:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An excited state of joy; a feeling of intense happiness.<br>", "etymology": "irst recorded in 1880–85; from New Latin, from Greek euphoría “state of well-being”; eu-, -phore, -ia", "example": "“She was tireless and often seemed in a state of euphoria,” Pausini told police, according to the documents.", "synonym": "bliss"}, {"word": "whet", "definitionA": "to sharpen (a knife, tool, etc.) by grinding or friction.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of whetting something.<br>&nbsp;&nbsp;&nbsp;2. That which whets or sharpens; especially, an appetizer.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hone or rub on with some substance, as a piece of stone, for the purpose of sharpening – see whetstone.<br>&nbsp;&nbsp;&nbsp;2. To stimulate or make more keen.<br>&nbsp;&nbsp;&nbsp;3. To preen.<br>", "etymology": "before 900; Middle English whetten (v.), Old English hwettan (derivative of hwæt bold); cognate with German wetzen, Old Norse hvetja, Gothic gahwatjan to incite", "example": "To whet your appetite, you can relive that glorious moment (and watch other programs from the 2014 summit) here.", "synonym": "edge"}, {"word": "avuncular", "definitionA": "of or relating to an uncle:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. In the manner of an uncle, pertaining to an uncle.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Kind, genial, benevolent, or tolerant.<br>", "etymology": "First recorded in 1825–35; from Latin avuncul(us) “a mother's brother,” equivalent to av(us) “a forefather” + unattested -ont- + unattested -l(os) diminutive suffix ( uncle ) + -ar 1", "example": "There’s a world of difference between Lindell, with his conspiracy theory-fuelled, feverish pleading for those in power to take his claims seriously, and Cuffe’s avuncular small-town sincerity.", "synonym": "counseling"}, {"word": "balayage", "definitionA": "a hair highlighting technique in which dye is painted onto the hair to lighten it in a natural-looking way.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hair colouring technique in which colour is applied by hand.<br>&nbsp;&nbsp;&nbsp;2. A method for reconstructing a harmonic function<br>", "etymology": "First recorded in 1975–80; from French: literally, “sweeping,” derivative of verb balayer, from Middle French, Old French balaier, derivative of French balai, from Old French balei, baleis “a broom, brush,” alteration (influenced by balier, baloier “to move about excitedly”) of Late Latin ballāre “to dance”; ball 2( def )", "example": null, "synonym": null}, {"word": "lethargic", "definitionA": "of, relating to, or affected with lethargy; drowsy; sluggish; apathetic.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sluggish, slow<br>&nbsp;&nbsp;&nbsp;2. Indifferent, apathetic<br>", "etymology": "First recorded in 1350–1400; from Latin lēthargicus, from Greek lēthargikós; replacing Middle English litargik, from Medieval Latin litargicus ( lethargy, -ic )", "example": "He’s an ideal companion — “my mentor, my Yoda,” as Fox puts it — and the antidote to Marty’s lethargic, risk-adverse parents.", "synonym": null}, {"word": "zarzuela", "definitionA": "a Spanish opera having spoken dialogue and often a satirically treated, topical theme.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A form of Spanish opera having spoken dialogue and usually a comic subject.<br>", "etymology": "1885–90; < Spanish, after La Zarzuela, palace near Madrid where first performance took place (1629)", "example": "The last-named type, the zarzuela, became particularly popular.", "synonym": null}, {"word": "rivulet", "definitionA": "a small stream; streamlet; brook.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small brook or stream; a streamlet.<br>&nbsp;&nbsp;&nbsp;2. Perizoma affinitatum, a geometrid moth.<br>", "etymology": "1580–90; earlier rivolet < Italian rivoletto, diminutive of rivolo < Latin rīvulus small stream", "example": "This was one saucy sandwich, and I immediately imagined myself with rivulets of both of its dressings dripping down my chin.", "synonym": "bourn"}, {"word": "capricious", "definitionA": "subject to, led by, or indicative of a sudden, odd notion or unpredictable change; erratic:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Impulsive and unpredictable; determined by chance, impulse, or whim<br>", "etymology": "First recorded in 1585–95; from French capricieux, from Italian capriccioso capriccioso", "example": "Like every other capricious pillar of global capital in the world, the IOC insists that their giant money-printing operation is actually a bringer of peace and progress—a harbor for an open world that spreads democracy far and wide.", "synonym": null}]