[{"word": "raddled", "definitionA": "(esp of a person) unkempt or run-down in appearance", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Worn-out and broken-down.<br>", "etymology": "C17: from raddle ²", "example": "I used to walk past the raddled marquee of the shuttered Linda Lea Japanese Films theater on Main Street near skid row.", "synonym": null}, {"word": "discretion", "definitionA": "the power or right to decide or act according to one's own judgment; freedom of judgment or choice:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality of being discreet or circumspect.<br>&nbsp;&nbsp;&nbsp;2. The ability to make wise choices or decisions.<br>&nbsp;&nbsp;&nbsp;3. The freedom to make one's own judgements.<br>", "etymology": "First recorded in 1250–1300; Middle English discrecioun, from Anglo-French, from Late Latin discrētiōn-, stem of discrētiō “separation”; equivalent to discreet + -ion", "example": "If he feels like rewarding people who supported him, he can do that — but it's purely at his discretion and he is not a generous person.", "synonym": "acumen"}, {"word": "fizzle", "definitionA": "to make a hissing or sputtering sound, especially one that dies out weakly.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A spluttering or hissing sound.<br>&nbsp;&nbsp;&nbsp;2. Failure of a nuclear bomb to meet its expected yield during testing.<br>&nbsp;&nbsp;&nbsp;3. An abortive effort; a flop or dud.<br>&nbsp;&nbsp;&nbsp;4. A state of agitation or worry.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To sputter or hiss.<br>&nbsp;&nbsp;&nbsp;2. To decay or die off to nothing; to burn out; to end less successfully than previously hoped.<br>", "etymology": "1525–35; earlier fysel to break wind, frequentative of *fise < Old Norse fīsa to break wind; akin to feist", "example": "Then the Rams fizzled at home Monday in a 23-15 loss to the Dolphins, who were 2-6 coming into the game.", "synonym": "die"}, {"word": "decouple", "definitionA": "to cause to become separated, disconnected, or divergent; uncouple.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To unlink; to take or come apart.<br>", "etymology": "First recorded in 1595–1605; de- + couple", "example": "Trump threatened to impose massive trade tariffs on Chinese goods coming into the US, and he may push Europe to decouple more from China’s economy.", "synonym": null}, {"word": "barometer", "definitionA": "Meteorology.  any instrument that measures atmospheric pressure. Compare aneroid barometer, mercury barometer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An instrument for measuring atmospheric pressure.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Anything used as a gauge or indicator.<br>", "etymology": "First recorded in 1655–65; baro- + -meter", "example": "People will just have to start looking elsewhere for a political barometer.", "synonym": "weatherglass"}, {"word": "contentment", "definitionA": "the state of being contented; content; contented; satisfaction; ease of mind.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The state or degree of being contented or satisfied.<br>&nbsp;&nbsp;&nbsp;2. Happiness in one's situation; satisfaction<br>&nbsp;&nbsp;&nbsp;3. The neurophysiological experience of satisfaction and being at ease in one's situation, body, and/or mind.<br>", "etymology": "First recorded in 1400–50; late Middle English contentement, from Middle French; content 2( def ), -ment ( def )", "example": "Killingsworth founded trackyourhappiness.org, a global research project in which 200,000 people use smartphones to assess their mental habits and contentment in daily life.", "synonym": "content"}, {"word": "harrow", "definitionA": "an agricultural implement with spikelike teeth or upright disks, drawn chiefly over plowed land to level it, break up clods, root up weeds, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device consisting of a heavy framework having several disks or teeth in a row, which is dragged across ploughed land to smooth or break up the soil, to remove weeds or cover seeds; a harrow plow.<br>&nbsp;&nbsp;&nbsp;2. An obstacle formed by turning an ordinary harrow upside down, the frame being buried.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drag a harrow over; to break up with a harrow.<br>&nbsp;&nbsp;&nbsp;2. To traumatize or disturb; to frighten or torment.<br>&nbsp;&nbsp;&nbsp;3. To break or tear, as if with a harrow; to wound; to lacerate; to torment or distress; to vex.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. A call for help, or of distress, alarm etc.<br>", "etymology": "1250–1300; Middle English harwe; akin to Old Norse herfi harrow, Dutch hark rake, Greek krṓpion sickle", "example": "Petticrew leads us through Dolours' youth through her and Marian's harrowing imprisonment.", "synonym": "abuse"}, {"word": "bolo", "definitionA": "a large, heavy, single-edged knife or machete for hacking, used in the Philippines and by the U.S. Army.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long, heavy, single-edged machete.<br>&nbsp;&nbsp;&nbsp;2. A type of punch; an uppercut.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To attack or despatch with a bolo knife.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A soldier not capable of the minimum standards of marksmanship.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fail to meet the minimum standards of marksmanship.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A string or leather necktie secured with an ornamental slide.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dress (somebody) in a bolo.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A request for law enforcement officers to be on the lookout for a suspect.<br>", "etymology": "First recorded in 1900–05; from Philippine Spanish; further origin uncertain", "example": "Her urban polish was a contrast to the stereotypical copper country getup of checkered shirt, western-style belt buckle, bolo tie and Stetson hat.", "synonym": "cutlass"}, {"word": "bier", "definitionA": "a frame or stand on which a corpse or the coffin containing it is laid before burial.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A litter to transport the corpse of a dead person.<br>&nbsp;&nbsp;&nbsp;2. A platform or stand where a body or coffin is placed.<br>&nbsp;&nbsp;&nbsp;3. A count of forty threads in the warp or chain of woollen cloth.<br>", "etymology": "before 900; Middle English bere, Old English bēr, bǣr ( e ); cognate with Old High German bāra ( German Bahre ), Dutch, Danish baar, Swedish bår; spelling influenced by French bière; akin to bear 1, barrow 1", "example": "The solemn processions, with the flower-adorned biers followed by the clergy and the faithful, are often spectacular, especially in places where bier processions from each parish converge into a central square.", "synonym": "catafalque"}, {"word": "barrow", "definitionA": "a wheelbarrow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mountain.<br>&nbsp;&nbsp;&nbsp;2. A hill.<br>&nbsp;&nbsp;&nbsp;3. A mound of earth and stones raised over a grave or graves.<br>&nbsp;&nbsp;&nbsp;4. A heap of rubbish, attle, or other such refuse.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small vehicle used to carry a load and pulled or pushed by hand.<br>&nbsp;&nbsp;&nbsp;2. (saltworks) A wicker case in which salt is put to drain.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A castrated boar.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long sleeveless flannel garment for infants.<br>", "etymology": "First recorded 1300–50; Middle English bar(e)we, berwe, from unrecorded Old English bearwe; akin to Middle High German bere; bier, bear 1", "example": "For hundreds of years, Norwegians thought they knew who or what had been interred in an enormous barrow on the island of Leka, which is just off the country’s northern coast, facing the Atlantic Ocean.", "synonym": "bank"}, {"word": "trowel", "definitionA": "any of various tools having a flat blade with a handle, used for depositing and working mortar, plaster, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A mason’s tool, used in spreading and dressing mortar, and breaking bricks to shape them.<br>&nbsp;&nbsp;&nbsp;2. A gardener’s tool, shaped like a scoop, used in taking up plants, stirring soil etc.<br>&nbsp;&nbsp;&nbsp;3. A tool used for smoothing a mold.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To apply (a substance) with a trowel.<br>&nbsp;&nbsp;&nbsp;2. To pass over with a trowel.<br>&nbsp;&nbsp;&nbsp;3. To apply something heavily or unsubtly.<br>", "etymology": "1300–50; Middle English < Old French truelle < Late Latin truella, equivalent to Latin tru ( a ) ladle + -ella -elle", "example": "Escaping workers left roof tiles neatly stacked; their pots of lime mortar are still filled, waiting to be used; their trowels and pickaxes remain, although the wooden handles have long since rotted away.", "synonym": "bail"}, {"word": "plow", "definitionA": "an agricultural implement used for cutting, lifting, turning over, and partly pulverizing soil.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The notional area of land able to be farmed in a year by a team of 8 oxen pulling a carruca plow, usually reckoned at 120 acres.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A device pulled through the ground in order to break it open into furrows for planting.<br>&nbsp;&nbsp;&nbsp;2. The use of a plough; tillage.<br>&nbsp;&nbsp;&nbsp;3. Alternative form of Plough (Synonym of Ursa Major)<br>&nbsp;&nbsp;&nbsp;4. A joiner's plane for making grooves.<br>&nbsp;&nbsp;&nbsp;5. A bookbinder's implement for trimming or shaving off the edges of books.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use a plough on to prepare for planting.<br>&nbsp;&nbsp;&nbsp;2. To use a plough.<br>&nbsp;&nbsp;&nbsp;3. To have sex with, penetrate.<br>&nbsp;&nbsp;&nbsp;4. To move with force.<br>&nbsp;&nbsp;&nbsp;5. To furrow; to make furrows, grooves, or ridges in.<br>&nbsp;&nbsp;&nbsp;6. To run through, as in sailing.<br>&nbsp;&nbsp;&nbsp;7. To trim, or shave off the edges of, as a book or paper, with a plough.<br>&nbsp;&nbsp;&nbsp;8. (joinery) To cut a groove in, as in a plank, or the edge of a board; especially, a rectangular groove to receive the end of a shelf or tread, the edge of a panel, a tongue, etc.<br>&nbsp;&nbsp;&nbsp;9. (university slang) To fail (a student).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Land that has been or is meant to be ploughed<br>", "etymology": "before 1100; Middle English plouh, plugh ( e ), plough ( e ), Old English plōh; cognate with German Pflug plow", "example": "It involved a Hezbollah drone that managed to evade Israel’s vaunted air-defense system and plow into a mess hall at the base.", "synonym": "break"}, {"word": "maxilla", "definitionA": "a jaw or jawbone, especially the upper.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Either of the two bones that together form the upper jaw.<br>&nbsp;&nbsp;&nbsp;2. (arthropodology) One of a set of paired mouthparts found in many arthropods and used for tasting and manipulating food.<br>", "etymology": "1670–80; < New Latin, special use of Latin maxilla lower jaw, diminutive of māla (< *maxlā ) upper jaw, cheekbone", "example": "The skeletal remains, which include skulls without mandibles, craniums, loose mandibles and maxilla fragments, were handed over in an official ceremony in Vienna on Tuesday, where there was a panel and presentation.", "synonym": "chops"}, {"word": "mow", "definitionA": "to cut down (grass, grain, etc.) with a scythe or a machine.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of mowing (a garden, grass etc.)<br>&nbsp;&nbsp;&nbsp;2. A shot played with a sweeping or scythe-like motion.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut down grass or crops.<br>&nbsp;&nbsp;&nbsp;2. To cut down or slaughter in great numbers.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A scornful grimace; a wry face.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make grimaces, mock.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stack of hay, corn, beans or a barn for the storage of hay, corn, beans.<br>&nbsp;&nbsp;&nbsp;2. The place in a barn where hay or grain in the sheaf is stowed.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put into mows.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A gull, seagull.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A prison, or other place of confinement.<br>&nbsp;&nbsp;&nbsp;2. A hiding place; a secret store or den.<br>&nbsp;&nbsp;&nbsp;3. A breeding-cage for birds.<br>&nbsp;&nbsp;&nbsp;4. A cage for hawks, especially while moulting.<br>&nbsp;&nbsp;&nbsp;5. (in the plural) A building or set of buildings where moulting birds are kept.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The crying sound of a cat; a meow, especially of a kitten.<br>&nbsp;&nbsp;&nbsp;2. The crying sound of a gull.<br>&nbsp;&nbsp;&nbsp;3. An exclamation of disapproval; a boo.<br>", "etymology": "First recorded before 900; Middle English mowen, mouwen “to stack hay or grain,” Old English māwan “to mow;” cognate with Old Frisian mīa, German mähen", "example": "“They’re very engaged, very highly Hispanic,” Duarte said of the voters he was targeting in what he called an “aspirational neighborhood,” where “lawns are mowed, cars are clean, the houses aren’t real big.”", "synonym": "clip"}, {"word": "mead", "definitionA": "an alcoholic liquor made by fermenting honey and water.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An alcoholic drink fermented from honey and water.<br>&nbsp;&nbsp;&nbsp;2. A drink composed of syrup of sarsaparilla or other flavouring extract, and water, and sometimes charged with carbon dioxide.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A meadow.<br>", "etymology": "First recorded before 900; Middle English mede, Old English medu, meodu; cognate with Dutch mee, German Met, Old Norse mjǫthr “mead”; akin to Greek méthy “wine,” Sanskrit madhu “honey”", "example": "With mead, I started brewing when I was young, about 16.", "synonym": "acreage"}, {"word": "cachet", "definitionA": "an official seal, such as on a letter or document.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A seal, as of a letter.<br>&nbsp;&nbsp;&nbsp;2. A special characteristic or quality; prestige.<br>&nbsp;&nbsp;&nbsp;3. A commemorative stamped design or inscription on an envelope, other than a cancellation or pre-printed postage.<br>&nbsp;&nbsp;&nbsp;4. A sealed envelope containing an item whose price is being negotiated.<br>&nbsp;&nbsp;&nbsp;5. A capsule containing a pharmaceutical preparation.<br>&nbsp;&nbsp;&nbsp;6. A hidden location from which one can observe birds while remaining unseen.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To mark (an envelope) with a commemorative stamped design or inscription.<br>", "etymology": "First recorded in 1630–40; from French: literally, “small hiding place,” from cache cache + -et -et", "example": "He was the first Latino leader of the state Senate in 130 years, with enough political cachet to stage serious runs for U.S.", "synonym": "design"}, {"word": "mosey", "definitionA": "to wander or shuffle about leisurely; stroll; saunter (often followed by along, about, etc.).", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To set off, get going; to start a journey.<br>&nbsp;&nbsp;&nbsp;2. To go off quickly: to hurry up.<br>&nbsp;&nbsp;&nbsp;3. To amble; to walk or proceed in a leisurely manner.<br>", "etymology": "An Americanism dating back to 1820–30; origin uncertain", "example": "Ringo Starr moseys up to the restaurant at the Sunset Marquis in a spotless white cowboy hat and matching white denim jacket.", "synonym": "dally"}, {"word": "saunter", "definitionA": "to walk with a leisurely gait; stroll:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A leisurely walk or stroll.<br>&nbsp;&nbsp;&nbsp;2. A leisurely pace.<br>&nbsp;&nbsp;&nbsp;3. A place for sauntering or strolling.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To stroll, or walk at a leisurely pace.<br>", "etymology": "First recorded in 1660–70; of uncertain origin", "example": "Taylor, in black with gold trim, was more understated in her ring walk but still soaking up the atmosphere as she sauntered down the runway without any real urgency.", "synonym": "airing"}, {"word": "promontory", "definitionA": "a high point of land or rock projecting into the sea or other water beyond the line of coast; a headland.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A high point of land extending into a body of water, headland; cliff.<br>&nbsp;&nbsp;&nbsp;2. A projecting part of the body.<br>", "etymology": "First recorded in 1540–50, promontory is from the Latin word prōmontorium, prōmunturium, of unclear derivation", "example": "Tread the sand of Laguna Beach past Halfway Rock to Cactus Point, the latter a rocky promontory with a tunnel near the surf line.", "synonym": "cape"}, {"word": "gaslight", "definitionA": "to cause (a person) to doubt their judgment, memory, or sanity through the use of psychological manipulation:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lamp which operates by burning piped illuminating gas.<br>&nbsp;&nbsp;&nbsp;2. The light produced by the burning gas in such a lamp.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To manipulate (someone) psychologically such that they question their own memory, perception, and sanity, thereby evoking in them cognitive dissonance and low self-esteem.<br>", "etymology": "First recorded in 1800–10; gas ( def ) + light 1( def );  gaslight def 1 in reference to the 1944 movie Gaslight, in which an abusive husband secretly and repeatedly dims and brightens the gaslights in the house while accusing his wife of imagining the flickering", "example": "They may lie all the time, but when the chips are down, they gaslight.", "synonym": "beacon"}, {"word": "muppet", "definitionA": "slang. a stupid person", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (Eastern US) An incompetent or foolish person.<br>", "etymology": "C20: from the name for the puppets used in the television programme The Muppet Show", "example": "Norris also said he had \"driven like a muppet\" at the first corner, and allowed Verstappen to get up his inside and force him wide, a move that cost both of them places to eventual race winner Charles Leclerc of Ferrari.", "synonym": null}, {"word": "pomposity", "definitionA": "the quality of being pompous.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The quality of being pompous; self-importance.<br>", "etymology": "1400–50; late Middle English pomposite < Late Latin pompōsitās. See pompous, -ity", "example": "His personality traits that alienate average Americans — his contempt, his pomposity, his unvarnished misogyny — are attractive in the upside-down world of MAGA.", "synonym": "airs"}, {"word": "unbridled", "definitionA": "not controlled or restrained:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To remove the bridle, and other tack, from (a horse or other animal).<br>&nbsp;&nbsp;&nbsp;2. To remove restraint from.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not fitted with a bridle.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Without restraint or limit.<br>", "etymology": "First recorded in 1325–75; Middle English unbrydled. See un- 1, bridle ( def ), + -ed 2( def )", "example": "In “Next,” the show’s final number, he finds the perfect word to capture the unbridled pace of change.", "synonym": "crazed"}, {"word": "grandiloquence", "definitionA": "speech that is lofty in tone, often to the point of being pompous or bombastic.", "definitionB": "No definition found", "etymology": "1580–90; < Latin grandiloqu ( us ) speaking loftily ( grandi ( s ) great + -loquus speaking) + -ence", "example": "“Authentic Presence” manages to feel weighty while also ephemeral, grand without grandiloquence, understated in its execution yet unafraid of dramatic gesture.", "synonym": "claptrap"}]