[{"word": "incumbent ", "definitionA": "holding an indicated position, role, office, etc., currently:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The current holder of an office, such as ecclesiastical benefice or an elected office.<br>&nbsp;&nbsp;&nbsp;2. A holder of a position as supplier to a market or market segment that allows the holder to earn above-normal profits.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Imposed on someone as an obligation, especially due to one's office.<br>&nbsp;&nbsp;&nbsp;2. Lying; resting; reclining; recumbent.<br>&nbsp;&nbsp;&nbsp;3. Prevalent, prevailing, predominant.<br>&nbsp;&nbsp;&nbsp;4. Resting on something else; in botany, said of anthers when lying on the inner side of the filament, or of cotyledons when the radicle lies against the back of one of them.<br>&nbsp;&nbsp;&nbsp;5. Bent downwards so that the ends touch, or rest on, something else.<br>&nbsp;&nbsp;&nbsp;6. Being the current holder of an office or a title.<br>", "etymology": "irst recorded in 1375–1425; late Middle English (noun), from Latin incumbent-, stem of incumbēns “lying upon,” present participle of incumbere “to lie or lean upon,” equivalent to in- in- 2 + -cumbere (variant combining form of cubāre “to lie down”; cubicle )", "example": "As a power struggle engulfs the Democratic Party, a leading progressive organization, the Justice Democrats, announced a new candidate recruitment campaign targeting both open seats and incumbents and deep-blue congressional districts.", "synonym": "binding"}, {"word": "rector", "definitionA": "a member of the clergy in charge of a parish in the Protestant Episcopal Church.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. In the Anglican Church, a cleric in charge of a parish and who owns the tithes of it.<br>&nbsp;&nbsp;&nbsp;2. In the Roman Catholic Church, a cleric with managerial as well as spiritual responsibility for a church or other institution.<br>&nbsp;&nbsp;&nbsp;3. A priest or bishop who is in charge of a parish or in an administrative leadership position in a theological seminary or academy.<br>&nbsp;&nbsp;&nbsp;4. In a Protestant church, a pastor in charge of a church with administrative and pastoral leadership combined.<br>&nbsp;&nbsp;&nbsp;5. A headmaster in various educational institutions, e.g. a university.<br>", "etymology": "1350–1400; Middle English rectour < Latin rēctor helmsman, ruler, leader, equivalent to reg ( ere ) to rule + -tor -tor", "example": "In 1431, the ecumenical Council of Basel ordered the deans and rectors of churches to expel \"frivolities\" and \"profane abuses\" from holy buildings, but implicitly allowed them to take place in the squares outside.", "synonym": "minister"}, {"word": "apothecary ", "definitionA": "a druggist; a pharmacist.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who makes and provides/sells drugs and/or medicines.<br>&nbsp;&nbsp;&nbsp;2. A drugstore or pharmacy.<br>&nbsp;&nbsp;&nbsp;3. A glass jar similar to those once used for medicine.<br>", "etymology": "325–75; Middle English (< Old French ) < Medieval Latin apothēcārius seller of spices and drugs, Late Latin: shopkeeper, equivalent to Latin apothēc ( a ) shop, storehouse (< Greek apothḗkē; apo-, theca ) + -ārius -ary", "example": "“It’s like a little apothecary chest where there are all these different drawers in front of me that I can use,” Bates explains of her acting process.", "synonym": "dispenser"}, {"word": "barley ", "definitionA": "a widely distributed cereal plant belonging to the genus Hordeum, of the grass family, having awned flowers that grow in tightly bunched spikes, with three small additional spikes at each node.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A cereal of the species Hordeum vulgare, or its grains, often used as food or to make beer and other malted drinks.<br>&nbsp;&nbsp;&nbsp;2. Seed of Job's tears (Coix lacryma-jobi)<br>", "etymology": "efore 1000; Middle English; Old English bærlīc (adj.), equivalent to bær- (variant of bere barley; akin to Old Norse barr barley, Gothic barizeins made of barley, Serbo-Croatian brȁšno flour, Latin far emmer; all < European Indo-European *bHaer- spike, prickle, perhaps akin to beard ) + -līc -ly", "example": "The Roman fruitcake was a mash of barley, honey, wine and dried fruit, often pomegranate seeds.", "synonym": "grass"}, {"word": "potable", "definitionA": "fit or suitable for drinking:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any drinkable liquid; a beverage.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Good for drinking without fear of disease or poisoning.<br>", "etymology": "1565–75; < Late Latin pōtābilis drinkable, equivalent to Latin pōtā ( re ) to drink + -bilis -ble", "example": "It can purify approximately four gallons of water per minute and provide a year's worth of potable drinking water for just seven cents per person.", "synonym": "edible"}, {"word": "sojourn", "definitionA": "a temporary stay:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A short stay somewhere.<br>&nbsp;&nbsp;&nbsp;2. A temporary residence.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To reside somewhere temporarily, especially as a guest or lodger.<br>", "etymology": "First recorded in 1200–50; Middle English verb sojurnen, Old French sojorner “to rest, stay,” from unattested Vulgar Latin subdiurnāre “to stay for a time,” a compound of the preposition and prefix sub, sub-, here meaning “a little, for a while” and the Latin verb diurnāre “to live for a long time,” a derivative of the Latin adjective diurnus “belonging to the daytime, occurring every day”; noun derivative of the verb; journey", "example": "You’ll end your sojourn along the ritzy marina of Newport Beach and Balboa Island.", "synonym": "residence"}, {"word": "whelp", "definitionA": "the young of a carnivore, as a dog, bear, lion, seal, etc.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A young offspring of a canid (ursid, felid, pinniped), especially of a dog or a wolf, the young of a bear or similar mammal (lion, tiger, seal); a pup, wolf cub.<br>&nbsp;&nbsp;&nbsp;2. An insolent youth; a mere child.<br>&nbsp;&nbsp;&nbsp;3. A kind of ship.<br>&nbsp;&nbsp;&nbsp;4. One of several wooden strips to prevent wear on a windlass on a clipper-era ship.<br>&nbsp;&nbsp;&nbsp;5. A tooth on a sprocket wheel (compare sprocket and cog).<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of she-dog, she-wolf, vixen, etc.) To give birth.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. Well, typically used in exasperation.<br>", "etymology": "First recorded before 900; Middle English noun, from Old English hwelp (cognate with Old Norse hvelpr, Old Saxon hwelp, Old High German hwelf, welf, German Welf); verb derivative of the noun", "example": "The puppies were whelped by Kruse’s business partner and former employee who sells the litters from Kruse’s breeding dogs under his own license, which had not been suspended.", "synonym": "cub"}, {"word": "intercessor", "definitionA": "a person who intercedes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who intercedes; a mediator; one who reconciles enemies, or pleads for another.<br>&nbsp;&nbsp;&nbsp;2. A bishop who acts during a vacancy in a see.<br>", "etymology": "1475–85; < Latin, equivalent to interced- ( intercession ) + -tor -tor, with dt > ss", "example": "“The Polish pope has been a moral yardstick, a teacher of the faith and an intercessor in heaven” for millions of Poles,” Gadecki said.", "synonym": "arbitrator"}, {"word": "deuterogamy", "definitionA": "digamy.", "definitionB": "No definition found", "etymology": "First recorded in 1650–60, deuterogamy is from the Greek word deuterogamía a second marriage. See deutero-, -gamy", "example": "Deuterogamy, dū-tėr-og′a-mi, n. second marriage, esp. of the clergy, after the death of the first wife.—n.", "synonym": null}, {"word": "digamy", "definitionA": "a second marriage, after the death or divorce of the first husband or wife; deuterogamy. Compare monogamy ( def 3 ).", "definitionB": "No definition found", "etymology": "1625–35; < Late Latin digamia < Greek digamía, equivalent to di- di- 1 + -gamia -gamy", "example": "Thus—to give but a few samples—digamy, or second marriage, is described by Athenagoras as “a decent adultery.”", "synonym": null}, {"word": "heteronomy", "definitionA": "the condition of being under the domination of an outside authority, either human or divine.", "definitionB": "No definition found", "etymology": "First recorded in 1815–25; hetero- + -nomy", "example": "“Heteronomy” is therefore applied by Kant to all other ethical systems, inasmuch as they place the individual in subjection to external laws of conduct.", "synonym": null}]