[{"word": "crook", "definitionA": "a bent or curved implement, piece, appendage, etc.; hook.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A bend; turn; curve; curvature; a flexure.<br>&nbsp;&nbsp;&nbsp;2. A bending of the knee; a genuflection.<br>&nbsp;&nbsp;&nbsp;3. A bent or curved part; a curving piece or portion (of anything).<br>&nbsp;&nbsp;&nbsp;4. A lock or curl of hair.<br>&nbsp;&nbsp;&nbsp;5. A gibbet.<br>&nbsp;&nbsp;&nbsp;6. A support beam consisting of a post with a cross-beam resting upon it; a bracket or truss consisting of a vertical piece, a horizontal piece, and a strut.<br>&nbsp;&nbsp;&nbsp;7. A shepherd's crook; a staff with a semi-circular bend (\"hook\") at one end used by shepherds.<br>&nbsp;&nbsp;&nbsp;8. A bishop's staff of office.<br>&nbsp;&nbsp;&nbsp;9. An artifice; a trick; a contrivance.<br>&nbsp;&nbsp;&nbsp;10. A person who steals, lies, cheats or does other dishonest or illegal things; a criminal.<br>&nbsp;&nbsp;&nbsp;11. A pothook.<br>&nbsp;&nbsp;&nbsp;12. A small tube, usually curved, applied to a trumpet, horn, etc., to change its pitch or key.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bend, or form into a hook.<br>&nbsp;&nbsp;&nbsp;2. To become bent or hooked.<br>&nbsp;&nbsp;&nbsp;3. To turn from the path of rectitude; to pervert; to misapply; to twist.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Bad, unsatisfactory, not up to standard.<br>&nbsp;&nbsp;&nbsp;2. Ill, sick.<br>&nbsp;&nbsp;&nbsp;3. Annoyed, angry; upset.<br>", "etymology": "First recorded in 1125–75; Middle English crok, crouk, from Old Norse krōkr “hook, barb, corner”", "example": "A bouquet of roses rested in the crook of her arm, and a crown adorned her curled blond hair.", "synonym": "cheat"}, {"word": "extenuate", "definitionA": "to represent (a fault, offense, etc.) as less serious:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To lessen; to palliate; to lessen or weaken the force of; to diminish the conception of, as crime, guilt, faults, ills, accusations, etc.<br>&nbsp;&nbsp;&nbsp;2. To make thin or slender; to draw out so as to lessen the thickness.<br>&nbsp;&nbsp;&nbsp;3. To become thinner.<br>&nbsp;&nbsp;&nbsp;4. To lower or degrade; to detract from.<br>", "etymology": "First recorded in 1520–30; from Latin extenuātus, past participle of extenuāre, equivalent to ex- ex- 1 + tenuāre “to make thin or small”; thin; -ate 1( def )", "example": "In general, getting in touch with someone at Etsy to resolve problems or explain extenuating circumstances feels harder than ever.", "synonym": "decrease"}, {"word": "ulotrichous", "definitionA": "belonging to a group of people having woolly or crisply curly hair.", "definitionB": "No definition found", "etymology": "First recorded in 1855–60; from New Latin Ulotrich(i) (plural), formerly a name for a division of humankind (from Greek oulótrichos (singular) “curly-haired,” equivalent to oûlo(s) “thick, fleecy” + -trichos “-haired” (derivative of thríx “hair”) + -ous", "example": null, "synonym": null}, {"word": "perspicacious", "definitionA": "having keen mental perception and understanding; discerning:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of acute discernment; having keen insight; mentally perceptive.<br>&nbsp;&nbsp;&nbsp;2. Able to physically see clearly; quick-sighted; sharp-sighted.<br>", "etymology": "First recorded in 1610–20; perspicaci(ty) + -ous", "example": "This new slight bitterness extended even to his thoughts about the perspicacious Minetta.", "synonym": null}, {"word": "balk", "definitionA": "to stop, as at an obstacle, and refuse to proceed or to do something specified (usually followed by at ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An uncultivated ridge formed in the open field system, caused by the action of ploughing.<br>&nbsp;&nbsp;&nbsp;2. The wall of earth at the edge of an excavation.<br>&nbsp;&nbsp;&nbsp;3. Beam, crossbeam; squared timber; a tie beam of a house, stretching from wall to wall, especially when laid so as to form a loft, \"the balks\".<br>&nbsp;&nbsp;&nbsp;4. A hindrance or disappointment; a check.<br>&nbsp;&nbsp;&nbsp;5. A sudden and obstinate stop; a failure.<br>&nbsp;&nbsp;&nbsp;6. An omission.<br>&nbsp;&nbsp;&nbsp;7. A deceptive motion; a feint.<br>&nbsp;&nbsp;&nbsp;8. The area of the table lying behind the line from which the cue ball is initially shot, and from which a ball in hand must be played.<br>&nbsp;&nbsp;&nbsp;9. The area of the table lying behind the baulk line.<br>&nbsp;&nbsp;&nbsp;10. The rope by which fishing nets are fastened together.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To pass over or by.<br>&nbsp;&nbsp;&nbsp;2. To omit, miss or overlook by chance.<br>&nbsp;&nbsp;&nbsp;3. To miss intentionally; to avoid.<br>&nbsp;&nbsp;&nbsp;4. To stop, check, block.<br>&nbsp;&nbsp;&nbsp;5. To stop short and refuse to go on.<br>&nbsp;&nbsp;&nbsp;6. To refuse suddenly.<br>&nbsp;&nbsp;&nbsp;7. To disappoint; to frustrate.<br>&nbsp;&nbsp;&nbsp;8. To engage in contradiction; to be in opposition.<br>&nbsp;&nbsp;&nbsp;9. To leave or make balks in.<br>&nbsp;&nbsp;&nbsp;10. To leave heaped up; to heap up in piles.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To indicate to fishermen, by shouts or signals from shore, the direction taken by the shoals of herring.<br>", "etymology": "First recorded before 900; Middle English; Old English balca “covering, beam, ridge”; cognate with Old Norse bǫlkr “bar, partition,” Dutch balk, Old Saxon balko, German Balken, Old Norse bjalki “beam,” Old English bolca “plank”; perhaps akin to Latin sufflāmen, Slovenian blazína, Lithuanian balžíenas “beam.” See balcony", "example": "Sidebar: the Electoral College is the balk rule of government.", "synonym": "cramp"}, {"word": "brouhaha", "definitionA": "excited public interest, discussion, or the like, as the clamor attending some sensational event; hullabaloo:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A stir; a fuss or uproar.<br>", "etymology": "First recorded in 1885–90; from French, originally, brou, ha, ha! exclamation used by characters representing the devil in16th-century drama; perhaps from Hebrew, distortion of the recited phrase bārūkh habbā (beshēm ădōnai) “blessed is he who comes (in the name of the Lord)” (Psalms 118:26)", "example": "Last month, for example, there was a public brouhaha over the dismissal of a freelance editor, which worsened when the paper issued a statement on the matter.", "synonym": "ado"}, {"word": "attenuate", "definitionA": "to weaken or reduce in force, intensity, effect, quantity, or value:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To reduce in size, force, value, amount, or degree.<br>&nbsp;&nbsp;&nbsp;2. To make thinner, as by physically reshaping, starving, or decaying.<br>&nbsp;&nbsp;&nbsp;3. To become thin or fine; to grow less.<br>&nbsp;&nbsp;&nbsp;4. To weaken.<br>&nbsp;&nbsp;&nbsp;5. To rarefy.<br>&nbsp;&nbsp;&nbsp;6. To reduce the virulence of a bacterium or virus.<br>&nbsp;&nbsp;&nbsp;7. To reduce the amplitude of an electrical, radio, or optical signal.<br>&nbsp;&nbsp;&nbsp;8. (of a beer) To become less dense as a result of the conversion of sugar to alcohol.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of leaves) Gradually tapering into a petiole-like extension toward the base.<br>", "etymology": "First recorded in 1520–30; from Latin attenuātus (past participle of attenuāre “to make thin, reduce”); at-, tenuis, -ate 1", "example": "RNA vaccines were developed as an alternative to the standard method of vaccination using attenuated or inactivated microorganisms.", "synonym": "abate"}, {"word": "hypotenuse", "definitionA": "the side of a right triangle opposite the right angle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The side of a right triangle opposite the right angle.<br>", "etymology": "1565–75; earlier hypotenusa < Latin hypotēnūsa < Greek hypoteínousa ( grámmē ) subtending (line) (feminine present participle of hypoteínein to subtend), equivalent to hypo- hypo- + tein- stretch ( thin ) + -ousa feminine present participle suffix", "example": "That’s because 65 happened to be the length of the hypotenuse for three distinct Pythagorean triples with legs that formed an arithmetic sequence.", "synonym": null}, {"word": "subtend", "definitionA": "Geometry. to extend under or be opposite to:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To use an angle to delimit (mark off, enclose) part of a straight or curved line, for example an arc or the opposite side of a triangle.<br>&nbsp;&nbsp;&nbsp;2. (also mathematics) To extend or stretch opposite something; to be part of a straight or curved line that is opposite to and delimits an angle.<br>&nbsp;&nbsp;&nbsp;3. To form the central angle of a circle underneath an arc<br>", "etymology": "1560–70; < Latin subtendere to stretch beneath, equivalent to sub- sub- + tendere to stretch; tend 1", "example": "For this purpose the condenser should subtend as large an angle as possible at the source of light.", "synonym": "attach"}, {"word": "sitar", "definitionA": "a lute of India with a small, pear-shaped body and a long, broad, fretted neck.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A Hindustani/Indian classical stringed instrument, typically having a gourd as its resonating chamber.<br>", "etymology": "First recorded in 1835–45, sitar is from the Hindi word sitār", "example": "First up, he got interested in Indian music and took lessons on sitar from Ravi Shankar.", "synonym": null}]