[{"word": "whack", "definitionA": "to strike with a smart, resounding blow or blows.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Egregious.<br>&nbsp;&nbsp;&nbsp;2. Bad (not good), inauthentic, of an inferior quality, contemptible, lacking integrity, lame, or strange.<br>&nbsp;&nbsp;&nbsp;3. Crazy, mad, insane.<br>&nbsp;&nbsp;&nbsp;4. Cool, bizarre, and potentially scary.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sound of a heavy strike.<br>&nbsp;&nbsp;&nbsp;2. The strike itself.<br>&nbsp;&nbsp;&nbsp;3. The stroke itself, regardless of its successful impact.<br>&nbsp;&nbsp;&nbsp;4. An attempt, a chance, a turn, a go, originally an attempt to beat someone or something.<br>&nbsp;&nbsp;&nbsp;5. (originally Britain cant) A share, a portion, especially a full share or large portion.<br>&nbsp;&nbsp;&nbsp;6. A whack-up: a division of an amount into separate whacks, a divvying up.<br>&nbsp;&nbsp;&nbsp;7. A deal, an agreement.<br>&nbsp;&nbsp;&nbsp;8. The backslash, ⟨ \\ ⟩.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hit, slap or strike.<br>&nbsp;&nbsp;&nbsp;2. To kill, bump off.<br>&nbsp;&nbsp;&nbsp;3. To share or parcel out; often with up.<br>&nbsp;&nbsp;&nbsp;4. To beat convincingly; to thrash.<br>&nbsp;&nbsp;&nbsp;5. (usually in the negative) To surpass; to better.<br>", "etymology": "First recorded in 1710–20; originally dialect, Scots form of thwack; whang 2, whittle", "example": "In those days the business was a safe haven for misfits of every persuasion who all seemed to have a whacked sense of humor and a genuine appreciation for the absurdities of life.", "synonym": "bang"}, {"word": "thwack", "definitionA": "to strike or beat vigorously with something flat; whack.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The act of thwacking; a strike or blow, especially with a flat implement.<br>&nbsp;&nbsp;&nbsp;2. A heavy slapping sound.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hit with a flat implement.<br>&nbsp;&nbsp;&nbsp;2. To beat.<br>&nbsp;&nbsp;&nbsp;3. To fill to overflow.<br>", "etymology": "First recorded in 1520–30; imitative", "example": "The truck, which serves Mexican food, was parked across from a two-story home under construction, where the clang of hammers and thwack of nail guns sent echoes through the canyon.", "synonym": "bang"}, {"word": "whang", "definitionA": "a resounding blow.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A blow; a whack.<br>&nbsp;&nbsp;&nbsp;2. A large piece or slice; a chunk.<br>&nbsp;&nbsp;&nbsp;3. A house-cleaning party.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (chiefly of an object) To make a noise like something moving quickly through the air.<br>&nbsp;&nbsp;&nbsp;2. To throw with a rapid slamming motion.<br>&nbsp;&nbsp;&nbsp;3. To whack or beat.<br>&nbsp;&nbsp;&nbsp;4. To slice, especially into large pieces; to chop.<br>", "etymology": "First recorded in 1815–25; imitative", "example": "Around here the people seem content to settle for whatever scars life whangs them with as a decoration.", "synonym": "bang"}, {"word": "whittle", "definitionA": "to cut, trim, or shape (a stick, piece of wood, etc.) by carving off bits with a knife.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A knife; especially, a pocket knife, sheath knife, or clasp knife.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut or shape wood with a knife.<br>&nbsp;&nbsp;&nbsp;2. To reduce or gradually eliminate something (such as a debt).<br>&nbsp;&nbsp;&nbsp;3. To make eager or excited; to excite with liquor; to inebriate.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A coarse greyish double blanket worn by countrywomen, in the west of England, over the shoulders, like a cloak or shawl.<br>&nbsp;&nbsp;&nbsp;2. A whittle shawl; a kind of fine woollen shawl, originally and especially a white one.<br>", "etymology": "1375–1425; late Middle English (noun), dialectal variant of thwitel knife, Old English thwīt ( an ) to cut + -el -le", "example": "The remaining seven spots are being contested by 14 nations, whittled down from 28.", "synonym": "carve"}, {"word": "schizophrenia", "definitionA": "Psychiatry.  a spectrum of mental disorders characterized by emotional blunting, intellectual deterioration, social isolation, disorganized speech and behavior, delusions, hallucinations, or a combination of any of these symptoms. Formerly  dementia praecox.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A psychiatric diagnosis denoting a persistent, often chronic, mental illness characterised by abnormal perception, thinking, behavior and emotion, often marked by delusions.<br>&nbsp;&nbsp;&nbsp;2. Any condition in which disparate or mutually exclusive activities coexist; a lack of decision between options.<br>", "etymology": "First recorded in 1910–15; schizo- + -phrenia", "example": "Calocane, who had been diagnosed with paranoid schizophrenia, was given a hospital order for manslaughter on the basis of diminished responsibility in January.", "synonym": null}, {"word": "drub", "definitionA": "to beat with a stick or the like; cudgel; flog; thrash.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Carbonaceous shale; small coal; slate, dross, or rubbish in coal.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beat (someone or something) with a stick.<br>&nbsp;&nbsp;&nbsp;2. To defeat someone soundly; to annihilate or crush.<br>&nbsp;&nbsp;&nbsp;3. To forcefully teach something.<br>&nbsp;&nbsp;&nbsp;4. To criticize harshly; to excoriate.<br>", "etymology": "1625–35; perhaps by uncertain mediation < Arabic ḍarb blow, beating", "example": "Australia needed a response after a comprehensive drubbing by India in the first Test in Perth - and Starc duly provided the impetus.", "synonym": "beat"}, {"word": "misbegotten", "definitionA": "unlawfully or irregularly begotten; begotten; born of unmarried parents; illegitimate:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To beget wrongly or badly.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. (sometimes derogatory) One born illegitimately (i.e., out of wedlock); a bastard.<br>&nbsp;&nbsp;&nbsp;2. (in the plural) A person born into infelicitous circumstances.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a person) Born out of wedlock; illegitimate.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Ill-conceived.<br>&nbsp;&nbsp;&nbsp;3. (by extension) Bad; worthless.<br>", "etymology": "First recorded in 1540–50; mis- 1 + begotten", "example": "Before long, however, President George W. Bush’s misbegotten war in Iraq shattered the sense of oneness.", "synonym": null}, {"word": "galvanize", "definitionA": "to stimulate by or as if by a galvanic current.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To coat with a thin layer of metal by electrochemical means.<br>&nbsp;&nbsp;&nbsp;2. To coat with rust-resistant zinc.<br>&nbsp;&nbsp;&nbsp;3. To shock or stimulate into sudden activity, as if by electric shock.<br>&nbsp;&nbsp;&nbsp;4. To electrify.<br>&nbsp;&nbsp;&nbsp;5. To switch sides between Union and Confederate in the American Civil War.<br>", "etymology": "First recorded in 1795–1805; from French galvaniser, named after Luigi Galvani; -ize", "example": "Rasoulof sides with the two daughters galvanized by the violence over their morally exhausted father, a judge who comes home from work having sentenced protesters by the hundreds.", "synonym": "animate"}, {"word": "diurnal", "definitionA": "of or relating to a day or each day; daily.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A flower that opens only in the day.<br>&nbsp;&nbsp;&nbsp;2. A book containing canonical offices performed during the day, hence not matins.<br>&nbsp;&nbsp;&nbsp;3. A diary or journal.<br>&nbsp;&nbsp;&nbsp;4. A daily news publication.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Happening or occurring during daylight, or primarily active during that time.<br>&nbsp;&nbsp;&nbsp;2. Said of a flower open, or releasing its perfume during daylight hours, but not at night.<br>&nbsp;&nbsp;&nbsp;3. Having a daily cycle that is completed every 24 hours, usually referring to tasks, processes, tides, or sunrise to sunset; circadian.<br>&nbsp;&nbsp;&nbsp;4. Done once every day; daily, quotidian.<br>&nbsp;&nbsp;&nbsp;5. Published daily.<br>", "etymology": "1400–50; late Middle English < Latin diurnālis, equivalent to diurn ( us ) daily + -ālis -al 1", "example": "Wilder’s drama, offering a guided tour of an ordinary town going about its diurnal business, reminds us, through the inescapable shadow of mortality, of what we have in common.", "synonym": "common"}, {"word": "augury", "definitionA": "the art or practice of an augur; divination.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A divination based on the appearance and behaviour of animals.<br>&nbsp;&nbsp;&nbsp;2. (by extension) An omen or prediction; a foreboding; a prophecy.<br>&nbsp;&nbsp;&nbsp;3. An event that is experienced as indicating important things to come.<br>", "etymology": "1325–75; Middle English < Latin augurium soothsaying, equivalent to augur augur 1 + -ium -ium", "example": "“My life and myself were born under the sea,” she wrote, under the augury of “the star of Aphrodite.”", "synonym": "auspice"}, {"word": "hardihood", "definitionA": "boldness or daring; courage.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Unyielding boldness and daring; firmness in doing something that exposes one to difficulty, danger, or calamity; intrepidness.<br>&nbsp;&nbsp;&nbsp;2. Excessive boldness; foolish daring; offensive assurance.<br>&nbsp;&nbsp;&nbsp;3. (of a plant) Ability to withstand extreme conditions, hardiness.<br>", "etymology": "First recorded in 1625–35; hardy 1 + -hood", "example": "All week the “atmospheric river” took huge dragon bites out of local coastlines, but the 49ers practiced outside in an exhibition of prideful, defiant hardihood.", "synonym": "audacity"}, {"word": "askance", "definitionA": "with suspicion, mistrust, or disapproval:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To look at (someone or something) with a sideways glance.<br>&nbsp;&nbsp;&nbsp;2. To turn (one's eye or gaze) to the side.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Turned to the side, especially of the eyes.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a look or glance) With disapproval, skepticism, or suspicion.<br>&nbsp;&nbsp;&nbsp;2. Sideways; obliquely.<br>", "etymology": "First recorded in 1520–30; earlier a scanche, a sca(u)nce; of obscure origin", "example": "“Often, people look askance at victims who come forward with allegations years after a crime,” Boyarsky said in a statement.", "synonym": null}, {"word": "prorogue", "definitionA": "to discontinue a session of (the British Parliament or a similar body).", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To suspend (a parliamentary session) or to discontinue the meetings of (an assembly, parliament etc.) without formally ending the session.<br>&nbsp;&nbsp;&nbsp;2. To defer.<br>&nbsp;&nbsp;&nbsp;3. To prolong or extend.<br>", "etymology": "First recorded in 1375–1425; from late Middle English proroge, from Latin prōrogāre “to prolong, protract, defer,” literally, “to ask publicly,” equivalent to prō- pro- 1 + rogāre “to ask, propose”", "example": "As we just mentioned, the King prorogued Parliament for the first time during his reign at the end of the day on Friday.", "synonym": "curb"}, {"word": "lickerish", "definitionA": "fond of and eager for choice food.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Eager; craving; urged by desire; eager to taste or enjoy; greedy.<br>&nbsp;&nbsp;&nbsp;2. Lecherous; lustful.<br>&nbsp;&nbsp;&nbsp;3. Tempting the appetite; dainty.<br>", "etymology": "First recorded in 1300–50; Middle English liker(ous) “pleasing to the taste,” literally, “to a licker” ( lick, -er 1 ) + -ish 1", "example": "Other high points in the series, which runs through Aug. 13, include “Camille 2000” and “The Lickerish Quartet,” which some considered to be his finest work.", "synonym": null}, {"word": "scuttle", "definitionA": "Nautical.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A container like an open bucket (usually to hold and carry coal).<br>&nbsp;&nbsp;&nbsp;2. A broad, shallow basket.<br>&nbsp;&nbsp;&nbsp;3. A dish, platter or a trencher.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small hatch or opening in a boat. Also, small opening in a boat or ship for draining water from open deck.<br>&nbsp;&nbsp;&nbsp;2. A hatch that provides access to the roof from the interior of a building.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cut a hole or holes through the bottom, deck, or sides of (as of a ship), for any purpose.<br>&nbsp;&nbsp;&nbsp;2. To deliberately sink one's ship or boat by any means, usually by order of the vessel's commander or owner.<br>&nbsp;&nbsp;&nbsp;3. (by extension, in figurative use) Undermine or thwart oneself (sometimes intentionally), or denigrate or destroy one's position or property; compare scupper.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A quick pace; a short run.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To move hastily, to scurry.<br>", "etymology": "First recorded in 1490–1500; of obscure origin; perhaps from Middle French escoutille or Spanish escotilla “hatchway,” equivalent to Spanish escot(e) “a cutting of cloth” + -illa, diminutive suffix; of Germanic origin; compare Gothic skaut “hem, seam”; sheet 1( def ) )", "example": "Discovery, has become nearly as renowned for scuttling finished films in recent years as it is for releasing them.", "synonym": "abandon"}, {"word": "flavescent", "definitionA": "turning yellow; yellowish.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Yellow-ish in colour, or turning yellow<br>", "etymology": "First recorded in 1850–55; from Latin flāvescent-, stem of flāvescēns, present participle of flāvescere “to become yellow.” See flav-, -esce, -ent", "example": "Flavescent, fla-ves′ent, adj. yellowish or turning yellow.", "synonym": null}, {"word": "kudos", "definitionA": "honor; glory; acclaim:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Praise; accolades.<br>&nbsp;&nbsp;&nbsp;2. Credit for one's achievements.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A compliment or praise.<br>", "etymology": "First recorded in 1825–35; irregular transliteration of Greek kŷdos", "example": "Without the kudos of the King, any plans would be easier for opposition politicians to reject – but Labour has a once-in-a-generation majority to vote through big reforms.", "synonym": "credit"}]