[{"word": "flashy", "definitionA": "sparkling or brilliant, especially in a superficial way or for the moment:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showy; visually impressive, attention-getting, or appealing.<br>&nbsp;&nbsp;&nbsp;2. Flashing; producing flashes.<br>&nbsp;&nbsp;&nbsp;3. Drunk; tipsy<br>", "etymology": "First recorded in 1575–85; flash + -y 1", "example": "They look sharp without being flashy, and their optics are fantastic on top of not having to worry about fogging them up on an aerobic powder day.", "synonym": null}, {"word": "panacea", "definitionA": "a remedy for all disease or ills.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A remedy believed to cure all disease and prolong life that was originally sought by alchemists; a cure-all.<br>&nbsp;&nbsp;&nbsp;2. Something that will solve all problems.<br>&nbsp;&nbsp;&nbsp;3. The plant allheal (Valeriana officinalis), believed to cure all ills.<br>", "etymology": "First recorded in 1540–50; from Latin, from Greek panákeia, equivalent to panake-, stem of panakḗs “all-healing” ( pan- “all” + akḗs “a cure”) + -ia noun suffix; pan-, -ia", "example": "It’s not a panacea or a way to fully absolve ourselves of responsibility, but offsets can help, especially where eliminating emissions won’t happen easily—just be sure to do your homework to find a solid program.", "synonym": "catholicon"}, {"word": "commissary", "definitionA": "a store that sells food and supplies to the personnel or workers in a military post, mining camp, lumber camp, or the like.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A store primarily serving persons in an institution, most often soldiers or prisoners.<br>&nbsp;&nbsp;&nbsp;2. A cafeteria at a movie studio.<br>&nbsp;&nbsp;&nbsp;3. One to whom is committed some charge, duty, or office, by a superior power; a commissioner.<br>&nbsp;&nbsp;&nbsp;4. An officer of the bishop, who exercises ecclesiastical jurisdiction in parts of the diocese at a distance from the residence of the bishop.<br>&nbsp;&nbsp;&nbsp;5. An officer who supplies provisions to an army.<br>&nbsp;&nbsp;&nbsp;6. The judge in a commissary court.<br>&nbsp;&nbsp;&nbsp;7. A higher-ranking police officer.<br>", "etymology": "1350–1400; Middle English commissarie (< Anglo-French ) < Medieval Latin commissārius, equivalent to Latin commiss ( us ) (past participle of committere to commit ) + -ārius -ary", "example": "Laundry service is every day and commissary prices are substantially lower.", "synonym": "agent"}, {"word": "ossify", "definitionA": "to convert into or cause to harden like bone.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To transform (or cause to transform) from a softer animal substance into bone; particularly the processes of growth in humans and animals.<br>&nbsp;&nbsp;&nbsp;2. (animate) To become (or cause to become) inflexible and rigid in habits or opinions.<br>&nbsp;&nbsp;&nbsp;3. (inanimate) To grow (or cause to grow) formulaic and permanent.<br>&nbsp;&nbsp;&nbsp;4. To calcify.<br>", "etymology": "1705–15; < Latin ossi- (stem of os ) bone + -fy", "example": "Valves of the Aorta of a cartilaginous texture, as if beginning to ossify.", "synonym": "congeal"}, {"word": "clepsydra", "definitionA": "an ancient device for measuring time by the regulated flow of water or mercury through a small aperture.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A water clock, especially as used in the ancient world.<br>", "etymology": "1640–50; < Latin < Greek klepsýdra, equivalent to kleps- ( klep-, stem of kléptein to steal, conceal + -s- formative in derivation) + hydra, derivative of hýdōr water", "example": "Perhaps the earliest mechanical time measure was the clepsydra, or water clock.", "synonym": "calendar"}, {"word": "sodden", "definitionA": "soaked with liquid or moisture; saturated.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drench, soak or saturate.<br>&nbsp;&nbsp;&nbsp;2. To become soaked.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Soaked or drenched with liquid; soggy, saturated.<br>&nbsp;&nbsp;&nbsp;2. Boiled.<br>&nbsp;&nbsp;&nbsp;3. Drunk; stupid as a result of drunkenness.<br>&nbsp;&nbsp;&nbsp;4. Dull, expressionless (of a person’s appearance)<br>", "etymology": "1250–1300; Middle English soden, sothen, past participle of sethen to seethe", "example": "It’s a perfect growing medium for many plants, as it holds moisture and oxygen without getting sodden.", "synonym": "pickled"}, {"word": "soggy", "definitionA": "soaked; thoroughly wet; sodden.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Soaked with moisture or other liquid.<br>", "etymology": "1590–1600; dial. sog bog + -y 1; compare Norwegian (dial.) soggjast to get soaked", "example": "Plus, some don’t recognize the difference between a hard floor and carpet so you could end up with a soggy rug if you’re not careful.", "synonym": null}, {"word": "kleptomania", "definitionA": "an irresistible impulse to steal, stemming from emotional disturbance rather than economic need.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A psychological disorder that causes an uncontrollable obsession with stealing without economic or material need.<br>", "etymology": "1820–30; klepto- (combining form of Greek kléptēs thief ) + -mania", "example": "Its exercise would probably be classed with kleptomania and other like excesses of purely personal consideration.", "synonym": null}, {"word": "anhydrous", "definitionA": "with all water removed, especially water of crystallization.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having little or no water.<br>&nbsp;&nbsp;&nbsp;2. Having no water of crystallization.<br>", "etymology": "1810–20; < Greek ánȳdros waterless (with etymological h restored). See an- 1, hydro- 1, -ous", "example": "Anhydrous, an-hī′drus, adj. a term applied to a chemical substance free from water.", "synonym": null}, {"word": "aquaphobia", "definitionA": "an irrational or disproportionate fear of water, especially anxiety in deep water or when submerging one's face in water: Compare hydrophobia ( def 1 ).", "definitionB": "No definition found", "etymology": "First recorded in 1875–80; aqua- + -phobia", "example": null, "synonym": null}, {"word": "hydrophobia", "definitionA": "an extreme dread or fear of water, especially when associated with painful involuntary throat spasms from a rabies infection. Compare aquaphobia.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An aversion to water, as a symptom of rabies; the disease of rabies itself.<br>&nbsp;&nbsp;&nbsp;2. A morbid fear of water; aquaphobia.<br>", "etymology": "First recorded in 1540–50; from Late Latin, from Greek hydrophobía; hydro- 1, -phobia", "example": "Perhaps because of these factors, even today, blacks appear to be more prone to hydrophobia than whites.", "synonym": null}]