[{"word": "nuncupative", "definitionA": "(especially of a will) oral; not written.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Oral; not written.<br>&nbsp;&nbsp;&nbsp;2. Publicly or solemnly declaratory.<br>&nbsp;&nbsp;&nbsp;3. Nominal; existing only in name.<br>", "etymology": "First recorded in 1400–50; from Medieval Latin (testāmentum) nuncupātīvum “oral (will),” neuter of Late Latin nuncupātīvus “so-called, nominal,” equivalent to Latin nuncupāt(us), past participle of nuncupāre “to state formally, utter the name of” (probably from unattested nōmicupāre, derivative of nōmiceps “one taking a name,” equivalent to nōmi- combining form of nōmen “name” + -ceps “taker, catcher”); prince ( def ) ) + -īvus -ive ( def )", "example": "Upon this, Chancellor Kent observed: “I should hope to see one day a law that no nuncupative will should be valid in any case.”", "synonym": null}, {"word": "avid", "definitionA": "showing great enthusiasm for or interest in:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Enthusiastic; keen; eager; showing great interest in something or desire to do something<br>", "etymology": "First recorded in 1760–70; from French avide, from Latin avidus, equivalent to av(ēre) “to crave” + -idus adjective suffix; -id 4", "example": "Favorite books can be displayed vertically stacked in between, which makes this a great and thoughtful choice for avid readers.", "synonym": null}, {"word": "scabbard", "definitionA": "a sheath for a sword or the like.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The sheath of a sword.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put an object (especially a sword) into its scabbard.<br>", "etymology": "1250–1300; Middle English scalburde, scauberge (compare Anglo-French escauberz, escauberge, Medieval Latin escauberca ) ≪ dissimilated variant of Old High German *skārberga sword-protection. See shear, harbor", "example": "Whenever an injustice occurred, Hitchens would declare, “The pen of the Hitch will flash from its scabbard.”", "synonym": "bag"}, {"word": "sheath", "definitionA": "a case or covering for the blade of a sword, dagger, or the like.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A holster for a sword; a scabbard.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Anything that has a similar shape to a scabbard that is used to hold an object that is longer than it is wide.<br>&nbsp;&nbsp;&nbsp;3. The base of a leaf when sheathing or investing a branch or stem, as in grasses.<br>&nbsp;&nbsp;&nbsp;4. The insulating outer cover of an electrical cable.<br>&nbsp;&nbsp;&nbsp;5. One of the elytra of an insect.<br>&nbsp;&nbsp;&nbsp;6. A tight-fitting dress.<br>&nbsp;&nbsp;&nbsp;7. The foreskin of certain animals (for example, dogs and horses).<br>&nbsp;&nbsp;&nbsp;8. A condom.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put (something such as a knife or sword) into a sheath.<br>&nbsp;&nbsp;&nbsp;2. To encase (something) with a protective covering.<br>&nbsp;&nbsp;&nbsp;3. Of an animal: to draw back or retract (a body part) into the body, such as claws into a paw.<br>&nbsp;&nbsp;&nbsp;4. To thrust (a sharp object like a sword, a claw, or a tusk) into something.<br>&nbsp;&nbsp;&nbsp;5. To abandon or cease (animosity, etc.)<br>&nbsp;&nbsp;&nbsp;6. To provide (a sword, etc.) with a sheath.<br>&nbsp;&nbsp;&nbsp;7. To relieve the harsh or painful effect of (a drug, a poison, etc.).<br>", "etymology": "before 950; Middle English s ( c ) heth ( e ), Old English scēath; cognate with German Scheide; shed 2", "example": "The included rugged leather sheath securely attaches to a belt.", "synonym": "cover"}, {"word": "holster", "definitionA": "a sheathlike carrying case for a firearm, attached to a belt, shoulder sling, or saddle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A case for carrying a tool, particularly a gun, safely and accessibly.<br>&nbsp;&nbsp;&nbsp;2. A belt with loops or slots for carrying small tools or other equipment.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put something in a holster.<br>", "etymology": "1655–65; < Dutch; cognate with Gothic hulistr, Old Norse hulstr sheath; akin to Old English helan to hide", "example": "The pistol was in a distinctive holster depicting the American flag and the words “We the People.”", "synonym": null}, {"word": "wager", "definitionA": "something risked or staked on an uncertain event; bet:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Something deposited, laid, or hazarded on the event of a contest or an unsettled question; a bet; a stake; a pledge.<br>&nbsp;&nbsp;&nbsp;2. That on which bets are laid; the subject of a bet.<br>&nbsp;&nbsp;&nbsp;3. A contract by which two parties or more agree that a certain sum of money, or other thing, shall be paid or delivered to one of them, on the happening or not happening of an uncertain event.<br>&nbsp;&nbsp;&nbsp;4. An offer to make oath.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To bet something; to put it up as collateral<br>&nbsp;&nbsp;&nbsp;2. To suppose; to dare say.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Agent noun of wage; one who wages.<br>", "etymology": "1275–1325; Middle English wajour, wager solemn pledge < Anglo-French wageure, equivalent to wage ( r ) to pledge ( wage ) + -ure -ure", "example": "After all, states have bet big on betting and, in most cases, are still waiting for the long-shot wager to pay off.", "synonym": "action"}, {"word": "slog", "definitionA": "to hit hard, as in boxing or cricket; slug.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long, tedious walk, or session of work.<br>&nbsp;&nbsp;&nbsp;2. An aggressive shot played with little skill.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To walk slowly, encountering resistance.<br>&nbsp;&nbsp;&nbsp;2. (by extension) To work slowly and deliberately at a tedious task.<br>&nbsp;&nbsp;&nbsp;3. To strike something with a heavy blow, especially a ball with a bat.<br>", "etymology": "First recorded in 1850–55; variant of slug 2", "example": "The 50 millimeters of foam underfoot also virtually eliminated the chronic knee and hip pain I typically experience after long downhill slogs.", "synonym": "drag"}, {"word": "annals", "definitionA": "a record of events, especially a yearly record, usually in chronological order.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The record of a single event or item.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A relation of events in chronological order, each event being recorded under the year in which it happened.<br>&nbsp;&nbsp;&nbsp;2. Historical records; chronicles; history.<br>&nbsp;&nbsp;&nbsp;3. A periodic publication, containing records of discoveries, transactions of societies, etc.<br>", "etymology": "1555–65; (< Middle French ) < Latin annālēs ( librī ) literally, yearly (books), plural of annālis continuing for a year, annual, equivalent to ann ( us ) a year + ālis -al 1", "example": "Because Patel’s Gawain is “green” himself, the film frames his acceptance of the challenge as a way to have a noble adventure and inscribe his name in the annals of history.", "synonym": null}, {"word": "annular", "definitionA": "having the form of a ring.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to, or having the form of, a ring; ring-shaped; in the shape of an annulus.<br>&nbsp;&nbsp;&nbsp;2. Banded or marked with circles.<br>", "etymology": "1565–75; < Latin annulāris, equivalent to annul ( us ) ring (variant of ānulus ) + -āris -ar 1", "example": "This improved process of casting may also be employed for objects which do not possess an exactly annular section.", "synonym": null}, {"word": "indignant", "definitionA": "feeling, characterized by, or expressing strong displeasure at something considered unjust, offensive, insulting, or base:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showing anger or indignation, especially at something unjust or wrong.<br>", "etymology": "First recorded in 1580–90; from Latin indignant- (stem of indignāns, present participle of indignārī “to deem unworthy, take offense”), equivalent to in- in- 3 + dign-, stem of dignus “worthy” + -ant- -ant", "example": "When I did that last year, the interviewer became indignant, saying that asking why the prior employee left was inappropriate and that I was asking about a private personnel matter.", "synonym": null}, {"word": "tchotchke", "definitionA": "an inexpensive souvenir, trinket, or ornament.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trinket.<br>&nbsp;&nbsp;&nbsp;2. An attractive woman or girl.<br>", "etymology": "First recorded in 1965–70, Americanism; from Yiddish tshatshke, from Polish czaczko “bibelot, knickknack” (now obsolete; compare modern cacko with same sense, originally dialect); of expressive origin", "example": "The delicate tea set, the corn husk dolls, the tchotchkes from the Old Country.", "synonym": null}, {"word": "knickknack", "definitionA": "an ornamental trinket or gimcrack; a bit of bric-a-brac.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small ornament of minor value.<br>", "etymology": "1610–20; gradational compound based on knack in obsolete sense “toy”", "example": "The next few hours were a flurry of vacuuming and dusting as my mother chain-smoked her way through the house rearranging knickknacks.", "synonym": "bagatelle"}, {"word": "trinket", "definitionA": "a small ornament, piece of jewelry, etc., usually of little value.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small showy ornament or piece of jewelry<br>&nbsp;&nbsp;&nbsp;2. A thing of little value; a trifle; a toy.<br>&nbsp;&nbsp;&nbsp;3. A three-cornered sail formerly carried on a ship's foremast, probably on a lateen yard.<br>&nbsp;&nbsp;&nbsp;4. A knife; a cutting tool.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To give trinkets; to court favour.<br>", "etymology": "First recorded in 1525–35; origin uncertain", "example": "The walls of his office were lined with treasures and trinkets from his travels, which his brother said he used to ease the nerves of his clients.", "synonym": "bagatelle"}, {"word": "copious", "definitionA": "large in quantity or number; abundant; plentiful:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Vast in quantity or number, profuse, abundant; taking place on a large scale.<br>&nbsp;&nbsp;&nbsp;2. Having an abundant supply.<br>&nbsp;&nbsp;&nbsp;3. Full of thought, information, or matter; exuberant in words, expression, or style.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin cōpiōsus “plentiful, rich,” from cōpi(a) “wealth” (from co- co- + op(s) “plenty, power, support” + -ia -ia ) + -ōsus -ous", "example": "In general, larger, lined notebooks work best for school settings where you’ll be taking copious notes throughout the day.", "synonym": null}, {"word": "impugn", "definitionA": "to challenge as false (another's statements, motives, etc.); cast doubt upon.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To assault, attack.<br>&nbsp;&nbsp;&nbsp;2. To verbally assault, especially to argue against an opinion, motive, or action; to question the truth or validity of.<br>", "etymology": "1325–75; Middle English impugnen < Middle French impugner < Latin impugnāre to attack, equivalent to im- im- 1 + pugnāre to fight, derivative of pugnus fist; pugnacious", "example": "It’s more work for you, of course, but the goal is to ensure your behavior is above reproach while giving Wanda space to prove —or impugn — herself.", "synonym": "attack"}, {"word": "riffraff", "definitionA": "people, or a group of people, regarded as disreputable or worthless:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The rabble; crowds; the common people.<br>&nbsp;&nbsp;&nbsp;2. Sweepings; refuse.<br>", "etymology": "1425–75; late Middle English rif and raf every particle, things of small value < Old French rif et raf, formed on rifler to spoil ( rifle 2 ), raffler to ravage, snatch away", "example": "Then, the specific one that a scientist wants to study is separated from the riffraff by magnets that redirect particles based on their mass and electric charge.", "synonym": "commonality"}, {"word": "exculpate", "definitionA": "to clear from a charge of guilt or fault; free from blame; vindicate.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To clear of or to free from guilt; exonerate.<br>", "etymology": "First recorded in 1650–60; from Latin exculpātus “freed from blame,” equivalent to ex- ex- 1 + culpātus “blamed” (past participle of culpāre; culpable )", "example": "In other words, such is the desire which every one has to exculpate himself by blackening his neighbour.", "synonym": "absolve"}, {"word": "scrofulous", "definitionA": "pertaining to, resembling, of the nature of, or affected with scrofula.", "definitionB": "No definition found", "etymology": "First recorded in 1605–15; scroful(a) + -ous", "example": "Sheerly by chance, some of those scrofulous churls will have some minor position of power in one institution or another.", "synonym": null}, {"word": "slug", "definitionA": "any of various snaillike terrestrial gastropods having no shell or only a rudimentary one, feeding on plants and a pest of leafy garden crops.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any of many terrestrial pulmonate gastropod mollusks, having no (or only a rudimentary) shell.<br>&nbsp;&nbsp;&nbsp;2. A slow, lazy person; a sluggard.<br>&nbsp;&nbsp;&nbsp;3. A bullet or other projectile fired from a firearm; in modern usage, generally refers to a shotgun slug.<br>&nbsp;&nbsp;&nbsp;4. A solid block or piece of roughly shaped metal.<br>&nbsp;&nbsp;&nbsp;5. A counterfeit coin, especially one used to steal from vending machines.<br>&nbsp;&nbsp;&nbsp;6. A shot of a drink, usually alcoholic.<br>&nbsp;&nbsp;&nbsp;7. A title, name or header, a catchline, a short phrase or title to indicate the content of a newspaper or magazine story for editing use.<br>&nbsp;&nbsp;&nbsp;8. (rarely used) the Imperial (English) unit of mass that accelerates by 1 foot per second squared (1 ft/s²) when a force of one pound-force (lbf) is exerted on it.<br>&nbsp;&nbsp;&nbsp;9. A discrete mass of a material that moves as a unit, usually through another material.<br>&nbsp;&nbsp;&nbsp;10. A motile pseudoplasmodium formed by amoebae working together.<br>&nbsp;&nbsp;&nbsp;11. An accessory to a diesel-electric locomotive, used to increase adhesive weight and allow full power to be applied at a lower speed. It has trucks with traction motors but lacks a prime mover.<br>&nbsp;&nbsp;&nbsp;12. (television editing) A black screen.<br>&nbsp;&nbsp;&nbsp;13. A piece of type metal imprinted by a linotype machine; also a black mark placed in the margin to indicate an error; also said in application to typewriters; type slug.<br>&nbsp;&nbsp;&nbsp;14. A stranger picked up as a passenger to enable legal use of high occupancy vehicle lanes.<br>&nbsp;&nbsp;&nbsp;15. (District of Columbia) A hitchhiking commuter.<br>&nbsp;&nbsp;&nbsp;16. The last part of a clean URL, the displayed resource name, similar to a filename.<br>&nbsp;&nbsp;&nbsp;17. A hindrance, an obstruction.<br>&nbsp;&nbsp;&nbsp;18. A ship that sails slowly.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drink quickly; to gulp; to down.<br>&nbsp;&nbsp;&nbsp;2. To take part in casual carpooling; to form ad hoc, informal carpools for commuting, essentially a variation of ride-share commuting and hitchhiking.<br>&nbsp;&nbsp;&nbsp;3. (of a bullet) To become reduced in diameter, or changed in shape, by passing from a larger to a smaller part of the bore of the barrel.<br>&nbsp;&nbsp;&nbsp;4. To move slowly or sluggishly; to lie idle.<br>&nbsp;&nbsp;&nbsp;5. To load with a slug or slugs.<br>&nbsp;&nbsp;&nbsp;6. To make sluggish.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hard blow, usually with the fist.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To hit very hard, usually with the fist.<br>", "etymology": "First recorded in 1375–1425; late Middle English slugge “sluggard,” from Scandinavian; compare Norwegian (dialectal) sluggje “heavy, slow person”", "example": "Instead, after the initial slug of snow, they predict a dry slot to punch into the region as temperatures rise while the secondary low forms and exits to our east.", "synonym": "batter"}]