[{"word": "anthology", "definitionA": "a book or other collection of selected writings by various authors, usually in the same literary form, of the same period, or on the same subject:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A collection of literary works, such as poems or short stories, especially a collection from various authors.<br>&nbsp;&nbsp;&nbsp;2. Of a work or series containing various stories with no direct relation to one another.<br>&nbsp;&nbsp;&nbsp;3. (by extension) An assortment of things.<br>&nbsp;&nbsp;&nbsp;4. The study of flowers.<br>", "etymology": "First recorded in 1630–40; from Latin anthologia, from Greek: “collection of poems,” literally, “gathering of flowers,” from anthológ(os) “flower-gathering” ( antho- antho- + -logos, adjective derivative of légein “to gather, recount, say, speak”) + -ia -ia", "example": "A member of the National Book Critics Circle, Woods is the editor of several anthologies and author of four novels in the “Charlotte Justice” mystery series.", "synonym": "album"}, {"word": "vex", "definitionA": "to irritate; annoy; provoke:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A trouble.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To trouble aggressively, to harass.<br>&nbsp;&nbsp;&nbsp;2. To annoy, irritate.<br>&nbsp;&nbsp;&nbsp;3. To cause (mental) suffering to; to distress.<br>&nbsp;&nbsp;&nbsp;4. To twist, to weave.<br>&nbsp;&nbsp;&nbsp;5. To be irritated; to fret.<br>&nbsp;&nbsp;&nbsp;6. To toss back and forth; to agitate; to disquiet.<br>", "etymology": "First recorded in 1375–1425; late Middle English vexen, from Old French vexer, from Latin vexāre “to shake, jolt, harass, annoy,” frequentative of vehere “to carry, convey”", "example": "You know, the same questions that vexed the pilgrims all those years ago.", "synonym": "abrade"}, {"word": "thalweg", "definitionA": "a line, as drawn on a map, connecting the lowest points of a valley.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The line that connects the lowest points in a valley or river channel, and thus the line of fastest flow or deepest water along a river’s course.<br>", "etymology": "1860–65; < German, equivalent to Thal, now obsolete spelling of Tal valley (cognate with dale ) + Weg way 1", "example": "In international law, there’s a principle that if the border between two countries is a waterway, its thalweg marks the boundary line.", "synonym": null}, {"word": "convection", "definitionA": "Physics. the transfer of heat by the circulation or movement of the heated parts of a liquid or gas.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The process of conveying something.<br>&nbsp;&nbsp;&nbsp;2. The transmission of heat in a fluid by the circulation of currents.<br>&nbsp;&nbsp;&nbsp;3. The vertical movement of heat and moisture, especially by updrafts and downdrafts in an unstable air mass. The terms convection and thunderstorm are often used interchangeably, although thunderstorms are only one form of convection. Towering cumulus clouds are visible forms of convection.<br>", "etymology": "First recorded in 1615–25; from Late Latin convectiōn-, stem of convectiō “a bringing together”; equivalent to convect + -ion", "example": "As a planet cools from its surface downward, cold and denser material sinks, while blobs of hotter fluid rise like boiling water -- a process called convection.", "synonym": "alteration"}, {"word": "foy", "definitionA": "Chiefly Scot. a farewell gift, feast, or drink.", "definitionB": "No definition found", "etymology": null, "example": "Owner Sharon Foy fondly recalled his visits to pick up a fish supper.", "synonym": null}, {"word": "ochlocracy", "definitionA": "government by the mob; mob rule; mobocracy.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mob rule; government by the masses; mobocracy.<br>", "etymology": "1475–85; < Greek ochlokratía, equivalent to óchl ( os ) mob + -o- -o- + -kratia -cracy", "example": "But few want to allow voters to write them: that would be not so much democracy, they say, as ochlocracy—mob rule.", "synonym": null}, {"word": "ogee", "definitionA": "a double curve, resembling the letter S, formed by the union of a concave and a convex line.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A double curve in the shape of an elongated S; an object of that shape<br>&nbsp;&nbsp;&nbsp;2. A pointed arch made from two ogees<br>&nbsp;&nbsp;&nbsp;3. An inflection point.<br>&nbsp;&nbsp;&nbsp;4. (aesthetic facial surgery) The malar or cheekbone prominence transitioning into the mid-cheek hollow.<br>&nbsp;&nbsp;&nbsp;5. (distillation) The bubble-shaped chamber of a pot still that connects the swan neck to the pot and allows distillate to expand, condense, and fall back into the pot.<br>", "etymology": "1275–1325; Middle English ogeus, oggez (plural), variant (by assimilation of f ) of oggifs, presumed singular oggif diagonal rib of a vault < Anglo-French, Old French ogive ogive", "example": "For a more traditional look, counters can be fabricated with a variety of shaped edges, from a simple, rounded bullnose to the more decorative ogee — or S-shaped — edge preferred by Schafer.", "synonym": "ambit"}, {"word": "epiphany", "definitionA": "(initial capital letter) a Christian festival, observed on January 6, commemorating the manifestation of Christ to the gentiles in the persons of the Magi; Twelfth-day.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The appearance of Jesus Christ to the Magi on the twelfth day after Christmas.<br>&nbsp;&nbsp;&nbsp;2. An annual Christian feast celebrating this event.<br>&nbsp;&nbsp;&nbsp;3. The day of the celebration, January 6th, or sometimes (in Western Christianity), the Sunday between January 2nd and 8th.<br>&nbsp;&nbsp;&nbsp;4. The season or time of the Christian church year either from the Epiphany feast day to Shrove Tuesday (the day before Ash Wednesday, the start of Lent) or from the Epiphany feast day to the feast of the Presentation of Christ in the Temple.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An illuminating realization or discovery, often resulting in a personal feeling of elation, awe, or wonder.<br>&nbsp;&nbsp;&nbsp;2. A manifestation or appearance of a divine or superhuman being.<br>", "etymology": "First recorded in 1275–1325; Middle English epiphanie, from Late Latin epiphanīa, from Late Greek epipháneia, from Greek: “apparition,” equivalent to epi- epi- ( def ) + phan- (stem of phaínein “to appear”) + -eia -y 3( def )", "example": "Albin’s epiphany in “I Am What I Am” is simple yet profound: He wants neither praise nor pity, but only to be seen as his “own special creation.”", "synonym": "oracle"}, {"word": "hierophant", "definitionA": "(in ancient Greece) an official expounder of rites of worship and sacrifice.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ancient Greek priest who interpreted sacred mysteries, especially the priest of the Eleusinian mysteries.<br>&nbsp;&nbsp;&nbsp;2. An interpreter of sacred mysteries or arcane knowledge.<br>&nbsp;&nbsp;&nbsp;3. One who explains or makes a commentary.<br>", "etymology": "1670–80; < Late Latin hierophanta < Greek hierophántēs, equivalent to hiero- hiero- + -phántēs, derivative of phaínein to show, make known", "example": "To the delighted worshipers, Cody Goodfellow, here a Most Exalted Hierophant, delivered a sermon that started with growled mentions of “doom-engines, black and red,” “great hammers of the scouring” and so on.", "synonym": null}, {"word": "diaphanous", "definitionA": "very sheer and light; almost completely transparent or translucent.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Transparent or translucent; allowing light to pass through; capable of being seen through.<br>&nbsp;&nbsp;&nbsp;2. Of a fine, almost transparent, texture; gossamer; light and insubstantial.<br>&nbsp;&nbsp;&nbsp;3. Isorefractive, having an identical refractive index.<br>", "etymology": "1605–15; < Medieval Latin diaphanus < Greek diaphan(ḗs) transparent, equivalent to diaphan-, stem of diaphaínein to show through ( dia-, -phane ( def ) ) + -ēs adj. suffix) + -ous", "example": "For fall, diaphanous tiers of 1970s flounce in almost angelically light hues defined the show’s aesthetic inside a brutalist warehouse space.", "synonym": null}]