[{"word": "demagogue", "definitionA": "a person, especially an orator or political leader, who gains power and popularity by arousing the emotions, passions, and prejudices of the people.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A political orator or leader who gains favor by pandering to or exciting the passions and prejudices of the audience rather than by using rational argument.<br>&nbsp;&nbsp;&nbsp;2. A leader of the people.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak or act in the manner of a demagogue; to speak about (an issue) in the manner of a demagogue.<br>", "etymology": "1640–50; < Greek dēmagōgós a leader of the people, popular leader, equivalent to dêm ( os ) people + agōgós leading, guiding; -agogue", "example": "Trump, like other autocrats and demagogues, knows that he must always appear to be doing something, a man of action and destiny, to keep and expand his base of support.", "synonym": "fanatic"}, {"word": "uncouth", "definitionA": "awkward, clumsy, or unmannerly:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unfamiliar, strange, foreign.<br>&nbsp;&nbsp;&nbsp;2. Clumsy, awkward.<br>&nbsp;&nbsp;&nbsp;3. Unrefined, crude.<br>", "etymology": "before 900; Middle English; Old English uncūth ( un- 1, couth 2 ); cognate with Dutch onkond", "example": "It was classic Alatorre: uncompromising, uncouth and unapologetic in the name of exerting his influence to better Latinos.", "synonym": null}, {"word": "tousle", "definitionA": "to disorder or dishevel:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The action of ruffling or setting in disorder.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To put into disorder; to tumble; to touse; to muss.<br>", "etymology": "1400–50; late Middle English touselen (v.); cognate with Low German tūseln. See touse, -le", "example": "\"You tousle its mane and pull its ears, but all the time you’re thinking, those claws, those claws, those claws.\"", "synonym": "clutter"}, {"word": "touse", "definitionA": "to handle roughly; dishevel.", "definitionB": "No definition found", "etymology": "1250–1300; Middle English -t ( o ) usen, in betusen, fortusen to handle roughly (simple verb first recorded in the early 16th century); cognate with Old Frisian tūsen to rend, German zausen to tousle", "example": "Researchers have previously found that when people recycle, they feel entitled touse more resources and produce more waste.", "synonym": null}, {"word": "tussle", "definitionA": "to struggle or fight roughly or vigorously; wrestle; scuffle.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A physical fight or struggle.<br>&nbsp;&nbsp;&nbsp;2. A conflict, an argument, a disagreement.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To have a tussle.<br>", "etymology": "1425–75; late Middle English (north and Scots ) tusillen, derivative ( -le ) of tusen to touse", "example": "Yet in their latest tussle with a German giant, Celtic emerged defeated 2-1, but \"not broken\" in the words of manager Brendan Rodgers.", "synonym": "battle"}, {"word": "rigmarole", "definitionA": "an elaborate or complicated procedure:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long and complicated procedure that seems tiresome or pointless.<br>&nbsp;&nbsp;&nbsp;2. Nonsense; confused and incoherent talk.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Prolix; tedious.<br>", "etymology": "First recorded in 1730–40; alteration of ragman roll", "example": "Even though she wants to stay informed, Fox said, she has taken a step back from keeping up with the daily rigmarole of politics.", "synonym": "babble"}, {"word": "quip", "definitionA": "a clever or witty remark or comment.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A smart, sarcastic turn or jest; a taunt; a severe retort or comeback; a gibe.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make a quip.<br>&nbsp;&nbsp;&nbsp;2. To taunt; to treat with quips.<br>", "etymology": "1525–35; back formation from quippy quip < Latin quippe indeed", "example": "Responsible media coverage of these encounters must go beyond a Dr. Phil quip.", "synonym": "badinage"}, {"word": "ragman", "definitionA": "a person who gathers or deals in rag.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A person who collects and sells unwanted household items such as rags and other refuse for a living, a rag and bone man.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A statute issued by Edward I in 1276.<br>&nbsp;&nbsp;&nbsp;2. A document having many names or seals, such as a papal bull.<br>&nbsp;&nbsp;&nbsp;3. A game in which players compete to pull an object from out of a roll of writing.<br>", "etymology": "First recorded in 1350–1400; rag 1 + man", "example": "That front-page story in The Times, from July 1905, had to do with a race riot that broke out when a Black man stepped in to assist a local ragman who needed help making his way through the neighborhood.", "synonym": null}, {"word": "tiff", "definitionA": "a slight or petty quarrel.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small argument; a petty quarrel.<br>&nbsp;&nbsp;&nbsp;2. Liquor; especially, a small draught of liquor.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To quarrel.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To deck out; to dress.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. (British India) To have lunch.<br>", "etymology": "First recorded in 1720–30; origin uncertain", "example": "Her tiffs with Harry are less about her transition and more about the kind of differences a father and daughter would have after they’ve been estranged for decades.", "synonym": "difference"}, {"word": "superfluous ", "definitionA": "being more than is sufficient or required; excessive.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. In excess of what is required or sufficient.<br>", "etymology": "irst recorded in 1400–50; late Middle English, from Latin superfluus, from super- super- + flu- (stem of fluere “to flow”) + -us -ous", "example": "Republicans argue that the costs are superfluous, part of bloated spending of taxpayer funds that President Trump has appointed Elon Musk to pare down.", "synonym": null}]