[{"word": "dolman", "definitionA": "a woman's mantle with capelike arm pieces instead of sleeves.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A long, loose garment with narrow sleeves and an opening in the front, generally worn by Turks.<br>&nbsp;&nbsp;&nbsp;2. A short, close-fitting, heavily braided military jacket, usually worn under a pelisse, originally by hussars.<br>&nbsp;&nbsp;&nbsp;3. A woman's garment with wide capelike sleeves.<br>", "etymology": "1575–85; syncopated variant of doliman, dolyman < Turkish dolaman (obsolete), derivative of dolamak to wind round", "example": "His cropped leather jackets with their dolman sleeves were perfectly proportioned over his attenuated, back-slit skirts.", "synonym": "capote"}, {"word": "lech", "definitionA": "a river in central Europe, rising in SW Austria and flowing generally north through S Germany to the River Danube. Length: 285 km (177 miles)", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A strong, lecherous desire or craving.<br>&nbsp;&nbsp;&nbsp;2. A lecher.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To behave lecherously<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The capstone of a cromlech.<br>", "etymology": "C19: back formation from lecher", "example": "Additionally, the hotel is only open from December through Easter – a period of time when the weather in Lech is frightfully cold.", "synonym": "Casanova"}, {"word": "flop", "definitionA": "to fall or plump down suddenly, especially with noise; drop or turn with a sudden bump or thud (sometimes followed by down ):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An incident of a certain type of fall; a plopping down.<br>&nbsp;&nbsp;&nbsp;2. A complete failure, especially in the entertainment industry.<br>&nbsp;&nbsp;&nbsp;3. The first three cards turned face-up by the dealer in a community card poker game.<br>&nbsp;&nbsp;&nbsp;4. A ponded package of dung, as in a cow-flop.<br>&nbsp;&nbsp;&nbsp;5. A flophouse.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To fall heavily due to lack of energy.<br>&nbsp;&nbsp;&nbsp;2. To cause to drop heavily.<br>&nbsp;&nbsp;&nbsp;3. To fail completely; not to be successful at all (of a movie, play, book, song etc.).<br>&nbsp;&nbsp;&nbsp;4. To pretend to be fouled in sports, such as basketball, hockey (the same as to dive in soccer)<br>&nbsp;&nbsp;&nbsp;5. To strike about with something broad and flat, as a fish with its tail, or a bird with its wings; to rise and fall; to flap.<br>&nbsp;&nbsp;&nbsp;6. To have (a hand) using the community cards dealt on the flop.<br>&nbsp;&nbsp;&nbsp;7. To stay, sleep or live in a place.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. Right, squarely, flat-out.<br>&nbsp;&nbsp;&nbsp;2. With a flopping sound.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any simple operation, such as addition, multiplication or division, performed on floating point numbers using a single operation.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One floating-point operation per second, a unit of measure of processor speed.<br>", "etymology": "First recorded in 1595–1605; variant of flap;  flop def 11 was first recorded in 1890–95.", "example": "That doesn’t mean the new platforms are a flop — or even that they aren’t great.", "synonym": "bomb"}, {"word": "chockablock", "definitionA": "extremely full; crowded; jammed:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. (of a ship's hoisting tackle) Having the blocks drawn close together so no further movement is possible, as when the tackle is hauled to the utmost.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Jammed tightly together; very crowded; completely filled or stuffed.<br>&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. In a crowded manner; as completely or closely as possible.<br>", "etymology": "First recorded in 1790–1800; chock (in the sense wedge) + -a- connnecting vowel that is probably a reduced form of and + block (in the sense solid mass of wood)", "example": "This segment of our show proves that political ads are just straight up confusing, often self-contradictory, chockablock with sophomoric photoshop, yet still thriving despite the fact that everyone says they throw them out immediately.", "synonym": null}, {"word": "careen", "definitionA": "(of a vehicle) to lean, sway, or tip to one side while in motion:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The position of a ship laid on one side.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To heave a ship down on one side so as to expose the other, in order to clean it of barnacles and weed, or to repair it below the water line.<br>&nbsp;&nbsp;&nbsp;2. To tilt on one side.<br>&nbsp;&nbsp;&nbsp;3. To lurch or sway violently from side to side.<br>&nbsp;&nbsp;&nbsp;4. To tilt or lean while in motion.<br>&nbsp;&nbsp;&nbsp;5. (chiefly US) To career, to move rapidly straight ahead, to rush carelessly.<br>&nbsp;&nbsp;&nbsp;6. (chiefly US) To move swiftly and in an uncontrolled way.<br>", "etymology": "1585–95  careen fordef 9; < Middle French carine < Latin carīna keel, nutshell; akin to Greek káryon nut", "example": "Rollerbladers careen down its immaculate sidewalks while couples stroll leisurely past.", "synonym": "bend"}, {"word": "spew", "definitionA": "to discharge the contents of the stomach through the mouth; vomit.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Vomit<br>&nbsp;&nbsp;&nbsp;2. Ejaculate or ejaculation.<br>&nbsp;&nbsp;&nbsp;3. Nonsense or lies.<br>&nbsp;&nbsp;&nbsp;4. Material that has been ejected in a stream, or the act of spewing.<br>&nbsp;&nbsp;&nbsp;5. A white powder or dark crystals that appear on the surface of improperly tanned leather.<br>&nbsp;&nbsp;&nbsp;6. Adhesive that is squeezed from a joint under pressure and held across the joint by a fillet, thereby strengthening the joint.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To eject forcibly and in a stream<br>&nbsp;&nbsp;&nbsp;2. To speak or write quickly and voluminously, especially words that are not worth listening to or reading.<br>&nbsp;&nbsp;&nbsp;3. To vomit<br>&nbsp;&nbsp;&nbsp;4. To ejaculate<br>&nbsp;&nbsp;&nbsp;5. (leather-working) To develop a white powder or dark crystals on the surface of finished leather, as a result from improper tanning.<br>", "etymology": "First recorded before 900; Middle English spewen “to vomit, cast forth foul language,” Old English spīwan “to vomit”; cognate with German speien, Old Norse spȳja, Gothic speiwan, Latin spuere", "example": "Especially not by the faceless boogymen that spew threats with no accountability.", "synonym": "disgorge"}, {"word": "turquoise", "definitionA": "Also turquois.  an opaque mineral, a basic hydrous copper aluminum phosphate often containing a small amount of iron, sky-blue or greenish-blue in color, cut cabochon as a gem. Compare bone turquoise.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A sky-blue, greenish-blue, or greenish-gray semi-precious gemstone.<br>&nbsp;&nbsp;&nbsp;2. A pale greenish-blue colour, like that of the gemstone.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Made of turquoise (the gemstone).<br>&nbsp;&nbsp;&nbsp;2. Having a pale greenish-blue colour.<br>", "etymology": "1350–1400; < French: Turkish (stone), equivalent to Turc Turk + -oise, feminine of -ois -ese; replacing Middle English turkeis < Middle French", "example": "“It’s a nod to joyful abandon,” said Emenegger, 53, who added beeswax, sewing thread and bits of turquoise and coral to an old family photo for her contribution.", "synonym": "color"}, {"word": "electrolysis", "definitionA": "Physical Chemistry. the passage of an electric current through an electrolyte with subsequent migration of positively and negatively charged ions to the negative and positive electrodes.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The chemical change produced by passing an electric current through a conducting solution or a molten salt.<br>&nbsp;&nbsp;&nbsp;2. The destruction of hair roots by means of an electric current.<br>", "etymology": "First recorded in 1830–40; electro- + -lysis", "example": "Green hydrogen takes energy from renewables, cyanobacteria, or algae to separate hydrogen molecules from water through electrolysis.", "synonym": null}, {"word": "bitumen", "definitionA": "any of various natural substances, as asphalt, maltha, or gilsonite, consisting mainly of hydrocarbons.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Mineral pitch; a black, tarry substance, burning with a bright flame. It occurs as an abundant natural product in many places, as on the shores of the Dead and Caspian Seas. It is used in cements, in the construction of pavements, etc.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Any one of the natural hydrocarbons, including the hard, solid, brittle varieties called asphalt, the semisolid maltha and mineral tars, the oily petrolea, and even the light, volatile naphthas.<br>&nbsp;&nbsp;&nbsp;3. Canadian deposits of extremely heavy crude oil.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To cover or fill with bitumen.<br>", "etymology": "1425–75; late Middle English bithumen < Latin bitūmen", "example": "The bricks in Mesopotamian ziggurats were set with bitumen from oil seeps, and people in China were drilling oil wells in the fourth century.", "synonym": null}, {"word": "lignite", "definitionA": "a soft coal, usually dark brown, often having a distinct woodlike texture, and intermediate in density and carbon content between peat and bituminous coal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low-grade, brownish-black coal<br>", "etymology": "First recorded in 1800–10; lign- + -ite 1", "example": "Greece plans to double the use of lignite, a soft, emissions-heavy type of coal, to reduce the natural gas the country is using to generate electricity.", "synonym": null}, {"word": "pyrolysis", "definitionA": "the subjection of organic compounds to very high temperatures.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The decomposition of a material or compound due to heat, in the absence of oxygen or other reagents.<br>", "etymology": "First recorded in 1885–90; pyro- + -lysis", "example": "Pyrolysis is the process of heating organic matter without oxygen—which can turn something like a medical gown made from petroleum into a bunch of tinier, useful chemicals.", "synonym": null}, {"word": "hydrogen", "definitionA": "a colorless, odorless, flammable gas that combines chemically with oxygen to form water: the lightest of the known elements. : H; : 1.00797; : 1; density: 0.0899 grams/liter at 0°C and 760 millimeters pressure.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The lightest chemical element (symbol H), with an atomic number of 1 and atomic weight of 1.00794.<br>&nbsp;&nbsp;&nbsp;2. Molecular hydrogen (H2), a colourless, odourless and flammable gas at room temperature.<br>&nbsp;&nbsp;&nbsp;3. An atom of the element.<br>&nbsp;&nbsp;&nbsp;4. A sample of the element.<br>", "etymology": "First recorded in 1785–95; from the French word hydrogène; hydro- 1, -gen", "example": "That’s because plastics are mainly made up of carbon and hydrogen, very widespread elements.", "synonym": null}]