[{"word": "bleak", "definitionA": "bare, desolate, and often windswept:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Without color; pale; pallid.<br>&nbsp;&nbsp;&nbsp;2. Desolate and exposed; swept by cold winds.<br>&nbsp;&nbsp;&nbsp;3. Unhappy; cheerless; miserable; emotionally desolate.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A small European river fish (Alburnus alburnus), of the family Cyprinidae.<br>", "etymology": "First recorded in 1300–50; Middle English bleke “pale,” blend of variants bleche ( Old English blǣc ) and blake ( Old English blāc ); both cognate with Old Norse bleikr, German bleich; akin to bleach", "example": "It was a bleak image of the future, with an urgent call to action — one that was more or less ignored by the federal government.", "synonym": "comfortless"}, {"word": "clavicle", "definitionA": "a bone of the pectoral arch.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The collarbone; the prominent bone at the top of the chest between the shoulder and the neck connecting the shoulder and the breastbone.<br>", "etymology": "1605–15; < Medieval Latin clāvicula collarbone, Latin: tendril, door-bolt, little key, equivalent to clāvi ( s ) key + -cula -cule 1", "example": "Victor was found by doctors who examined him last week to have suffered past injuries including a broken arm and clavicle.", "synonym": null}, {"word": "liege", "definitionA": "a feudal lord entitled to allegiance and service.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A free and independent person; specifically, a lord paramount; a sovereign.<br>&nbsp;&nbsp;&nbsp;2. (in full liege lord) A king or lord.<br>&nbsp;&nbsp;&nbsp;3. The subject of a sovereign or lord; a liegeman.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Sovereign; independent; having authority or right to allegiance.<br>&nbsp;&nbsp;&nbsp;2. Serving an independent sovereign or master; bound by a feudal tenure; obliged to be faithful and loyal to a superior, such as a vassal to his lord; faithful.<br>&nbsp;&nbsp;&nbsp;3. Full; perfect; complete; pure.<br>", "etymology": "1250–1300; Middle English < Old French li ( e ) ge ≪ Germanic *lēt- vassal + Latin -icus -ic; compare Medieval Latin lētī barbarians allowed to settle on Roman land (< Germanic; perhaps akin to let 1 ), laeticus for *lēticus, derivative of lētī", "example": "My liege, can you blame the mare for going heavily when she bears the weight of three kingdoms on her back?", "synonym": "constant"}, {"word": "dowager", "definitionA": "a woman who holds some title or property from her deceased husband, especially the widow of a king, duke, etc. (often used as an additional title to differentiate her from the wife of the present king, duke, etc.):", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A widow holding property or title derived from her late husband<br>&nbsp;&nbsp;&nbsp;2. Any lady of dignified bearing<br>", "etymology": "1520–30; < Middle French douag ( i ) ere, equivalent to douage dower ( endow, -age ) + -iere, feminine of -ier -ier 2", "example": "When I tell her that Clooney is rumored to also kiss the Dowager Countess during the episode, she chuckles.", "synonym": "matriarch"}, {"word": "angulation", "definitionA": "an angular part, position, or formation.", "definitionB": "No definition found", "etymology": "First recorded in 1865–70; angulate + -ion", "example": "It was necessary, in the case of Mount Rainier, to resort to long-distance methods of angulation.", "synonym": null}, {"word": "sarcasm", "definitionA": "harsh, cutting, or bitter derision, often using irony to point out the deficiencies or failings of someone or something:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Use of acerbic language to mock or convey contempt, often using irony and (in speech) often marked by overemphasis and a sneering tone of voice.<br>&nbsp;&nbsp;&nbsp;2. An act of sarcasm.<br>", "etymology": "First recorded in 1570–80; from Late Latin sarcasmus, from Greek sarkasmós, derivative of sarkázein “to rend (flesh), sneer”; sarco-", "example": "He’s no match to the original C-3PO’s fluency in 6 million forms of communication, but he’s got full linguistic mastery and can learn from humans like humans do—from observation and imitation, whether it’s using sarcasm or sticking dishes into slots.", "synonym": "acrimony"}, {"word": "metamorphosis", "definitionA": "Biology.  a profound change in form from one stage to the next in the life history of an organism, as from the caterpillar to the pupa and from the pupa to the adult butterfly. Compare complete metamorphosis.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A transformation, such as one performed by magic.<br>&nbsp;&nbsp;&nbsp;2. A noticeable change in character, appearance, function or condition.<br>&nbsp;&nbsp;&nbsp;3. A change in the form and often habits of an animal after the embryonic stage during normal development. (e.g. the transformation of a caterpillar into a butterfly or a tadpole into a frog.)<br>&nbsp;&nbsp;&nbsp;4. A change in the structure of a specific body tissue. Usually degenerative.<br>", "etymology": "First recorded in 1525–35; from New Latin metamorphōsis, from Greek metamórphōsis “transformation”; equivalent to meta- + -morph + -osis", "example": "To some degree, the memoir pulls off these linguistic metamorphoses by virtue of its overarching themes of earthquakes and jazz, suggesting that these nonlinear, improvisational models are the only way to tell her story.", "synonym": "alteration"}, {"word": "styrofoam", "definitionA": "a brand of expanded plastic made from polystyrene.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Expanded polystyrene foam, such as is used in cups and packaging.<br>", "etymology": "C20: from polystyrene + foam", "example": "Like Styrofoam packing peanuts, the fibers support the cell’s membranes and proteins, preventing them from breaking or unfolding.", "synonym": "filling"}, {"word": "jurisprudence", "definitionA": "the science or philosophy of law.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The theoretical study of law.<br>", "etymology": "First recorded in 1620–30; from Late Latin jūrisprūdentia, jūris prūdentia “knowledge of the law” and used in the emperor Justinian’s law codes, published between a.d. 529 and 534. See jus, prudence", "example": "Gun violence has been one of the main topics of conversation of anyone talking jurisprudence throughout the country.", "synonym": "assize"}, {"word": "herald", "definitionA": "(formerly) a royal or official messenger, especially one representing a monarch in an ambassadorial capacity during wartime.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A messenger, especially one bringing important news.<br>&nbsp;&nbsp;&nbsp;2. A harbinger, giving signs of things to come.<br>&nbsp;&nbsp;&nbsp;3. An official whose speciality is heraldry, especially one between the ranks of pursuivant and king-of-arms.<br>&nbsp;&nbsp;&nbsp;4. A moth of the species Scoliopteryx libatrix.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To proclaim or announce an event.<br>&nbsp;&nbsp;&nbsp;2. (usually passive) To greet something with excitement; to hail.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The long-tailed duck, or oldsquaw.<br>", "etymology": "1300–50; Middle English herau ( l ) d < Old French herau ( l ) t < Frankish *heriwald, equivalent to *heri army + *wald commander ( wield ). Compare name Harold", "example": "A spokesman for Ericksen told the Herald that month that he was unsure whether the state senator was vaccinated against the coronavirus.", "synonym": "adviser"}, {"word": "theocracy", "definitionA": "a form of government in which God or a deity is recognized as the supreme civil ruler, the God's or deity's laws being interpreted by the ecclesiastical authorities.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Government under the control of a state-sponsored religion.<br>&nbsp;&nbsp;&nbsp;2. Rule by a god.<br>", "etymology": "From the Greek word theokratía, dating back to 1615–25; theo-, -cracy", "example": "Most Americans reject theocracy by judicial decree, with 6 in 10 opposing the Dobbs decision.", "synonym": null}, {"word": "logorrhea", "definitionA": "pathologically incoherent, repetitious speech.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Excessive talkativeness.<br>&nbsp;&nbsp;&nbsp;2. Excessive use of words in writing; prolixity.<br>&nbsp;&nbsp;&nbsp;3. Excessive and often uncontrollable speaking due to a mental disorder.<br>", "etymology": "First recorded in 1900–05; logo- + -rrhea", "example": "I've got enough trouble without your coming down with logorrhea.", "synonym": "garrulousness"}, {"word": "vapid", "definitionA": "without liveliness or spirit; dull or tedious:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Offering nothing that is stimulating or challenging.<br>&nbsp;&nbsp;&nbsp;2. Lifeless, dull, or banal.<br>&nbsp;&nbsp;&nbsp;3. Tasteless, bland, or insipid.<br>", "etymology": "First recorded in 1650–60; from Latin vapidus; akin to vapor", "example": "The hosts, played by Cate Blanchett and Tyler Perry, are vapid and uninterested.", "synonym": null}, {"word": "doldrums", "definitionA": "a state of inactivity or stagnation, as in business or art:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A slothful or stupid person.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Usually preceded by the: a state of apathy or lack of interest; a situation where one feels boredom, ennui, or tedium; a state of listlessness or malaise.<br>&nbsp;&nbsp;&nbsp;2. Usually preceded by the: the state of a sailing ship when it is impeded by calms or light, baffling winds, and is unable to make progress.<br>&nbsp;&nbsp;&nbsp;3. (by extension) Usually preceded by the: a part of the ocean near the equator where calms, squalls, and light, baffling winds are common.<br>", "etymology": "First recorded in 1795–1805; obsolete dold stupid ( dolt ) + -rum(s) (plural) noun suffix ( tantrum )", "example": "The prospects for geothermal—energy extracted from the nuclear furnace at the Earth’s core—are rising after decades in the doldrums.", "synonym": "apathy"}, {"word": "flummox", "definitionA": "to bewilder; confound; confuse.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To confuse; to fluster; to flabbergast.<br>", "etymology": "First recorded in 1830–40; origin uncertain", "example": "So we are entirely flummoxed by this bizarre attempt to treat such a civic-minded endeavor as anything other than a genuine and committed effort to remove barriers that prevent people from getting vaccinated.", "synonym": "buffalo"}, {"word": "flummery", "definitionA": "oatmeal or flour boiled with water until thick.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A custard; any of several bland, gelatinous foodstuffs, usually made from stewed fruit and thickened with oatmeal, cornstarch or flour.<br>&nbsp;&nbsp;&nbsp;2. Empty or meaningless talk, especially when used to flatter.<br>&nbsp;&nbsp;&nbsp;3. Pretentious trappings, useless ornaments used to impress.<br>&nbsp;&nbsp;&nbsp;4. Deceptive or blustering speech.<br>&#60;interjection&#62;<br>&nbsp;&nbsp;&nbsp;1. An expression of contemptuous disbelief.<br>", "etymology": "1615–25; < Welsh llymru, with ending assimilated to -ery", "example": "Oh, but surely if we have to call ourselves Wurzel-Flummery it would count as earned income.", "synonym": "bosh"}, {"word": "unbeknownst", "definitionA": null, "definitionB": "&#60;adverb&#62;<br>&nbsp;&nbsp;&nbsp;1. (followed by to) without the knowledge of<br>", "etymology": null, "example": null, "synonym": "concealed"}, {"word": "aliquot", "definitionA": "Mathematics. forming an exact proper divisor:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A portion of a total amount of a solution or suspension.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To separate a volume of solution or suspension into aliquots.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Contained in the whole an integral number of times, a factor or divisor.<br>", "etymology": "1560–70; < Latin, equivalent to ali- some other + quot as many as", "example": "Aliquot, al′i-kwot, adj. such a part of a number as will divide it without a remainder.", "synonym": null}, {"word": "boggle", "definitionA": "to overwhelm or bewilder, as with magnitude, complexity, or strangeness:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A scruple or objection.<br>&nbsp;&nbsp;&nbsp;2. A bungle; a botched situation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. Either literally or figuratively to stop or hesitate as if suddenly seeing a bogle.<br>&nbsp;&nbsp;&nbsp;2. To be bewildered, dumbfounded, or confused.<br>&nbsp;&nbsp;&nbsp;3. To confuse or mystify; overwhelm.<br>&nbsp;&nbsp;&nbsp;4. To embarrass with difficulties; to palter or equivocate; to bungle or botch.<br>&nbsp;&nbsp;&nbsp;5. To dissemble; to play fast and loose (with someone or something).<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A goblin; a frightful spectre or phantom; a bogy or bugbear.<br>", "etymology": "First recorded in 1590–1600; perhaps from bogle", "example": "If there were a Boggle World Championship, I would play in it.", "synonym": "amaze"}, {"word": "unbeknown", "definitionA": "unknown; unperceived; without one's knowledge (usually followed by to ).", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not beknown.<br>", "etymology": "1630–40; un- 1 + beknown ( late Middle English beknowe, past participle of beknowen ); be-, known", "example": "Twenty-year-old Tiller is supposed to be in college on an overseas program, but unbeknown to his dad, he has spent the last few months on a series of bizarre adventures in Asia.", "synonym": null}, {"word": "assize", "definitionA": "Usually assizes. a trial session, civil or criminal, held periodically in specific locations in England, usually by a judge of a superior court.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A session or inquiry made before a court or jury.<br>&nbsp;&nbsp;&nbsp;2. The verdict reached or pronouncement given by a panel of jurors.<br>&nbsp;&nbsp;&nbsp;3. An assembly of knights and other substantial men, with a bailiff or justice, in a certain place and at a certain time, for public business.<br>&nbsp;&nbsp;&nbsp;4. A statute or ordinance, especially one regulating weights and measures.<br>&nbsp;&nbsp;&nbsp;5. Anything fixed or reduced to a certainty in point of time, number, quantity, quality, weight, measure, etc.<br>&nbsp;&nbsp;&nbsp;6. Measure; dimension; size.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To assess; to set or fix the quantity or price.<br>", "etymology": "1250–1300; Middle English asise < Old French: a sitting, noun use of feminine of asis seated at (past participle of aseeir ), equivalent to a- a- 5 + -sis < Latin sēssum ( sed- stem of sedēre to sit 1 + -tus past participle suffix)", "example": "The judges of assize, by virtue of their commission of nisi prius, try the causes thus appointed.", "synonym": "assembly"}, {"word": "pectoral", "definitionA": "of, in, on, or pertaining to the chest or breast; thoracic.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A pectoral fin.<br>&nbsp;&nbsp;&nbsp;2. Protective armor for a horse's breast.<br>&nbsp;&nbsp;&nbsp;3. A covering or protection for the breast.<br>&nbsp;&nbsp;&nbsp;4. A breastplate, especially that worn by the Jewish high priest.<br>&nbsp;&nbsp;&nbsp;5. A clasp, cross, or ornamental square of cloth etc. worn upon the breast.<br>&nbsp;&nbsp;&nbsp;6. A medicine for diseases of the chest organs, especially the lungs.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to the breast, or chest.<br>&nbsp;&nbsp;&nbsp;2. Relating to, or good for, diseases of the chest or lungs.<br>&nbsp;&nbsp;&nbsp;3. Having the breast conspicuously colored.<br>", "etymology": "1400–50; (noun) late Middle English < Latin pectorāle, noun use of neuter of pectorālis of the breast ( pector-, stem of pectus breast + -ālis -al 1 ); (adj.) < Latin pectorālis", "example": "Thanks to these close relatives, the researchers pieced together how paired fins in the jawless fish evolved in stages to become separate pectoral and pelvic fins in their jawed cousins.", "synonym": null}]
