[{"word": "bungle", "definitionA": "to do clumsily and awkwardly; botch:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A botched or incompetently handled situation.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To botch up, bumble or incompetently perform a task; to make or mend clumsily; to manage awkwardly.<br>", "etymology": "First recorded in 1520–30; of uncertain origin", "example": "Either way, it was a bungle to hope no one could prove the denial.", "synonym": "boggle"}, {"word": "booze", "definitionA": "any alcoholic beverage; whiskey.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any alcoholic beverage.<br>&nbsp;&nbsp;&nbsp;2. A session of drinking alcohol; a drinking party.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To drink alcohol.<br>", "etymology": "1610–20; respelling of bouse 2, reflecting one of its pronunciation variants", "example": "Only, with a truck, motorcycle, or car, you’ll be able to travel much farther, and it’ll be a lot easier to bring items like good food, quality booze, and a comfortable sleep system and shelter along.", "synonym": "cocktail"}, {"word": "trove", "definitionA": "a collection of objects.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A treasure trove; a collection of treasure.<br>&nbsp;&nbsp;&nbsp;2. A collection of things.<br>", "etymology": "First recorded in 1885–90; short for treasure-trove", "example": "It is one of many moments in the audiobook when he describes direct interactions they have had, setting up an expectation that the author is thus armed with a trove of insider-ish insights — or at least previously unrevealed anecdotes.", "synonym": "accession"}, {"word": "pimp", "definitionA": "a person, especially a man, who solicits customers for a prostitute or a brothel, usually in return for a share of the earnings; panderer; procurer.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who solicits customers for prostitution and acts as manager for a group of prostitutes; a pander.<br>&nbsp;&nbsp;&nbsp;2. A man who can easily attract women.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To act as a procurer of prostitutes; to pander.<br>&nbsp;&nbsp;&nbsp;2. To prostitute someone.<br>&nbsp;&nbsp;&nbsp;3. To excessively customize something, especially a vehicle, according to ghetto standards (also pimp out).<br>&nbsp;&nbsp;&nbsp;4. To ask progressively harder and ultimately unanswerable questions of a resident or medical student (said of a senior member of the medical staff).<br>&nbsp;&nbsp;&nbsp;5. To promote, to tout.<br>&nbsp;&nbsp;&nbsp;6. To persuade, smooth talk or trick another into doing something for your benefit.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Excellent, fashionable, stylish<br>&#60;numeral&#62;<br>&nbsp;&nbsp;&nbsp;1. Five in Cumbrian and Welsh sheep counting<br>", "etymology": "First recorded in 1630–40; origin uncertain", "example": "Zola quickly susses out that Stefani’s “roommate” is really her pimp, and he plans to put the two women on the market together.", "synonym": "mack"}, {"word": "obstetrics ", "definitionA": "the branch of medical science concerned with childbirth and caring for and treating women in or in connection with childbirth. : OB, ob", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The care of women during and after pregnancy<br>", "etymology": "irst recorded in 1810–20; obstetric, -ics", "example": "A new study released today in Obstetrics & Gynecology could close this contentious question for good.", "synonym": null}, {"word": "audacious", "definitionA": "extremely bold or daring; recklessly brave; fearless:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Showing willingness to take bold risks; recklessly daring.<br>&nbsp;&nbsp;&nbsp;2. Impudent.<br>", "etymology": "First recorded in 1540–50; audaci(ty) + -ous", "example": "Then, for the next 20 years, the world challenges that audacious optimism.", "synonym": null}, {"word": "vicar", "definitionA": "Church of England.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. In the Church of England, the priest of a parish, receiving a salary or stipend but not tithes.<br>&nbsp;&nbsp;&nbsp;2. In the Roman Catholic and some other churches, a cleric acting as local representative of a higher ranking member of the clergy.<br>&nbsp;&nbsp;&nbsp;3. A person acting on behalf of, or representing, another person.<br>", "etymology": "First recorded in 1300–50; Middle English, from Anglo-French vicare, vicaire, vikere, from Old French vicaire, from Latin vicārius “a substitute, deputy,” noun use of adjective; vicarious", "example": "I heard a story the other day of a neighbor of mine, who was at a dinner party with the local vicar, who is an extremely nice man.", "synonym": "clergyman"}, {"word": "impel", "definitionA": "to drive or urge forward; press on; incite or constrain to action.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To urge a person; to press on; to incite to action or motion via intrinsic motivation.<br>&nbsp;&nbsp;&nbsp;2. To drive forward; to propel an object, to provide an impetus for motion or action.<br>", "etymology": "First recorded in 1375–1425; late Middle English impellen, from Latin impellere “to strike against, set in motion,” from im- im- 1 + pellere “to strike, move”; pulse 1", "example": "The move sparked a revolt, impelling tens of millions of users to flee to rivals such as Signal and Telegram.", "synonym": "actuate"}, {"word": "matrimony", "definitionA": "the state of being married; marriage:", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Marriage; the state of being married.<br>&nbsp;&nbsp;&nbsp;2. The ceremony of marriage.<br>&nbsp;&nbsp;&nbsp;3. A particular solitaire card game using two decks of cards.<br>", "etymology": "1250–1300; Middle English < Latin mātrimōnium wedlock. See matri-, -mony", "example": "When we see loving, committed couples joining in matrimony, our natural impulse is to support and encourage that love.", "synonym": "alliance"}, {"word": "sanctimonious", "definitionA": "making a hypocritical show of religious devotion, piety, righteousness, etc.:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Making a show of being morally better than others, especially hypocritically pious.<br>&nbsp;&nbsp;&nbsp;2. Holy, devout.<br>", "etymology": "First recorded in 1595–1605; sanctimony + -ous", "example": "I suspect other people in the group may see him as sanctimonious, too.", "synonym": null}, {"word": "fealty", "definitionA": "History/Historical. fidelity to a lord", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Fidelity to one's lord or master; the feudal obligation by which the tenant or vassal was bound to be faithful to his lord<br>&nbsp;&nbsp;&nbsp;2. The oath by which this obligation was assumed.<br>", "etymology": "First recorded in 1275–1325; Middle English feute, feaute, fealtye, from Anglo-French, Old French feauté, fealté, from Latin fidēlitāt- (stem of fidēlitās ) fidelity; internal -au-, -al- from feal, reshaping (by substitution of -al- -al 1 ) of fe(d)eil, from Latin fidēlis", "example": "My own fealty lies with the majestically learned Kaske, under whose tutelage I once studied Gregory the Great’s 4,000-page commentary on the Book of Job.", "synonym": "constancy"}]